{
    "name": "Aeonium",
    "climate": [
        "Aeoniums thrive in Mediterranean climates, characterized by wet, mild winters and dry, warm summers.",
        "They prefer environments with a stable temperature without extreme fluctuations, suitable for coastal regions.",
        "These plants do best in areas where frost is minimal because they are not highly frost-resistant.",
        "Aeoniums can adapt to subtropical climates but require protection from excessive humidity."
    ],
    "sunlight": [
        "Aeoniums prefer bright but indirect sunlight, as too much direct sun can scorch their leaves.",
        "Morning sun or partial shade is ideal for these succulents, especially in very hot climates.",
        "They can tolerate full sun in cooler climates, but in hot areas, some afternoon shade is beneficial.",
        "It is crucial to avoid placing them in full shade as they need sunlight to maintain vibrant leaf colors."
    ],
    "watering": [
        "Water Aeoniums deeply and allow the soil to dry out completely between waterings to prevent rot.",
        "During their growing season (fall to spring), increase watering frequency but still let soil dry out.",
        "Reduce watering significantly during their dormant period in summer when they need little moisture.",
        "Overwatering is a common issue; ensure pots have good drainage to avoid standing water."
    ],
    "soil": [
        "Aeoniums need well-draining soil, ideally a mix designed specifically for succulents and cacti.",
        "Add pumice, perlite, or coarse sand to standard potting soil to improve drainage and aeration.",
        "Avoid heavy soils that retain moisture, as Aeoniums are susceptible to root rot if too wet.",
        "A gritty, porous soil mix helps to mimic their natural growing conditions and ensures healthy growth."
    ],
    "toxic": [
        "Aeoniums are generally non-toxic to pets and humans, making them safe for home environments."
    ],
    "extra_care_tip": [
        "Repot Aeoniums as needed during their active growing season in well-draining soil.",
        "Prune to remove any dead leaves and encourage a more attractive shape and healthier growth.",
        "Protect from frost by bringing pots indoors or providing cover during cold weather.",
        "Inspect regularly for pests such as mealybugs or aphids and treat promptly if detected."
    ]
}