{
    "name": "African Iris",
    "climate": [
        "African Iris thrives in warm and sunny climates, making it ideal for regions with mild conditions.",
        "It can tolerate mild frost but prefers temperatures above 50 degrees Fahrenheit for optimal growth.",
        "This plant is suitable for coastal gardens where the climate is typically humid and moderate year-round.",
        "Avoid planting African Iris in regions with prolonged cold or extremely dry conditions, as it prefers moisture."
    ],
    "sunlight": [
        "African Iris requires full sunlight for several hours a day to produce abundant blooms and vigorous growth.",
        "While it can handle partial shade, too much shade will significantly reduce flowering and overall plant health.",
        "In full sun, the plant will display its best traits, but a little afternoon shade can protect it in intense heat.",
        "For best results, plant African Iris in a location that receives morning sun and dappled afternoon shade."
    ],
    "watering": [
        "Keep the soil consistently moist, especially during the growing season; avoid letting it dry completely.",
        "African Iris is relatively drought tolerant but will appreciate regular watering for lush growth and blooming.",
        "Be careful not to overwater, as waterlogged conditions can lead to root rot and plant health issues.",
        "Mulching around the base helps retain moisture and reduces the frequency of watering requirements."
    ],
    "soil": [
        "Plant African Iris in well-draining soil enriched with organic matter for optimal growth and flowering.",
        "It tolerates a range of soil types but prefers sandy or loamy soils with good drainage characteristics.",
        "Avoid heavy clay soils that retain water, as these can impede root development and cause rot.",
        "Enhance the soil with compost or peat moss to improve aeration and nutrient availability for the iris."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune spent flowers regularly to maintain plant tidiness and encourage the growth of fresh blooms.",
        "Divide clumps every few years in early spring to promote healthy growth and to propagate the plant.",
        "Inspect periodically for pests such as aphids, and treat with eco-friendly insecticides if needed.",
        "Protecting the plant with mulch in winter can help in areas where temperatures drop significantly."
    ]
}