{
    "name": "Alocasia Wentii",
    "climate": [
        "Alocasia Wentii grows well in tropical climates, preferring warm, humid conditions throughout the year.",
        "This plant thrives in an environment with high humidity and consistent warmth, typically found in its native Asian habitats.",
        "Temperature stability is crucial; ideal climates are those that avoid drastic temperature fluctuations.",
        "While capable of handling varied conditions, Alocasia Wentii prefers zones mimicking the warmth and moisture of jungles."
    ],
    "sunlight": [
        "Alocasia Wentii prefers bright, indirect light to mimic its natural understory habitat.",
        "Exposing this plant to direct sunlight can cause leaf scorching; filtered light is ideal.",
        "It can adapt to lower light levels but will not thrive as well or grow as robustly.",
        "Providing dappled sunlight helps maintain its vibrant foliage without causing stress or damage."
    ],
    "watering": [
        "This plant requires regular watering but must not be left in overly soggy soil conditions.",
        "Soil should be kept consistently moist, allowing the top layers to dry slightly between waterings.",
        "Overwatering is a common issue; plant roots should never sit in stagnant water to prevent rot.",
        "Adjust watering frequency based on seasonal needs—less frequent in winter months."
    ],
    "soil": [
        "Alocasia Wentii favors a well-draining potting mix that retains some moisture but does not compact.",
        "A mixture of peat, perlite, and standard indoor potting soil promotes healthy root development.",
        "The soil should balance aeration and retention, supporting the plant's lush, tropical foliage.",
        "Using soil amendments like orchid bark can enhance drainage and aerate the mix effectively."
    ],
    "toxic": [
        "Alocasia Wentii contains calcium oxalate crystals, making it toxic to pets and humans when ingested.",
        "Consumption can result in mild to severe oral irritation, prompting caution around children and pets."
    ],
    "extra_care_tip": [
        "Incorporate regular misting or use a humidifier to ensure humidity levels remain above 60%.",
        "Rotate the plant periodically to promote even growth and prevent it from leaning towards one light source."
    ]
}