{
    "name": "Alocasia Polly",
    "climate": [
        "Alocasia Polly thrives in a warm, humid climate typical of tropical regions.",
        "It prefers consistently warm temperatures, ideally between 65 to 85 degrees Fahrenheit.",
        "Avoid letting its environment drop below 60 degrees Fahrenheit to prevent stress.",
        "High humidity levels similar to a rainforest aid in its optimal growth and health."
    ],
    "sunlight": [
        "Alocasia Polly prefers bright, indirect sunlight to maintain vibrant leaf colors.",
        "Direct sunlight can scorch its leaves, leading to brown edges or patches.",
        "Light conditions similar to those under a forest canopy are ideal for it.",
        "A location near a north or east-facing window usually provides the best light."
    ],
    "watering": [
        "The potting soil of Alocasia Polly should be kept consistently moist but not soggy.",
        "Water it thoroughly once the top inch of soil is dry, being careful not to overwater.",
        "During winter, watering frequency can be reduced when the plant's growth slows down.",
        "Always ensure excess water can drain well to prevent root rot from standing water."
    ],
    "soil": [
        "Alocasia Polly thrives best in well-draining soil that retains some moisture.",
        "A mix of potting soil, perlite, and orchid bark works well for adequate aeration.",
        "Peat-based medium with added coarse material can prevent waterlogging effectively.",
        "The soil structure should facilitate efficient drainage to keep the roots healthy."
    ],
    "toxic": [
        "Alocasia Polly contains calcium oxalate crystals which are toxic if ingested.",
        "Ingestion can cause symptoms such as oral irritation, swelling, and difficulty swallowing.",
        "It's important to keep this plant out of reach of pets like cats and dogs.",
        "In case of ingestion, seek immediate veterinary or medical assistance."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to remove dust and allow better photosynthesis.",
        "Repot in spring every couple of years or when outgrown its current pot to refresh soil.",
        "Consider using a pebble tray or humidifier if indoor air is too dry for adequate humidity.",
        "Monitor for pests such as spider mites and treat promptly to keep the plant healthy."
    ]
}