{
    "name": "Alocasia ‘Regal Shield’",
    "climate": [
        "Alocasia ‘Regal Shield’ thrives in tropical to subtropical climates, where the temperature is warm and humid.",
        "This plant requires a consistently warm environment, ideally with temperatures ranging between 65°F and 85°F.",
        "It does not tolerate cold weather well, so temperatures should not drop below 60°F to ensure optimal growth.",
        "High humidity levels are crucial for the plant's health, mimicking its natural tropical habitat."
    ],
    "sunlight": [
        "Alocasia ‘Regal Shield’ prefers bright, indirect sunlight to grow well and maintain vibrant leaf color.",
        "Direct sunlight should be avoided as it can scorch the leaves, leading to discoloration and damage.",
        "In low-light conditions, the plant may become leggy, thus ensuring adequate light is vital for its development.",
        "Artificial grow lights can be used to supplement natural light in rooms with insufficient natural light."
    ],
    "watering": [
        "Watering should be done consistently, keeping the soil slightly moist but not waterlogged to prevent root rot.",
        "It's vital to allow the top inch of the soil to dry out between waterings, promoting healthy root growth.",
        "During the growing season, the frequency of watering may increase as the plant absorbs more water in warmer temperatures.",
        "Reduce watering in the winter months, as the plant enters a dormant phase, requiring less moisture for survival."
    ],
    "soil": [
        "A well-draining potting mix is essential for Alocasia ‘Regal Shield’ to prevent waterlogging.",
        "An ideal mix can include perlite or orchid bark to enhance drainage and aeration around the roots.",
        "Rich, organic matter within the soil helps provide nutrients needed for optimal growth and leaf development.",
        "The soil should retain some moisture without becoming compacted, allowing roots to access air and water easily."
    ],
    "toxic": [
        "Alocasia ‘Regal Shield’ is toxic to pets and humans if ingested due to calcium oxalate crystals."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves to remove dust and promote photosynthesis, especially in indoor environments."
    ]
}