{
    "name": "Alocasia Macrorrhiza ‘Stingray’",
    "climate": [
        "Prefers warm, tropical climates where temperatures are consistently high.",
        "Humidity levels should be maintained high, mimicking a rainforest environment.",
        "Cannot tolerate cold climates and should be kept away from drafts or sudden temperature drops.",
        "Temperatures should ideally be kept between 18°C to 27°C for optimal growth."
    ],
    "sunlight": [
        "Thrives in bright, indirect sunlight but can tolerate some mild morning sunlight.",
        "Direct sunlight should be avoided as it can cause leaf burning and damage.",
        "Place near an east-facing window to provide adequate light without harsh exposure.",
        "In insufficient light conditions, leaf growth may become stunted or slowed."
    ],
    "watering": [
        "Water regularly to keep the soil evenly moist but not waterlogged.",
        "Allow the top inch of soil to dry out between watering to prevent root rot.",
        "During the growing season, maintain consistent watering for robust growth.",
        "In fall and winter, reduce watering frequency as growth and soil evaporation slow down."
    ],
    "soil": [
        "Requires well-draining, nutrient-rich soil to prevent water retention.",
        "A mix of potting soil, perlite, and peat moss can provide proper aeration.",
        "Soil should support good drainage to avoid root rot, common in dense or compacted mixes.",
        "Organic matter in the soil will help maintain moisture and provide nutrients."
    ],
    "toxic": [
        "Alocasia Macrorrhiza contains calcium oxalate crystals, which can be toxic when ingested.",
        "Avoid ingestion by pets and humans, as it can cause oral irritation and digestive issues."
    ],
    "extra_care_tip": [
        "Regularly wipe leaves with a damp cloth to remove dust and support photosynthesis.",
        "Ensure high humidity by misting regularly or using a humidifier in dry environments."
    ]
}