{
    "name": "Alocasia Melo",
    "climate": [
        "Prefers a tropical climate with high humidity levels and consistent warm temperatures.",
        "Avoids climates with temperature fluctuations; should be kept in stable conditions.",
        "Sensitive to cold drafts and should be protected from chilly environments.",
        "Best suited for indoor climates that mimic its native humid, warm conditions."
    ],
    "sunlight": [
        "Thrives in bright, indirect light but must be shielded from direct sun.",
        "Direct sunlight can scorch the leaves, causing permanent damage to the plant.",
        "Tolerates lower light conditions but may result in slower growth.",
        "Supplement lighting with grow lights if natural light is insufficient indoors."
    ],
    "watering": [
        "Requires consistent moisture; avoid letting the soil dry out completely.",
        "Overwatering should be avoided to prevent root rot; ensure proper drainage.",
        "Needs less frequent watering in dormancy periods during cooler months.",
        "Increase watering frequency during active growth periods in warmer conditions."
    ],
    "soil": [
        "Prefers well-draining soil rich in organic matter and good aeration.",
        "A mixture of potting soil with perlite or orchid bark helps improve drainage.",
        "Avoid using heavy soils that retain too much water, leading to root issues.",
        "The ideal soil pH ranges from slightly acidic to neutral for best growth."
    ],
    "toxic": [
        "Alocasia Melo contains calcium oxalate crystals, which are toxic if ingested.",
        "Can cause irritation and swelling in the mouth and throat if consumed.",
        "Handle with care as sap can cause skin irritation on sensitive skin.",
        "Keep away from pets and children to prevent accidental ingestion."
    ],
    "extra_care_tip": [
        "Benefits from regular misting to maintain high humidity levels around the plant.",
        "Wipe leaves regularly to remove dust and increase the plant's ability to photosynthesize.",
        "Use room temperature water for watering to prevent shocking the roots.",
        "Regularly check for pest infestations such as spider mites or aphids on the foliage."
    ]
}