{
    "name": "Alocasia Baginda 'Silver Dragon'",
    "climate": [
        "This plant thrives best in a tropical climate, with high humidity and warmth.",
        "It prefers a consistent environment without drastic temperature changes.",
        "Avoid environments with cold drafts as they can harm the plant.",
        "Indoor humidity levels should be kept high to mimic its natural habitat."
    ],
    "sunlight": [
        "Alocasia Baginda 'Silver Dragon' prefers bright, indirect sunlight.",
        "Direct sunlight can scorch its leaves, so filtered light is ideal.",
        "If kept outdoors, ensure it's under shade to protect from direct sun.",
        "Low-light conditions can slow growth but should be avoided for best results."
    ],
    "watering": [
        "Water the plant when the top inch of soil feels dry but do not let it dry out completely.",
        "Ensure that excess water can drain away to prevent root rot, a common issue.",
        "Humidity is crucial, so consider misting regularly to boost moisture levels.",
        "In winter, reduce watering frequency, allowing the plant to enter dormancy."
    ],
    "soil": [
        "Use a well-draining potting mix, ideally designed for aroids or houseplants.",
        "The soil mixture should retain some moisture but also allow excess water to drain away.",
        "Incorporate materials like perlite or orchid bark to enhance drainage.",
        "Avoid overly compact soil as it can suffocate roots and lead to health issues."
    ],
    "toxic": [
        "Alocasia Baginda 'Silver Dragon' is toxic if ingested by pets or humans.",
        "Symptoms may include oral irritation, swelling, and difficulty swallowing."
    ],
    "extra_care_tip": [
        "Regularly check for pests like spider mites, which can be attracted to its foliage.",
        "Consider using a humidifier in dry climates to maintain optimal humidity levels.",
        "Repotting every 1-2 years is beneficial to refresh the soil and support growth.",
        "Fertilize during the growing season to provide necessary nutrients for robust development."
    ]
}