{
    "name": "Alocasia Pink Dragon",
    "climate": [
        "Tropical climates are ideal for Alocasia Pink Dragon, simulating its native habitat.",
        "High humidity is essential for this plant to thrive, mimicking rainforest conditions.",
        "Warm temperatures should be maintained, ideally between 18-25째C (64-77째F).",
        "Avoid exposure to cold drafts or temperatures below 15째C (59째F)."
    ],
    "sunlight": [
        "Prefers bright, indirect sunlight to grow and thrive effectively.",
        "Direct sunlight can harm the leaves, causing them to scorch and turn yellow.",
        "Shade from harsh midday sun using sheer curtains or blinds for protection.",
        "In lower light conditions, growth may slow, so ensure adequate light availability."
    ],
    "watering": [
        "Keep the soil consistently moist but not waterlogged to avoid root rot.",
        "In hot weather, increase watering frequency to maintain adequate moisture.",
        "During the winter months, reduce watering frequency as plant growth slows.",
        "Use room temperature water to avoid shocking the plant's system."
    ],
    "soil": [
        "Rich, well-draining soil with a mix of organic matter is preferred.",
        "A soil mix including peat, perlite, and pine bark can enhance drainage.",
        "Avoid compacted soil that retains excess moisture, risking root health.",
        "Good aeration in the soil is crucial, ensuring roots receive proper oxygen."
    ],
    "toxic": [
        "The plant contains calcium oxalate crystals which are toxic if ingested.",
        "Symptoms of ingestion include oral irritation, swelling, and discomfort.",
        "Keep out of reach of pets and children to prevent accidental ingestion.",
        "Handling may cause skin irritation, so wash hands after contact."
    ],
    "extra_care_tip": [
        "Use a humidifier or mist regularly to meet humidity requirements for optimal growth.",
        "Wipe the leaves with a damp cloth to remove dust, improving photosynthesis.",
        "Rotate the plant periodically to ensure even growth on all sides.",
        "Inspect regularly for pests like spider mites, treating promptly if found."
    ]
}