{
    "name": "Alocasia Azlanii",
    "climate": [
        "Alocasia Azlanii thrives in a tropical climate where humidity levels are high and temperatures are consistently warm.",
        "This plant prefers a climate that mimics the rainforest, with high humidity and low to moderate air flow.",
        "In its natural habitat, it grows under the canopy of trees, where it is provided with humidity and warmth.",
        "While humidity should be above 60%, temperatures are ideally maintained between 60 to 85 degrees Fahrenheit."
    ],
    "sunlight": [
        "Alocasia Azlanii prefers bright, indirect sunlight to maintain its vibrant colors and healthy growth.",
        "Direct sunlight can cause leaf burn, so it's best placed near a window with filtered light or in partial shade.",
        "If indoors, locating it in an east or north-facing window will provide it with adequate indirect light.",
        "Strong sunlight can damage the leaves, so avoid harsh afternoon sun, which can lead to leaf scorch."
    ],
    "watering": [
        "Watering should be consistent; the soil should be kept moist but not waterlogged to prevent root rot.",
        "Allow the top inch of soil to dry out between waterings, ensuring drainage is adequate to prevent standing water.",
        "During the growing season, more frequent watering may be required, adjusting as necessary for humidity and light.",
        "Reduce watering during the winter months, as the plant's growth slows and its water needs decrease."
    ],
    "soil": [
        "A rich, well-draining potting mix that retains some moisture is ideal for Alocasia Azlanii for healthy growth.",
        "Incorporate perlite, peat moss, and orchid bark into the soil to enhance drainage and aeration.",
        "Avoid heavy or clay soils that retain excess moisture, as they can lead to root rot and other issues.",
        "A mix that is designed for aroids or tropical plants can provide the right balance of nutrients and drainage."
    ],
    "toxic": [
        "Alocasia Azlanii is toxic when ingested by pets and humans, due to calcium oxalate crystals.",
        "Ingestion can cause irritation and swelling in the mouth and throat, and care should be taken to keep away from pets."
    ],
    "extra_care_tip": [
        "Alocasia Azlanii benefits from high humidity; consider using a pebble tray or humidifier to maintain levels.",
        "Regularly clean the leaves with a damp cloth to prevent dust accumulation and to maintain leaf health."
    ]
}