{
    "name": "Angelica",
    "climate": [
        "Angelica thrives in temperate climates where winters are cold. It prefers cool and moist environments similar to its native regions in Europe and Asia.",
        "This plant grows well in areas with a defined cold season, which helps it to bloom and set seeds correctly. A consistently cool climate supports its growth cycle.",
        "Angelica can tolerate some variations in temperature, but it suffers in hot, arid climates. It does best in places with mild summers where humidity is relatively high.",
        "Ideal climates for Angelica include those that experience moderate rainfall throughout the year, providing consistent moisture that the plant needs to thrive."
    ],
    "sunlight": [
        "Angelica prefers partial shade to full sun, though too much sunlight can cause its leaves to scorch. It's accustomed to growing on forest edges where light is filtered.",
        "Providing Angelica with morning sun and afternoon shade helps prevent overheating and leaf burn, promoting a healthy, vibrant growth.",
        "The plant benefits from at least a few hours of direct sunlight daily, but protection from the harsh midday sun is necessary to prevent stress.",
        "In gardens, Angelica should be positioned where it can receive dappled sunlight or be shielded by taller plants to simulate its natural habitat."
    ],
    "watering": [
        "Angelica requires consistent moisture to thrive but should not be left in waterlogged soil. It needs regular watering without letting the soil dry out completely.",
        "Ensuring a humid environment with evenly moist soil helps Angelica grow properly, especially during its growing season. Mulching can help retain moisture.",
        "During hot weather or dry spells, additional watering may be necessary to keep the soil sufficiently damp, ensuring the plant's roots receive consistent hydration.",
        "Avoid overwatering and stagnant water to prevent root rot, but never let the soil fully dry. Checking soil moisture regularly is crucial for Angelica care."
    ],
    "soil": [
        "Angelica prefers rich, well-draining soil with a high organic matter content. Such soil mimics its natural growing conditions, promoting healthy growth.",
        "The plant does best in slightly acidic to neutral pH levels. Mixing compost or well-aged manure can improve soil structure and nutrient content.",
        "Good drainage is essential for Angelica, as waterlogged soil can lead to root rot. A mix of loam, sand, and compost helps optimize drainage and fertility.",
        "Enhancing soil with organic matter not only supports nutrient needs but also helps retain moisture, which is vital for Angelica, especially in dry weather."
    ],
    "toxic": [
        "Angelica can be toxic to pets and humans if ingested in large amounts, due to the presence of furocoumarins, which can cause photodermatitis.",
        "Handling Angelica may cause skin irritation or sensitivity to sunlight, especially for individuals with sensitive skin, due to its aromatic oils."
    ],
    "extra_care_tip": [
        "Prune angelica plants after the flowering season to prevent excessive seeding and maintain plant vigor. This also promotes more substantial future growth.",
        "Support young Angelica plants with stakes or cages, especially in windy areas, to prevent them from toppling over as they reach maturity."
    ]
}