{
    "name": "Angel Trumpet Datura",
    "climate": [
        "Angel Trumpet Datura prefers warm climates and can thrive in USDA zones 9-11, where temperatures rarely drop below freezing.",
        "This plant enjoys subtropical and tropical climates, where the conditions are characterized by high humidity and minimal temperature fluctuations.",
        "In colder regions, Angel Trumpet Datura can be grown indoors or in greenhouses where temperatures can be controlled effectively.",
        "It struggles in climates with prolonged cold temperatures, especially where frost is common, as it is sensitive to freezing conditions."
    ],
    "sunlight": [
        "Angel Trumpet Datura requires full sun exposure for most of the day to encourage vigorous blooming and healthy growth.",
        "The plant can tolerate partial shade, but it may result in reduced flowering and elongated, weaker stems in such conditions.",
        "Ensure the plant receives at least 6-8 hours of direct sunlight daily, especially during its peak growing season.",
        "In extremely hot climates, some afternoon shade may protect the plant from scorching and prevent leaf burn."
    ],
    "watering": [
        "The Angel Trumpet Datura requires consistent watering to maintain moist, but not waterlogged, soil for optimal growth.",
        "During active growth in spring and summer, water deeply to encourage roots to grow deeply and sustain the plant.",
        "Reduce watering frequency in fall and winter, allowing the topsoil to dry slightly between waterings to prevent root rot.",
        "Pay close attention to drainage, as standing water can lead to root diseases, impacting the plant's health significantly."
    ],
    "soil": [
        "Angel Trumpet Datura thrives in rich, well-draining soil with high organic content to support its growth needs.",
        "A slightly acidic to neutral pH level provides an optimal environment for nutrient uptake essential for healthy development.",
        "Amending the soil with compost or well-rotted manure adds nutrients and improves drainage, benefiting the plant's well-being.",
        "Avoid heavy clay soils that retain moisture, as they can increase the risk of root rot, hampering the plant's vitality."
    ],
    "toxic": [
        "Angel Trumpet Datura contains toxic alkaloids and is highly poisonous if ingested by humans or animals.",
        "All parts of the plant, especially the seeds and leaves, can cause severe hallucinations, seizures, or even death if consumed."
    ],
    "extra_care_tip": [
        "In climates with harsh winters, consider growing Angel Trumpet Datura in containers to move them indoors for protection."
    ]
}