{
    "name": "Arrowhead Vine",
    "climate": [
        "Prefers a warm, humid climate similar to that of its native tropical regions.",
        "Ideal growing temperatures are between 60-75°F (15-24°C) for optimal health.",
        "Arrowhead Vines thrive in USDA zones 10-12 where frost is not a concern.",
        "Ensure that the plant is not exposed to cold drafts or sudden temperature changes."
    ],
    "sunlight": [
        "Tolerates a range of light conditions but grows best in bright, indirect light.",
        "Direct sunlight can scorch its leaves, causing them to brown or develop spots.",
        "In lower light conditions, growth may slow, and leaf variegation may fade.",
        "Can adapt to fluorescent lighting, making it suitable for office environments."
    ],
    "watering": [
        "Water the plant thoroughly, then allow the top inch of soil to dry before re-watering.",
        "Over-watering can lead to root rot, which is detrimental to the plant’s health.",
        "During the winter months, reduce watering as growth slows significantly.",
        "Maintain consistent moisture levels, especially in warmer months, for vibrant growth."
    ],
    "soil": [
        "Prefers a well-draining potting mix with a high organic matter content.",
        "A mixture of peat, perlite, and potting soil provides a balanced medium.",
        "Amendments such as orchid bark can enhance aeration and drainage.",
        "Avoid heavy soils that retain water, leading to potential root health issues."
    ],
    "toxic": [
        "Arrowhead Vine is toxic to pets such as cats and dogs if ingested.",
        "Contains calcium oxalate crystals, which can cause irritation in the mouth.",
        "Symptoms of ingestion include drooling, vomiting, and difficulty swallowing.",
        "Keep out of reach of pets and small children to prevent accidental ingestion."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain shape and encourage bushier growth as desired.",
        "Rotate the pot periodically to ensure even growth towards the light source.",
        "To increase humidity, mist the leaves or place the pot on a humidity tray.",
        "Provide a moss pole or trellis for the plant to climb as it matures."
    ]
}