{
    "name": "Artichoke",
    "climate": [
        "Artichokes thrive best in Mediterranean climates that offer mild, wet winters.",
        "They require a long growing season, typically around 150–180 days, to reach maturity.",
        "Ideal temperatures for artichoke cultivation range from 50°F to 75°F (10°C to 24°C).",
        "Cold temperatures can damage the buds, while extreme heat can cause bolting, affecting yield."
    ],
    "sunlight": [
        "Artichokes need full sun exposure to grow properly, receiving at least 6 hours daily.",
        "Inadequate sunlight can stunt growth and reduce the quantity and quality of the buds.",
        "In extremely hot climates, some shade during peak heat can prevent stress on plants.",
        "Position artichokes in a sunny, open location to allow them to absorb maximum light."
    ],
    "watering": [
        "Consistent and adequate watering is crucial for artichokes, especially during dry spells.",
        "The soil should remain evenly moist but not waterlogged to prevent root rot issues.",
        "Regular watering during bud formation ensures they develop to their full size and flavor.",
        "Mulching around the plants can help retain soil moisture and reduce the frequency of watering."
    ],
    "soil": [
        "Artichokes prefer well-drained, loamy soil rich in organic matter for optimal growth.",
        "Heavy clay or sandy soils should be amended with organic compost to improve fertility.",
        "A soil pH range of 6.5 to 7.5 is recommended for the best nutrient availability.",
        "Good drainage is essential to prevent waterlogging and root diseases, promoting healthier plants."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Remove spent flower stalks promptly to encourage further budding and prolong harvest.",
        "Apply a balanced fertilizer in early spring to support the plant's nutritional needs.",
        "Protect young artichoke plants from frost using row covers or other insulative materials.",
        "Regularly inspect for pests like aphids and snails, implementing control measures as needed."
    ]
}