{
    "name": "Astilbe",
    "climate": [
        "Astilbes thrive in cool and humid climates, often enjoying areas similar to woodland settings.",
        "They prefer climates with moderate rainfall, avoiding arid or overly dry conditions.",
        "Climate with prolonged dry periods can be damaging as Astilbes require consistent moisture.",
        "Mild summers with adequate moisture and less extreme temperatures are ideal for Astilbes."
    ],
    "sunlight": [
        "Astilbes prefer dappled sunlight or partial shade, mimicking their natural forest habitats.",
        "While they can tolerate full sun, they must have sufficient moisture to prevent scorching.",
        "Complete shade can result in fewer blooms and less vibrant foliage over time.",
        "Exposure to morning sun with afternoon shade is often recommended for optimal growth."
    ],
    "watering": [
        "Astilbes require consistent and regular watering, especially in periods of heat.",
        "The soil should be kept moist, not waterlogged, to ensure healthy root systems.",
        "In dry climates, increased irrigation may be necessary to maintain soil moisture.",
        "Mulching can help retain moisture and reduce watering frequency for Astilbes."
    ],
    "soil": [
        "Astilbes thrive in well-drained, rich organic soil, mimicking forest floors.",
        "They prefer acidic to neutral pH levels in soil for optimal nutrient uptake.",
        "Heavy clay soils should be amended with compost to improve drainage.",
        "Sandy soils need added organic matter to retain the necessary moisture levels."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To encourage fuller blooms, regularly deadhead spent flowers throughout the growing season.",
        "Divide overcrowded Astilbe clumps every three to four years to rejuvenate growth.",
        "Apply a slow-release fertilizer in early spring to support vigorous blooming.",
        "In winter, protect Astilbes with a layer of mulch to prevent frost damage to roots."
    ]
}