{
    "name": "Autumn Fern",
    "climate": [
        "The Autumn Fern thrives in temperate climates where the temperature remains moderate.",
        "It prefers areas with high humidity levels, replicating its native forest conditions.",
        "The plant can withstand mild frost but needs protection from extreme cold weather.",
        "It is not well-suited for extremely hot or dry climates and needs regular moisture."
    ],
    "sunlight": [
        "Autumn Fern does best in partial to full shade, avoiding harsh direct sunlight.",
        "Direct sunlight may scorch the leaves, leading to browning and loss of vibrancy.",
        "Ideal sunlight conditions include dappled sunlight or morning sun with afternoon shade.",
        "Shaded environments similar to forest understories are ideal for Autumn Fern growth."
    ],
    "watering": [
        "Consistent moisture is critical; keep the soil evenly moist but not waterlogged.",
        "During dry spells, increase watering frequency to maintain soil moisture levels.",
        "Allow the top inch of soil to dry slightly between waterings to prevent root rot.",
        "In winter, reduce watering, as the plant requires less water during its dormant phase."
    ],
    "soil": [
        "Autumn Ferns prefer rich, organic soil that retains moisture yet drains well.",
        "Incorporate compost or peat moss to enhance soil quality and nutrient content.",
        "Avoid heavy clay soils as they may lead to water retention and root issues.",
        "A slightly acidic soil pH, similar to forest floors, is beneficial for growth."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Autumn Ferns benefit from mulching to retain soil moisture and regulate temperature.",
        "Prune dead or damaged fronds in early spring to encourage healthy new growth.",
        "In cold zones, apply a layer of mulch in winter for additional root protection.",
        "Regularly monitor for pests such as aphids or fern scale, which can damage foliage."
    ]
}