{
    "name": "Bear's Breeches",
    "climate": [
        "Bear's Breeches thrive in Mediterranean climates characterized by mild, wet winters and hot, dry summers.",
        "They can tolerate a range of conditions but grow best in regions with cool, moist winters and warm summers.",
        "This plant prefers climates that do not experience extreme cold, thriving in USDA zones 7 through 10.",
        "It's important to avoid overly humid climates as excessive moisture can lead to fungal diseases."
    ],
    "sunlight": [
        "Bear's Breeches prefer full sun to partial shade, allowing them to develop their distinctive leaf shape.",
        "They require at least six hours of sunlight per day for optimal growth and flowering performance.",
        "In hotter climates, providing afternoon shade can prevent the leaves from scorching and wilting.",
        "If grown in too much shade, the plant may fail to flower and can become leggy and weak."
    ],
    "watering": [
        "Bear's Breeches prefer regular watering to keep the soil consistently moist during the growing season.",
        "It's important to water deeply and infrequently, allowing the top inch of soil to dry out between waterings.",
        "Avoid overhead watering to reduce the risk of leaf spots and fungal diseases affecting the foliage.",
        "During periods of drought or high heat, increase watering to prevent wilting and maintain plant health."
    ],
    "soil": [
        "They thrive in well-draining soil that is rich in organic matter and retains some moisture.",
        "A garden loam or sandy soil amended with compost will provide ideal growing conditions for this plant.",
        "They can tolerate poor soils but prefer those that are fertile and slightly acidic to neutral in pH.",
        "Compacted or poorly draining soils can lead to root rot, so ensure good drainage is available."
    ],
    "toxic": [
        "The plant contains saponins and can cause mild stomach upset if ingested by pets or humans.",
        "Handling the plant may cause skin irritation in sensitive individuals; wearing gloves is advised."
    ],
    "extra_care_tip": [
        "Bear's Breeches can spread aggressively; regular pruning can help manage its growth habit in gardens.",
        "Cutting back the spent flower stalks can encourage a tidy appearance and prevent self-seeding.",
        "Providing a winter mulch in colder regions can protect the plant's roots from freezing temperatures.",
        "Dividing the clumps every few years in early spring can help rejuvenate older plants and promote vigor."
    ]
}