{
    "name": "Black Mondo Grass",
    "climate": [
        "Black Mondo Grass thrives in temperate climates, where it can enjoy cool to moderate temperatures year-round.",
        "It is adaptable to various climate conditions but performs best in areas without extreme cold or heat.",
        "This plant can tolerate some mild frost but needs protection from extremely harsh winter climates.",
        "Black Mondo Grass is ideal for USDA hardiness zones 6 through 9, making it versatile for different regions."
    ],
    "sunlight": [
        "This plant prefers partial to full shade, with morning sunlight being most beneficial for optimal growth.",
        "It can tolerate full sun in cooler climates, but in hotter areas, it requires some shade to avoid scorching.",
        "Filtered or dappled sunlight provides the best conditions, helping to maintain the plant's deep coloration.",
        "Protection from the harsh afternoon sun is essential in warmer climates to prevent leaf burn and stress."
    ],
    "watering": [
        "Water regularly to keep the soil consistently moist; do not allow the soil to dry out completely.",
        "During hotter months, more frequent watering may be necessary to compensate for increased evaporation.",
        "In cooler seasons, reduce the frequency of watering but ensure the soil remains slightly moist.",
        "Avoid waterlogging, as this can lead to root rot; ensure good drainage in pots or garden beds."
    ],
    "soil": [
        "Black Mondo Grass prefers well-draining soil with a rich, organic content to support its growth.",
        "A loamy soil with added compost or leaf mold will enhance nutrition and moisture retention.",
        "It can tolerate a range of pH levels but grows best in slightly acidic to neutral soils.",
        "Amend the soil with sand or perlite if necessary, ensuring adequate drainage to prevent root rot."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Divide clumps every few years in early spring to promote vigorous growth and maintain healthy plants.",
        "Mulching around the base can help retain moisture, suppress weeds, and provide additional nutrients.",
        "Remove any dead or damaged leaves regularly to improve appearance and encourage new growth.",
        "Consider applying a slow-release fertilizer in early spring to support robust foliage development."
    ]
}