{
    "name": "Blanket Flower",
    "climate": [
        "Blanket flowers thrive in temperate regions, enjoying mild summers and cool winters.",
        "These plants are well-adapted to dry climates, performing best with low humidity levels.",
        "In subtropical regions, they can still flourish, provided they are protected from high humidity.",
        "They can tolerate a range of climatic conditions but perform poorly in extremely humid areas."
    ],
    "sunlight": [
        "Full sunlight is essential for blanket flowers to bloom profusely and maintain health.",
        "While they prefer direct sunlight, they can tolerate very light shade for short periods.",
        "At least six to eight hours of direct sun per day is recommended for optimal growth.",
        "Insufficient sunlight can result in fewer flowers and a general decline in plant vigor."
    ],
    "watering": [
        "Blanket flowers do not require heavy watering, preferring drier soil conditions.",
        "Overwatering should be avoided as it can lead to root rot and fungal diseases.",
        "Allowing the soil to dry out between waterings encourages deep root growth.",
        "In very dry conditions, a moderate watering once a week is usually sufficient."
    ],
    "soil": [
        "Well-draining soil is crucial; sandy or gravelly types are often best.",
        "They are tolerant of poor soil conditions but prefer a slightly acidic pH level.",
        "Improving drainage with organic matter can benefit their long-term health.",
        "Heavy, clay-based soils should be amended to prevent water retention issues."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Deadheading spent flowers can prolong blooming and improve plant appearance.",
        "Mulching can help retain soil moisture and reduce weed competition around the plant.",
        "Cutting back the plant in late autumn encourages a more vigorous regrowth in spring.",
        "Regular inspection for pests such as aphids and caterpillars is recommended to prevent damage."
    ]
}