{
    "name": "Bleeding Heart",
    "climate": [
        "Bleeding Heart thrives in cool, temperate climates, favoring spring and early summer conditions.",
        "This plant prefers a climate with moist, well-drained soil and avoids extreme heat.",
        "It is best suited to regions with distinct seasonal changes, such as temperate zones.",
        "The plant is generally not frost-tolerant and does best in regions without harsh winters."
    ],
    "sunlight": [
        "Bleeding Heart prefers partial to full shade for optimal growth and flowering.",
        "Direct sunlight can cause leaf scorch, making a shaded area ideal for this plant.",
        "It thrives in dappled sunlight or locations with light, filtered shade.",
        "Providing morning sun and avoiding direct, harsh afternoon light is recommended."
    ],
    "watering": [
        "Consistent moisture is essential; soil should be kept moderately moist but not waterlogged.",
        "Watering should be frequent during dry spells, ensuring soil does not dry out completely.",
        "Bleeding Heart appreciates a layer of mulch to retain soil moisture and regulate temperature.",
        "In the growing season, regular watering is crucial, decreasing slightly during dormancy."
    ],
    "soil": [
        "Bleeding Heart plants prefer rich, well-draining soil with high organic content for best results.",
        "The soil should be kept consistently moist yet never saturated to avoid root rot issues.",
        "Incorporating organic matter such as compost can enhance soil nutrition and drainage.",
        "The ideal soil pH for Bleeding Heart ranges from slightly acidic to neutral conditions."
    ],
    "toxic": [
        "Bleeding Heart contains alkaloids that can be toxic to humans and pets if ingested.",
        "Symptoms of toxicity may include vomiting, diarrhea, and seizures if consumed.",
        "Caution is recommended when planting in areas accessible to children or pets.",
        "Always wear gloves when handling to prevent skin irritation or allergic reactions."
    ],
    "extra_care_tip": [
        "Cut back foliage as it turns yellow in midsummer to keep the plant healthy.",
        "Provide a layer of mulch in the fall to protect roots during winter dormancy.",
        "Keep an eye out for slugs and snails which may damage the foliage.",
        "Divide every few years to encourage vigorous growth and more blooms."
    ]
}