{
    "name": "Bloomstruck Hydrangea",
    "climate": [
        "Thrives in USDA hardiness zones 4 through 9, preferring temperate climates.",
        "Sensitive to extreme cold or heat, best grown in moderate weather conditions.",
        "Can tolerate temperatures down to -30°F, ideal for colder regions in partial protection.",
        "Prefers regions with consistent rainfall and high humidity for optimal growth."
    ],
    "sunlight": [
        "Needs several hours of morning sun followed by afternoon shade to thrive.",
        "Avoids prolonged exposure to direct afternoon sunlight as it may cause leaf scorch.",
        "Grows well in partial to full shade conditions, adjusting light as needed.",
        "In very hot regions, ensure the plant receives sufficient shade to prevent wilting."
    ],
    "watering": [
        "Requires regular watering; soil should not completely dry out between sessions.",
        "Prefers moist soil conditions; never overwater to avoid root rot.",
        "Water twice a week during dry spells for consistent moisture.",
        "Mulch around the plant base to retain soil moisture and reduce watering frequency."
    ],
    "soil": [
        "Prefers well-draining soil that's rich in organic material to sustain growth.",
        "Acidic soil is ideal, as it enhances the intensity of the flower blooms.",
        "Slightly acidic to neutral pH levels help maintain the plant's vibrant color.",
        "Amend the soil with compost or peat moss to enhance organic content and drainage."
    ],
    "toxic": [
        "The plant is considered toxic to both humans and pets if ingested.",
        "Contains cyanogenic glycosides which can cause symptoms like vomiting.",
        "Handling may cause skin irritation or allergic reactions in sensitive individuals."
    ],
    "extra_care_tip": [
        "Prune the plant in late winter or early spring for better blooms.",
        "Deadhead spent flowers to promote ongoing bloom cycles and maintain form.",
        "Amend soil with sulfur to adjust pH and influence bloom color changes.",
        "Apply a balanced fertilizer in early spring and summer for sustained growth."
    ]
}