{
    "name": "Blue Chip Butterfly Bush",
    "climate": [
        "Thrives in temperate zones with mild winters and warm summers, ideally USDA zones 5-9.",
        "Can tolerate some heat and humidity, making it suitable for subtropical regions.",
        "Not well-suited for extremely cold climates where temperatures drop below -20°F.",
        "Grows best in regions with distinct seasonal changes, providing natural growth cycles."
    ],
    "sunlight": [
        "Requires full sun exposure to promote optimal blooming and flowering.",
        "Needs at least six hours of direct sunlight daily for healthy growth.",
        "Partial shade may cause reduced flowering and overall plant vigor.",
        "Prefers open, sunny locations with minimal shading from adjacent structures."
    ],
    "watering": [
        "Established plants are relatively drought-tolerant, requiring less frequent watering.",
        "In early growth stages, regular watering is necessary to develop strong roots.",
        "Avoid waterlogging; ensure good drainage to prevent root rot and disease.",
        "In extremely dry conditions, supplemental watering may be necessary for vitality."
    ],
    "soil": [
        "Prefers well-draining soil; tolerates a range of soil types including sandy and loamy.",
        "Amending soil with organic material can improve fertility and moisture retention.",
        "Avoid heavy clay soils that retain water, as they can damage root systems.",
        "Soil pH should be neutral to slightly alkaline, ideally between 6.0 and 7.5."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Deadheading spent blooms encourages continuous flowering throughout the season.",
        "Prune hard in late winter or early spring to maintain shape and prevent legginess.",
        "Watch for pests like spider mites and aphids, which can be controlled with insecticidal soap.",
        "Consider planting in a location sheltered from strong winds to prevent breakage."
    ]
}