{
    "name": "Boneset",
    "climate": [
        "Boneset thrives in temperate climates with distinct seasons. It can also tolerate some degrees of harsh weather.",
        "This plant is often found in areas with moderate rainfall throughout the year, making it well-suited to moist conditions.",
        "Adaptable to a wide range of climates, it can also be found in transitional zones between temperate and subtropical regions.",
        "In the wild, boneset grows in regions with naturally occurring wetlands and marshy conditions."
    ],
    "sunlight": [
        "Boneset prefers full sun exposure for optimum growth, though it can tolerate partial shade.",
        "While it can grow in some shade, abundant sunlight encourages more robust flowering periods and foliage.",
        "When planted in gardens, locating boneset in an area with sunlight for most of the day helps its development.",
        "Shade-grown boneset may have fewer flowers and can become leggy, so sun exposure is preferable."
    ],
    "watering": [
        "Consistent moisture is essential, so watering should mimic natural marshy conditions without causing waterlogging.",
        "Boneset should be watered regularly, as it does not tolerate drought well, needing moist soil for best growth.",
        "In drier periods or container growing, more frequent watering may be necessary to maintain adequate moisture.",
        "In areas with natural rainfall, boneset might need less supplemental watering during wet seasons."
    ],
    "soil": [
        "The ideal soil for boneset should be rich in organic matter and capable of retaining moisture while remaining well-drained.",
        "It thrives in soils that are naturally moist, similar to those found in wetland or marshy environments.",
        "A loamy soil composition is often best, providing both nutrients and the necessary moisture retention capability.",
        "Native conditions often find it growing in partly decomposed plant material found in wetland soils."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To encourage denser growth, regularly deadhead spent flowers to promote new blooms and extend the flowering season."
    ]
}