{
    "name": "Bromeliad",
    "climate": [
        "Bromeliads thrive in tropical and subtropical climates, preferring warmth and humidity.",
        "They are well-suited for environments that have a consistent temperature range.",
        "These plants do best in climates where the temperature rarely drops low.",
        "Humidity is crucial, as bromeliads originate from rainforests with heavy moisture."
    ],
    "sunlight": [
        "Bromeliads need bright, indirect sunlight to flourish and sustain vibrant colors.",
        "Direct sunlight can scorch their leaves, so filtered light is optimal.",
        "They can tolerate low light but grow best with several hours of bright light.",
        "For indoor settings, place them near windows with sheer curtains or blinds."
    ],
    "watering": [
        "Bromeliads prefer to be watered through their central cup, keeping it filled halfway.",
        "It's important not to overwater them; allow the soil to dry out between waterings.",
        "Drain any stagnating water to avoid rot, as they dislike constantly wet roots.",
        "During hotter months, their watering requirements increase due to evaporation."
    ],
    "soil": [
        "A well-draining soil mix is essential; orchid or cactus mix often works well.",
        "In nature, many bromeliads grow on trees, needing a bark-based growing medium.",
        "Soil should retain some moisture but allow excess water to drain freely.",
        "They appreciate a mix that includes perlite to improve aeration and drainage."
    ],
    "toxic": [
        "Bromeliads are generally considered non-toxic to pets and humans.",
        "They are safe for households with cats and dogs, posing minimal risk.",
        "Ingesting any plant material could cause mild irritation or upset stomach."
    ],
    "extra_care_tip": [
        "Regularly remove dead leaves or flowers to maintain plant health and aesthetics.",
        "Bromeliads may produce 'pups' or offsets, which can be separated for propagation.",
        "Clean leaves gently with a damp cloth to improve photosynthesis and appearance.",
        "Avoid using fertilizers high in copper or boron, as these elements can harm them."
    ]
}