{
    "name": "Broom",
    "climate": [
        "The broom plant typically thrives in temperate climates with adequate rainfall.",
        "It can also adapt well to Mediterranean climates with dry, hot summers and mild, wet winters.",
        "Broom plants are tolerant of coastal conditions and can survive in areas with saline winds.",
        "These plants are resistant to frost and can survive in colder climates, provided it is not extremely harsh."
    ],
    "sunlight": [
        "Broom plants require full sunlight to flower profusely and maintain healthy growth.",
        "They can adapt to partial shade, but this may affect their flowering potential and vigor.",
        "For optimal growth, broom plants need at least six to eight hours of direct sunlight daily.",
        "Insufficient sunlight may lead to leggy, sparse growth and reduced blooming in broom plants."
    ],
    "watering": [
        "Broom plants require moderate watering, allowing the soil to dry slightly between waterings.",
        "These plants have low water requirements once established, preferring less frequent watering.",
        "Overwatering can lead to root rot, so well-draining soil and careful watering are crucial.",
        "In times of drought, broom plants can survive with minimal water, showcasing their resilience."
    ],
    "soil": [
        "Broom plants prefer well-draining, sandy soil with a slightly acidic to neutral pH level.",
        "They can tolerate poor, rocky soils and are often found in infertile or degraded areas.",
        "Heavy, clayey soils are unsuitable for broom plants as they retain excess moisture.",
        "For ideal growth, ensure the soil is loose and allows for good aeration and drainage."
    ],
    "toxic": [
        "Broom plants contain toxic alkaloids, which can be harmful if ingested by humans or animals."
    ],
    "extra_care_tip": [
        "Regular pruning after flowering helps maintain the shape and prevents the plant from becoming leggy."
    ]
}