{
    "name": "Brugmansia",
    "climate": [
        "Brugmansia thrive in warm climates, preferring temperatures above 60°F (15°C) year-round.",
        "These tropical plants do not tolerate frost and must be protected from freezing temperatures.",
        "High humidity levels are beneficial for Brugmansia's growth, simulating their native rainforest habitat.",
        "They are best suited for USDA hardiness zones 9 through 11, where the climate remains mild."
    ],
    "sunlight": [
        "Brugmansia plants require full sun to part shade for optimal flowering and growth.",
        "In hotter regions, they benefit from afternoon shade to prevent leaf scorching.",
        "They can tolerate direct sunlight but may require more frequent watering when in full sun.",
        "Adequate sunlight is crucial for Brugmansia to produce its characteristic large, trumpet-shaped flowers."
    ],
    "watering": [
        "Brugmansia require regular watering, keeping the soil consistently moist but not waterlogged.",
        "During hotter months, increase watering frequency to compensate for higher evaporation rates.",
        "Avoid letting the soil dry out completely as this can cause wilting and stress for the plant.",
        "In container growing, ensure good drainage to prevent root rot despite frequent watering."
    ],
    "soil": [
        "Well-drained soil is essential; Brugmansia prefer rich, organic matter-rich compositions.",
        "A mix of potting soil, humus, and perlite is ideal for container growth of Brugmansia.",
        "Soil should retain moisture yet have adequate drainage to prevent waterlogged conditions.",
        "Slightly acidic to neutral pH soils support healthy growth and abundant flowering in Brugmansia."
    ],
    "toxic": [
        "All parts of Brugmansia are highly toxic if ingested, containing tropane alkaloids.",
        "Ingestion can cause symptoms including hallucinations, paralysis, and potentially fatal poisoning.",
        "Caution is advised around children and pets, as severe toxicity can occur with accidental ingestion.",
        "Handling the plant can cause skin irritation, so wearing gloves is recommended during care."
    ],
    "extra_care_tip": [
        "Regular pruning of Brugmansia encourages bushier growth and more prolific flowering.",
        "Pest control is essential; aphids and spider mites commonly infest Brugmansia and need monitoring.",
        "Fertilize monthly during the growing season with a balanced, water-soluble fertilizer for best results.",
        "Overwintering indoors in cooler climates is necessary; provide supplemental lighting if needed."
    ]
}