{
    "name": "Butterfly Weed",
    "climate": [
        "Butterfly Weed thrives in areas with temperate climates, preferring warm and sunny conditions.",
        "It is adaptable to various climates but struggles in extremely cold or humid environments.",
        "The plant is drought-tolerant and can survive in areas with low rainfall and dry conditions.",
        "Butterfly Weed is unsuitable for tropical climates with excessive moisture or sticky air."
    ],
    "sunlight": [
        "Butterfly Weed demands full sunlight to flourish and produce vibrant, attractive flowers.",
        "It is best planted in areas where it can receive at least six hours of direct sunlight daily.",
        "Avoid planting in shady areas as insufficient sunlight can hinder its growth and blooming.",
        "While it can tolerate partial shade, full sunlight exposure results in healthier and robust plants."
    ],
    "watering": [
        "Butterfly Weed prefers infrequent watering once established, as it is drought-tolerant.",
        "Avoid overwatering as the plant prefers dry soil and excessive moisture can cause root rot.",
        "Water thoroughly during the initial growth phase and decrease frequency as it matures.",
        "It thrives when the soil is allowed to dry out between watering sessions to prevent saturation."
    ],
    "soil": [
        "Butterfly Weed grows best in well-drained sandy soil with good aeration and low moisture retention.",
        "It tolerates poor soil conditions but struggles in compacted or waterlogged soil types.",
        "The addition of sand or gravel can improve drainage and support healthy root systems.",
        "Butterfly Weed does not require rich soil and often thrives in nutrient-poor environments."
    ],
    "toxic": [
        "Butterfly Weed contains toxins harmful to livestock, particularly cattle and horses, if ingested."
    ],
    "extra_care_tip": [
        "Regularly deadhead faded flowers to encourage further blooming and plant vigor."
    ]
}