{
    "name": "Calathea Orbifolia",
    "climate": [
        "Calathea Orbifolia prefers a warm and humid environment, resembling tropical climates.",
        "Typically thrives best in temperatures ranging from 65°F to 75°F, avoiding cold drafts.",
        "High humidity is crucial; consider placing in a bathroom or using a humidifier.",
        "Avoid placing it in areas with strong temperature fluctuations or cold winds."
    ],
    "sunlight": [
        "Calathea Orbifolia thrives in bright, indirect sunlight, much like its natural habitat under a canopy.",
        "Direct sunlight can scorch the leaves, leading to discoloration or damage of the plant.",
        "Low to medium filtered light conditions are ideal for preventing leaf burn and promoting growth.",
        "Grow lights can be used if natural sunlight is insufficient, maintaining indirect exposure."
    ],
    "watering": [
        "Maintaining consistent soil moisture is essential, but avoid waterlogging to prevent root rot.",
        "Water thoroughly, allowing excess to drain, then wait until the top inch of soil is dry.",
        "Increase watering in warmer months and reduce during the cooler, dormant months.",
        "Using distilled or rainwater can help prevent leaf tip browning and mineral buildup."
    ],
    "soil": [
        "Calathea Orbifolia requires well-draining soil rich in organic matter for optimal growth.",
        "A mixture combining potting soil, peat, and perlite can provide necessary drainage and nutrients.",
        "The soil should retain moisture without becoming waterlogged to prevent root damage.",
        "Regularly check and renew the soil to maintain its nutritional balance and structure."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Clean the leaves monthly to remove dust that can hinder photosynthesis and attract pests.",
        "Rotate the plant occasionally to ensure all sides receive equal light and grow evenly.",
        "If leaf edges brown, increase humidity or use distilled water to mitigate stress.",
        "Consider periodic repotting to a larger pot to accommodate growth and refresh soil nutrients."
    ]
}