{
    "name": "Calathea Warscewiczii",
    "climate": [
        "Calathea Warscewiczii thrives in a tropical climate, preferring consistently warm temperatures and high humidity.",
        "This plant enjoys a climate where temperatures range from 65°F to 80°F, avoiding sudden temperature drops.",
        "Calathea Warscewiczii should be kept away from cold drafts as it favors a stable, warm environment.",
        "Avoid extremely dry conditions, as Calathea Warscewiczii needs a humid atmosphere to mimic its native habitat."
    ],
    "sunlight": [
        "Calathea Warscewiczii prefers indirect, bright light to replicate its natural rainforest floor environment.",
        "Avoid placing it in direct sunlight, as this can scorch its leaves and cause the plant to lose its vibrant colors.",
        "Dappled sunlight or filtered light through curtains would be ideal for maintaining the plant's health and appearance.",
        "If necessary, placement under fluorescent lights can support growth, especially during darker months."
    ],
    "watering": [
        "Calathea Warscewiczii needs regular watering to keep the soil consistently moist but not waterlogged.",
        "Use filtered or distilled water if possible, as these plants are sensitive to fluoride and chlorine found in tap water.",
        "Ensure that the top inch of the soil is dry before watering again to prevent overwatering and root rot.",
        "Increased humidity levels can be maintained in dry conditions by misting the plant or placing it near a tray of water."
    ],
    "soil": [
        "The soil for Calathea Warscewiczii should be well-draining yet retain some moisture to mimic its natural environment.",
        "A peat-based potting mix with perlite or orchid bark can improve drainage and provide necessary aeration.",
        "Avoid heavy garden soils, as they can become too compact, hindering water flow and causing root issues.",
        "Soil pH should be slightly acidic to neutral, ranging from 6.0 to 7.0, to accommodate nutrient uptake."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To maximize humidity, group Calathea Warscewiczii with other moisture-loving plants or use a humidifier.",
        "Regularly clean the leaves with a damp cloth to ensure they can efficiently photosynthesize and stay vibrant."
    ]
}