{
    "name": "Calathea Fasciata",
    "climate": [
        "Calathea Fasciata thrives in a warm, humid climate, similar to tropical rainforest conditions.",
        "This plant prefers temperatures between 65°F and 80°F for optimal growth and health.",
        "Avoid exposing Calathea Fasciata to cold drafts or temperatures below 60°F, which can cause stress.",
        "It's important to maintain high humidity levels, ideally above 50%, to keep the plant flourishing."
    ],
    "sunlight": [
        "Calathea Fasciata prefers bright, indirect sunlight to maintain its vibrant foliage.",
        "Direct sunlight can scorch the leaves, so it's best to place the plant away from direct sun exposure.",
        "Low light conditions can lead to slower growth, so aim for a well-lit spot without harsh rays.",
        "An east or north-facing window is ideal to provide the right amount of filtered light throughout the day."
    ],
    "watering": [
        "Keep the soil consistently moist but not waterlogged, allowing the top layer to dry out between waterings.",
        "Water the plant with filtered water at room temperature to prevent mineral buildup and leaf browning.",
        "Consider increasing watering frequency during the growing season, typically spring and summer months.",
        "Reduce watering during fall and winter when the plant's growth slows, taking care to avoid drought stress."
    ],
    "soil": [
        "Use a well-draining potting mix rich in organic matter to promote healthy root growth.",
        "A mix containing peat, perlite, and orchid bark can provide the ideal balance of moisture retention and drainage.",
        "The soil should allow for adequate airflow to the roots to prevent root rot, a common issue in poorly draining soil.",
        "Regular repotting every 1-2 years is recommended to refresh the soil and provide room for growth."
    ],
    "toxic": [
        "Calathea Fasciata is generally considered non-toxic to pets such as cats and dogs."
    ],
    "extra_care_tip": [
        "To mimic the humidity of its native environment, regularly mist the leaves or use a humidifier nearby.",
        "Rotate the plant every few weeks to ensure even growth and prevent it from leaning toward the light source."
    ]
}