{
    "name": "Calathea White Fusion",
    "climate": [
        "Calathea White Fusion thrives in warm and humid environments typical of tropical climates.",
        "This plant prefers stable temperature conditions, without extreme fluctuations in heat or cold.",
        "It is sensitive to cold drafts and prefers temperatures between 65°F and 85°F.",
        "High humidity levels are essential, mimicking the rainforest climate where it originates."
    ],
    "sunlight": [
        "Calathea White Fusion grows best in bright, indirect sunlight to maintain its vibrant foliage.",
        "Direct sunlight can cause leaf burn, so shielding it from harsh rays is necessary.",
        "It can tolerate lower light conditions but may lose some of its variegation.",
        "A north or east-facing window with filtered light is ideal for this plant."
    ],
    "watering": [
        "Watering should be done with care; keep the soil consistently moist but not waterlogged.",
        "Allow the top layer of soil to dry out slightly between waterings to prevent root rot.",
        "Use lukewarm, distilled water or let tap water sit to remove chlorine before watering.",
        "During the growing season, regular watering is essential, while in winter, reduce frequency."
    ],
    "soil": [
        "The ideal soil for Calathea White Fusion is a well-draining potting mix with peat and perlite.",
        "A mixture that retains moisture but allows excess water to drain is perfect for this plant.",
        "Avoid heavy, compacted soils that can retain too much water and lead to root problems.",
        "Soil pH should be slightly acidic to neutral, supporting healthy growth and vibrant leaves."
    ],
    "toxic": [
        "Calathea White Fusion is non-toxic to pets such as cats and dogs.",
        "Being pet-friendly makes it a popular choice for households with animals."
    ],
    "extra_care_tip": [
        "Maintain high humidity around the plant using a humidifier or pebble tray.",
        "Wipe leaves regularly to remove dust and keep stomata clear for photosynthesis.",
        "Rotate the plant occasionally to ensure even growth and exposure to sunlight.",
        "Repot in spring if roots become cramped; this encourages healthy growth."
    ]
}