{
    "name": "Calathea Zebrina",
    "climate": [
        "Calathea Zebrina thrives in a warm, humid climate, similar to the tropical forests of Brazil.",
        "It prefers temperatures between 65 to 80°F (18 to 27°C) and does not tolerate cold drafts.",
        "Maintaining high humidity is crucial; use a humidifier or pebble tray in dry climates.",
        "Avoid exposing the plant to temperature fluctuations and cold conditions to prevent stress."
    ],
    "sunlight": [
        "Calathea Zebrina prefers bright, indirect sunlight and should not be exposed to direct sunlight.",
        "Direct sunlight can scorch the leaves, leading to browning and a loss of vibrant patterns.",
        "An east or north-facing window is ideal to provide adequate light without direct exposure.",
        "If natural light is insufficient, consider using a grow light to meet its lighting needs."
    ],
    "watering": [
        "Water Calathea Zebrina regularly to maintain consistently moist soil, but avoid waterlogging.",
        "Use lukewarm, distilled, or rainwater to prevent leaf damage from chemicals in tap water.",
        "During the growing season, water more frequently, but reduce watering in the winter.",
        "Ensure the pot has good drainage to prevent root rot, as the plant dislikes sitting in water."
    ],
    "soil": [
        "Plant Calathea Zebrina in a well-draining potting mix, rich in organic matter to hold moisture.",
        "A mix of peat, perlite, and coconut coir is ideal to provide aeration and retain moisture.",
        "Ensure the soil remains loose and airy, avoiding compaction that can suffocate the roots.",
        "Amending the soil with orchid bark or charcoal can enhance drainage and soil health."
    ],
    "toxic": [
        "Calathea Zebrina is non-toxic to pets and humans, making it a safe indoor plant choice.",
        "There are no harmful chemicals in the foliage, but it's not intended for ingestion.",
        "Safe for homes with cats, dogs, or curious children who might interact with plants.",
        "Despite being non-toxic, consuming large quantities might cause mild digestive upset."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to remove dust and enhance photosynthesis.",
        "Rotate the plant periodically to ensure even growth and exposure to light on all sides.",
        "Occasionally mist the leaves to increase humidity and mimic their natural environment.",
        "Prune dead or yellowing leaves to encourage healthy new growth and maintain appearance."
    ]
}