{
    "name": "Calathea Musaica",
    "climate": [
        "Calathea Musaica thrives in tropical and subtropical climates, preferring high humidity levels for optimal growth.",
        "This plant does best in mild climates where temperatures range from 65°F to 85°F.",
        "Avoid exposing the plant to temperatures below 60°F as it can cause stress and stunt growth.",
        "Ensure that the plant is not exposed to drafts or sudden temperature changes in its environment."
    ],
    "sunlight": [
        "Calathea Musaica prefers indirect light and should be shielded from direct sunlight.",
        "Bright, filtered light through a north or east-facing window will maintain healthy foliage.",
        "Direct sunlight can scorch the leaves, causing them to turn brown or get sunburned.",
        "In lower light conditions, growth may slow, but avoid placing the plant in complete darkness."
    ],
    "watering": [
        "Water the Calathea Musaica consistently, keeping the soil slightly moist but not soggy.",
        "It is crucial to allow the top inch of the soil to dry between waterings to prevent root rot.",
        "Use distilled or rainwater as the plant may be sensitive to fluoride or chlorine in tap water.",
        "Reduce watering during the winter months when the plant's growth rate naturally slows down."
    ],
    "soil": [
        "A well-draining soil mix that retains some moisture is ideal for Calathea Musaica.",
        "Use a potting mix that includes peat or coir to provide the necessary humidity and nutrition.",
        "Incorporate pine bark or perlite to improve aeration and drainage, essential for root health.",
        "Avoid soil mixes that are largely clay-based as they may retain too much water and promote root rot."
    ],
    "toxic": [
        "Calathea Musaica is generally non-toxic to cats and dogs, making it a pet-friendly plant.",
        "However, it may cause minor digestive upset if large quantities are ingested by pets.",
        "Always verify the plant is indeed a Calathea to ensure animal safety."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to prevent dust buildup and enhance photosynthesis.",
        "Mist the plant regularly to increase humidity, especially in drier indoor environments.",
        "Rotate the pot weekly to ensure even light exposure and balanced growth.",
        "Repot every 1-2 years to refresh the soil and provide adequate space for root expansion."
    ]
}