{
    "name": "Camphor",
    "climate": [
        "Camphor trees thrive in warm, subtropical climates with high humidity.",
        "They prefer regions with mild winters and hot, humid summers.",
        "This plant is commonly found in climates where frost is rare.",
        "Generally found in regions such as southern Japan and southeastern China."
    ],
    "sunlight": [
        "Camphor trees require full sunlight to reach their full growth potential.",
        "They can tolerate partial shade but grow best with ample sunlight exposure.",
        "Placing them in a location with at least six hours of direct sunlight is ideal.",
        "Insufficient sunlight may lead to stunted growth and poorer health."
    ],
    "watering": [
        "These trees need regular watering, especially during dry spells.",
        "Allow the topsoil to dry out between waterings to prevent overwatering.",
        "Young camphor trees require more frequent watering for establishment.",
        "Once established, they can tolerate short periods of drought."
    ],
    "soil": [
        "Camphor trees prefer well-drained, sandy or loamy soil for optimal growth.",
        "They can adapt to a range of soils but thrive in fertile soil conditions.",
        "Avoid planting camphor in poorly drained or waterlogged soils.",
        "Soil pH ranging from slightly acidic to neutral is beneficial."
    ],
    "toxic": [
        "Camphor is toxic to humans and pets if ingested in large amounts.",
        "Ingesting camphor can cause symptoms like nausea, vomiting, and seizures.",
        "Keep camphor products and plant parts away from children and animals.",
        "Handling the tree generally poses no risk, but ingestion is hazardous."
    ],
    "extra_care_tip": [
        "Prune young trees to promote a strong structure and remove lower limbs.",
        "Regularly check for pests such as camphor scale and address as needed.",
        "Camphor trees have invasive roots; avoid planting near foundations.",
        "Maintain a mulch layer to preserve soil moisture around the tree."
    ]
}