{
    "name": "Canada Lily",
    "climate": [
        "Canada Lily thrives best in temperate climates with cool summers.",
        "This plant can withstand cold winters but thrives in mild, moist conditions.",
        "It is typically found in regions with moderate humidity and temperate weather.",
        "Despite its resilience, extreme temperatures can affect its growth."
    ],
    "sunlight": [
        "Canada Lily prefers partial sunlight, ideally dappled sun under tree canopies.",
        "Too much direct sunlight can cause the leaves to become scorched or dried.",
        "It can tolerate some shade but requires enough light for blooming well.",
        "Morning sunlight is optimal, as harsh afternoon light can be detrimental."
    ],
    "watering": [
        "Watering should mimic natural rain patterns; keep soil moist but not waterlogged.",
        "In dry areas or drought conditions, water consistently to maintain even moisture.",
        "During the growing season, regular watering is important for flower development.",
        "Reduce watering in winter when the plant is dormant and requires less moisture."
    ],
    "soil": [
        "Canada Lily prefers well-drained soil rich in organic matter like compost.",
        "Slightly acidic to neutral pH levels are ideal for this lily species.",
        "Adding leaf litter or mulch can help retain moisture and improve soil quality.",
        "Avoid heavy clay soils that retain too much water and could cause root rot."
    ],
    "toxic": [
        "Canada Lily can be toxic to cats and may cause gastrointestinal distress.",
        "Signs of toxicity in pets include vomiting, lethargy, and salivation.",
        "Keep pets away from the plant to avoid ingestion of the bulbs or leaves."
    ],
    "extra_care_tip": [
        "Mulching in spring can help retain soil moisture and suppress weeds.",
        "Deadhead spent flowers to encourage further blooming and maintain vigor.",
        "Consider staking tall plants to prevent wind damage or bending from rain.",
        "Refresh and aerate the soil annually to promote healthy root systems."
    ]
}