{
    "name": "Canna Lily",
    "climate": [
        "Canna lilies thrive in tropical and subtropical climates where temperatures remain warm.",
        "They can also grow in temperate regions if sheltered during colder months and provided necessary warmth.",
        "This plant prefers humid environments, benefiting from consistently moist air conditions.",
        "In colder climates, they may require bringing indoors or protective mulching during winter."
    ],
    "sunlight": [
        "Canna lilies require full sun to thrive, ensuring vigorous growth and blooming.",
        "They are adaptable but prefer at least 6 hours of direct sunlight per day for optimal results.",
        "Too little sunlight may result in weak growth and lack of blooms, impacting their beauty.",
        "If grown indoors, place them near a south-facing window to maximize light exposure."
    ],
    "watering": [
        "These plants need consistent watering to maintain their lush foliage and vibrant blooms.",
        "During the growing season, keep the soil consistently moist without letting it dry out.",
        "Avoid overwatering, as soggy soil can lead to root rot and harm the plant's health.",
        "In winter, reduce watering frequency to prevent waterlogged conditions and rot issues."
    ],
    "soil": [
        "Canna lilies prefer well-draining, rich soil that retains moisture but doesn't stay soggy.",
        "Amend the soil with organic matter like compost to improve nutrients and drainage.",
        "They can tolerate a range of soil types but thrive best in loamy, fertile conditions.",
        "Ensure good drainage to prevent standing water, particularly in heavy clay soils."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regularly deadhead spent flowers to encourage continuous blooming throughout the season.",
        "Consider applying a balanced fertilizer every four to six weeks during the growing months.",
        "Once frost hits, cut back the foliage and mulch heavily to protect roots in colder areas.",
        "Divide the rhizomes every few years to prevent overcrowding and rejuvenate the plant."
    ]
}