{
    "name": "Caper Bush",
    "climate": [
        "Caper bushes thrive in Mediterranean climates characterized by hot, arid weather and mild, wet winters.", 
        "These plants are well-suited to regions with significant sunlight and little rainfall during the summer months.", 
        "Tolerant of dry conditions, caper bushes are often found in areas with minimal humidity levels.", 
        "Their natural habitats include rocky and coastal regions where temperatures can vary substantially."
    ],
    "sunlight": [
        "Full sunlight exposure is necessary for optimal growth and flowering of the caper bush.", 
        "In areas with insufficient sunlight, the plant may experience stunted growth and reduced flowering.", 
        "Caper bushes benefit from direct, unfiltered sun for the majority of the daylight hours.", 
        "Too much shade can lead to poor flowering performance, so choose a location with abundant light."
    ],
    "watering": [
        "Caper bushes require minimal watering once established, thriving in dry conditions with good drainage.", 
        "Excessive watering can harm the plants by promoting root rot, especially in humid environments.", 
        "It's important to allow the soil to dry out between waterings to maintain a healthy root system.", 
        "During prolonged droughts, supplemental watering can help support flower and fruit production."
    ],
    "soil": [
        "Well-drained, sandy or rocky soils are ideal for caper bushes, mimicking their natural habitat.", 
        "Poor soil fertility is tolerated, but the addition of gravel or similar materials can improve drainage.", 
        "Avoid clay-heavy soils that retain moisture, as these can lead to root issues and plant decline.", 
        "A slightly alkaline to neutral pH level in the soil is preferable for caper bush cultivation."
    ],
    "toxic": ["The unripe parts of the caper plant, such as the capers themselves, can be toxic if consumed in large quantities due to their potent mustard oils."],
    "extra_care_tip": ["Pruning back the plant during cooler months encourages bushier growth and more production in the subsequent growing season."]
}