{
    "name": "Cardamom",
    "climate": [
        "Cardamom thrives in tropical climates with high humidity and temperatures ranging from 10 to 35 degrees Celsius.",
        "It requires an annual rainfall between 1500 and 4000 mm, distributed throughout the year for optimal growth.",
        "The plant grows best in regions that do not have extended periods of drought or excessive dry spells.",
        "High-altitude areas with elevations between 600 and 1500 meters are ideal for cardamom cultivation."
    ],
    "sunlight": [
        "Cardamom plants prefer partial to full shade as direct sunlight can cause leaf scorching and affect yield.",
        "They can tolerate filtered sunlight, making the understory of forests or shade-providing trees ideal locations for growth.",
        "Excessive sunlight exposure may lead to stunted growth, so diffused light ensures healthier development.",
        "Shade management is crucial when cultivating cardamom; too little light can negatively impact plant vigor."
    ],
    "watering": [
        "Consistent and adequate watering is necessary for cardamom, especially during dry spells or prolonged dry seasons.",
        "Avoid waterlogging and ensure good drainage to prevent root rot, which can severely damage the plant.",
        "Drip irrigation systems are often recommended to provide consistent moisture without over-saturating the soil.",
        "Regular monitoring of soil moisture levels is vital to ensure that plants receive enough water, particularly in arid zones."
    ],
    "soil": [
        "Cardamom prefers rich, organic soils; fertile, loamy soils with good drainage are ideal for cultivation.",
        "A slightly acidic to neutral pH level, approximately 4.5 to 6.5, supports optimal plant development.",
        "Soil should be well-aerated, ensuring that the roots can access necessary nutrients and avoid compaction.",
        "Amending the soil with organic matter such as compost can enhance fertility and soil structure, improving growth conditions."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regular mulching can help retain soil moisture and stabilize temperature, enhancing plant growth.",
        "Prune regularly to maintain plant health and encourage bushier growth, which can lead to higher yields."
    ]
}