{
    "name": "Cardinal Flower",
    "climate": [
        "Cardinal Flower thrives in temperate climates with mild summers.",
        "It grows well in regions with high humidity, often near water bodies.",
        "This plant can withstand cooler climates with some frost resistance.",
        "Areas with long growing seasons support its blooming period best."
    ],
    "sunlight": [
        "Cardinal Flower prefers full sun in cooler climates for optimal growth.",
        "In hotter areas, partial shade is encouraged to prevent wilting.",
        "Providing morning sun and afternoon shade can improve flower display.",
        "Avoid deep shade as it can lead to poor flower production and growth."
    ],
    "watering": [
        "Consistent watering is key; soil should remain moist but not waterlogged.",
        "This plant does well in damp, marshy conditions close to streams.",
        "During dry spells, increase watering to maintain moisture levels.",
        "Avoid letting the soil dry out completely to prevent plant stress."
    ],
    "soil": [
        "Prefers rich, loamy soil that can retain moisture yet drains well.",
        "A soil pH ranging from slightly acidic to neutral is optimal.",
        "Incorporating organic matter can improve soil structure for better growth.",
        "Avoid poor drainage soils; standing water can harm the root system."
    ],
    "toxic": [
        "Cardinal Flower contains toxic alkaloids that can cause illness if ingested.",
        "All parts of the plant are considered toxic to humans and animals.",
        "Symptoms of poisoning can include nausea, vomiting, and diarrhea.",
        "Caution should be taken to prevent accidental ingestion, especially by pets."
    ],
    "extra_care_tip": [
        "Deadhead wilted flowers to encourage prolonged blooming and vitality.",
        "Mulching around the base helps retain soil moisture and control weeds.",
        "In colder climates, apply a layer of mulch in winter to protect roots.",
        "Divide plants every 2-3 years to promote healthy growth and prevent overcrowding."
    ]
}