{
    "name": "Cardboard Palm",
    "climate": ["Cardboard Palm prefers a warm climate, thriving in conditions where temperatures are consistently above 60°F.", "This plant can tolerate brief periods of cooler weather, but sustained cold can cause damage to the leaves.", "Humidity levels should be moderate to high to mimic its natural tropical environment.", "It is commonly found in landscapes or homes that simulate warm, humid, and subtropical climates."],
    "sunlight": ["Cardboard Palm requires bright, indirect sunlight to grow well and maintain healthy foliage.", "Too much direct sunlight can scorch the leaves, so filter the light when growing indoors.", "In outdoor settings, partial shade is ideal to protect the plant from excessive sun exposure.", "This plant can adapt to lower light conditions but will exhibit slower growth in such environments."],
    "watering": ["Allow the top inch of soil to dry out between waterings, as Cardboard Palm does not like to sit in soggy soil.", "Reduce watering frequency during the winter months when the plant's growth slows down.", "Ensure proper drainage to avoid root rot, which can be caused by water-logged soil.", "Regular misting can help maintain humidity levels, especially in drier indoor conditions."],
    "soil": ["A well-draining potting mix is essential for Cardboard Palm, to prevent the roots from rotting.", "A mixture of peat, sand, and perlite is excellent to ensure proper aeration and drainage.", "The soil should be loose and crumbly to allow for good root development and water dispersion.", "Avoid heavy clay-based soils as they retain too much water and could suffocate the plant."],
    "toxic": ["Cardboard Palm is considered toxic to pets and humans if ingested, causing symptoms like vomiting or diarrhea.", "Keep this plant out of reach of curious pets and small children to prevent accidental ingestion."],
    "extra_care_tip": ["Prune any yellowing or dead leaves to encourage healthy new growth and maintain the plant's appearance.", "Repot the plant every couple of years to refresh soil nutrients and manage root growth."]
}