{
    "name": "Carrotwood Tree",
    "climate": [
        "Carrotwood trees thrive in tropical and subtropical climates where temperatures remain warm.",
        "This species is highly adaptable to a variety of climates, including coastal or inland areas.",
        "They are resistant to urban air pollution and can grow in city environments with minimal issues.",
        "In frost-free regions, carrotwood trees can grow year-round without growth interruptions."
    ],
    "sunlight": [
        "Full sun is preferred by carrotwood trees for optimal growth and health.",
        "Carrotwood trees can tolerate partial shade, but growth may be slower under reduced light.",
        "To ensure healthy and even growth, expose the tree to at least six hours of direct sunlight daily.",
        "In areas with intense afternoon sun, partial shade can help prevent leaf scorching or stress."
    ],
    "watering": [
        "Young carrotwood trees require regular watering until they are established.",
        "Once established, carrotwood trees are drought-tolerant and require minimal supplemental watering.",
        "They prefer well-drained soils, and overwatering should be avoided to prevent root rot.",
        "It is advisable to water deeply but infrequently to encourage deep root development."
    ],
    "soil": [
        "The carrotwood tree is highly adaptable and can grow in a variety of soil types.",
        "Well-drained, sandy, or loamy soils are ideal for carrotwood trees to prevent waterlogging.",
        "While tolerant of brief flooding, consistently waterlogged soils can damage the root system.",
        "The tree can tolerate slightly alkaline to acidic soils but thrives best in neutral pH soils."
    ],
    "toxic": [
        "Carrotwood trees produce fruit and seeds that are considered toxic if ingested by humans.",
        "Pets and livestock should be prevented from consuming carrotwood seeds due to their toxicity."
    ],
    "extra_care_tip": [
        "Regular pruning is recommended to maintain the tree's shape and remove any dead or damaged branches.",
        "Consider planting in areas where fallen seeds won't pose a threat to pets due to their toxicity."
    ]
}