{
    "name": "Carrion Flower",
    "climate": [
        "Carrion flowers thrive in warm climates similar to their native Southern Africa.",
        "They prefer arid or semi-arid environments where temperatures are moderate.",
        "These plants can tolerate dry climates but not extreme cold or frost conditions.",
        "A warm, dry indoor climate can also be suitable for their cultivation."
    ],
    "sunlight": [
        "These plants require bright, indirect sunlight for optimal growth.",
        "Direct, intense sunlight may cause damage to the plant tissues over time.",
        "They can tolerate some direct sun exposure but prefer partial shade.",
        "In their natural habitat, they often grow under the shade of larger plants."
    ],
    "watering": [
        "Watering should be moderate, allowing the soil to dry out between waterings.",
        "Overwatering can lead to root rot; ensure proper drainage is available.",
        "In the dormant winter months, reduce watering significantly to avoid issues.",
        "During the growing season, water more frequently but do not let it stay overly moist."
    ],
    "soil": [
        "They need well-draining soil, similar to a cactus or succulent mix.",
        "A mixture with sand or perlite aids in proper drainage and aeration.",
        "The soil should be light and airy, preventing waterlogging and promoting health.",
        "Rich organic matter shouldn't be necessary; focus on drainage over fertility."
    ],
    "toxic": [
        "Carrion flowers are not known to be toxic to pets or humans, but caution should be exercised given their unpleasant odor.",
        "The offensive smell they emit is meant to attract pollinators like flies, but is not harmful itself.",
        "Despite this, it is always a good idea to handle them carefully and avoid ingestion.",
        "Contact with the sap or flesh could cause skin irritation in sensitive individuals."
    ],
    "extra_care_tip": [
        "Ensure the plant is placed where the odor will not cause discomfort, as flowering emits a strong smell.",
        "Repot infrequently, only when necessary, to prevent unnecessary stress to the plant.",
        "Prune gently to shape and remove dead or damaged parts, minimizing shock.",
        "Prefers a stable environment; avoid sudden changes in temperature or humidity."
    ]
}