{
    "name": "Cathedral Bells",
    "climate": [
        "Cathedral Bells thrive in tropical climates with warm temperatures year-round.",
        "They prefer a climate that mimics their native tropical and subtropical habitats.",
        "Moderate humidity levels and consistent warm weather are ideal for growth.",
        "They do not tolerate frost and need to be grown in a frost-free environment."
    ],
    "sunlight": [
        "Full sunlight is essential for the healthy growth of Cathedral Bells.",
        "They can tolerate partial shade but require at least a few hours of direct sun daily.",
        "Insufficient sunlight may lead to poor flowering and growth issues.",
        "Positioning them in a location with ample sunlight results in vibrant blooms."
    ],
    "watering": [
        "Regular watering is crucial; ensure soil remains moist but not waterlogged.",
        "Consistency is key; allow the top inch of soil to dry before re-watering.",
        "Avoid overwatering as it can lead to root rot and other fungal problems.",
        "During active growth and blooming season, increase water frequency slightly."
    ],
    "soil": [
        "Well-draining soil is essential; a mix designed for tropical plants works best.",
        "A soil mixture with a balance of loam, sand, and peat moss is recommended.",
        "The soil should retain moisture while allowing excess water to drain away.",
        "Adding organic compost can enhance soil fertility and promote healthy growth."
    ],
    "toxic": [
        "All parts of the Cathedral Bells plant are toxic if ingested by humans or pets.",
        "Ingestion can cause symptoms like vomiting, diarrhea, and abdominal pain."
    ],
    "extra_care_tip": [
        "Pruning regularly helps manage size and encourages bushier growth.",
        "Support structures like trellises can help manage its climbing nature.",
        "Monitor for pests like aphids and mealybugs, which can affect health.",
        "Avoid exposure to strong winds as it can damage the delicate stems."
    ]
}