{
    "name": "Century Plant",
    "climate": [
        "Century Plants thrive in hot desert climates where temperatures are very high and humidity is low.",
        "These plants can also survive in Mediterranean climates, known for wet winters and hot, dry summers.",
        "They can tolerate subtropical climates with moist summers and relatively warm winters.",
        "Century Plants may struggle in tropical climates with excessive rainfall and high humidity year-round."
    ],
    "sunlight": [
        "Century Plants need full sun exposure to thrive, requiring direct sunlight for at least six hours daily.",
        "They can also survive in partially shaded areas but may grow slower with reduced sunlight exposure.",
        "In extremely hot climates, some afternoon shade can prevent the plant from sunburn damage.",
        "Growing in inadequate sunlight can lead to leggy growth and a lack of flowering in Century Plants."
    ],
    "watering": [
        "These plants need infrequent watering and should be allowed to dry out completely between waterings.",
        "Watering should be reduced significantly during winter months as Century Plants go dormant.",
        "Over-watering can easily lead to root rot, so proper drainage is essential to maintain plant health.",
        "In naturally arid environments, Century Plants may thrive solely on local rainfall without extra irrigation."
    ],
    "soil": [
        "Century Plants prefer well-draining soil mixtures to prevent water retention that causes root rot.",
        "They thrive in sandy soils, mimicking their natural desert habitats with minimal organic matter.",
        "Amending soil with gravel or pumice can enhance drainage and provide a more suitable environment.",
        "Avoid clay-heavy soils as they retain excessive moisture, negatively impacting plant root systems."
    ],
    "toxic": [
        "Century Plants contain saponins, making them mildly toxic to humans and pets if ingested.",
        "Contact with the sap may cause skin irritation or minor allergic reactions in sensitive individuals."
    ],
    "extra_care_tip": [
        "Protect against frost by covering plants or bringing potted specimens inside during cold spells.",
        "Remove dead or damaged leaves regularly to maintain plant health and appearance."
    ]
}