{
    "name": "Chandelier Plant",
    "climate": [
        "The Chandelier Plant thrives in warm, dry climates that mimic its native Madagascar habitat.",
        "It can tolerate high temperatures but should be protected from frost and cold conditions.",
        "Suitable for USDA hardiness zones 9-11, indicating it enjoys subtropical environments.",
        "This plant prefers low humidity environments, typical of arid and semi-arid climates."
    ],
    "sunlight": [
        "The plant requires full sunlight exposure to maintain its health and growth.",
        "It can tolerate partial shade but thrives best in bright, direct light conditions.",
        "Insufficient sunlight can lead to leggy growth and a lack of flowering.",
        "In extremely hot climates, some afternoon shade may be beneficial to prevent leaf scorch."
    ],
    "watering": [
        "Water the Chandelier Plant sparingly, allowing the soil to dry out between waterings.",
        "Overwatering can lead to root rot, so ensure there is adequate drainage.",
        "During the growing season, water regularly but reduce in fall and winter.",
        "Use rainwater or distilled water if possible to avoid mineral buildup in the soil."
    ],
    "soil": [
        "The plant prefers a well-draining soil mix, typically a cactus or succulent blend.",
        "Soil should be gritty with sand or perlite incorporated to enhance drainage.",
        "It does not tolerate heavy or water-retentive soils as it can damage roots.",
        "Make sure the soil has neutral to slightly acidic pH to best suit its growth."
    ],
    "toxic": [
        "The Chandelier Plant is considered toxic to pets and humans if ingested.",
        "Its sap can cause skin irritation in sensitive individuals upon contact."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain its shape and remove any dead or damaged growths.",
        "Be cautious of pests like aphids or mealybugs, which can affect the plant.",
        "Repot every couple of years to refresh the soil and check for any root problems.",
        "Use gloves when handling the plant to avoid irritation from its sap."
    ]
}