{
    "name": "Chinese Yew",
    "climate": [
        "Chinese Yews thrive in temperate climates with mild winters.",
        "They can tolerate a range of climates, from subtropical to temperate.",
        "Prefer climates with moderate humidity levels for optimal growth.",
        "Avoid areas with extreme cold or hot climates as they can be damaging."
    ],
    "sunlight": [
        "Chinese Yews prefer partial to full shade but can tolerate some sun.",
        "Direct, harsh sunlight can cause scorching of the foliage over time.",
        "Filter sunlight through larger trees to mimic natural understory growth.",
        "Bright, indirect light works well, especially in outdoor garden settings."
    ],
    "watering": [
        "Water deeply but infrequently to encourage rooted growth and strength.",
        "These plants can tolerate dry periods once well-established in ground.",
        "Avoid overwatering; ensure soil drainage to prevent root rot issues.",
        "Check moisture regularly and water during extended dry spells."
    ],
    "soil": [
        "Require well-drained soils; heavy clay should be avoided for best health.",
        "Soils that are slightly acidic to neutral pH levels are ideal for growth.",
        "Amend soil with organic matter to improve drainage and nutrient content.",
        "Avoid very sandy soils as they do not retain the necessary moisture well."
    ],
    "toxic": [
        "All parts of the Chinese Yew are toxic if ingested, especially to pets.",
        "The toxicity includes seeds, leaves, and bark, causing severe symptoms.",
        "Keep away from areas frequented by small children and grazing animals.",
        "Be aware that toxic compounds can have fatal effects if consumed."
    ],
    "extra_care_tip": [
        "Pruning regularly helps maintain desired shape and dense foliage.",
        "Mulching can help retain soil moisture and regulate temperature.",
        "Monitor for pests like aphids and scale; treat with horticultural oils.",
        "Protect against cold drying winds by planting in sheltered locations."
    ]
}