{
    "name": "Chinese Elm",
    "climate": [
        "Chinese Elm thrives in temperate climates where winters are mild and summers are warm.",
        "It can tolerate a range of temperatures but prefers to be protected from extreme cold or hot climates.",
        "This plant adapts well to various climates but needs protection during frost in colder regions.",
        "Chinese Elm is typically found in zones that do not experience harsh or prolonged winter conditions."
    ],
    "sunlight": [
        "Chinese Elm prefers full sun to partial shade, requiring at least 4-6 hours of direct sunlight daily.",
        "While it can acclimate to lower light conditions, it thrives best with ample bright light exposure.",
        "The plant can tolerate partial shade, but this may slow its growth and reduce vigor.",
        "Morning sun is often ideal to avoid the intense heat of midday, which may stress the plant."
    ],
    "watering": [
        "Chinese Elm requires consistent watering, allowing the topsoil to dry out slightly between waterings.",
        "Overwatering should be avoided as it may lead to root rot, a common issue with this plant.",
        "During the growing season, it is essential to maintain soil moisture evenly without letting it dry completely.",
        "Reduce watering in the winter months when the plant's growth slows and requires less moisture."
    ],
    "soil": [
        "Chinese Elm prefers well-draining soil, often a mix of loam, sand, and some organic matter.",
        "Moderately fertile soil that can retain moisture while allowing excess water to drain is ideal.",
        "A soil pH slightly acidic to neutral will help optimize the plant's root health and nutrient uptake.",
        "Enhancing soil with perlite or bark can improve drainage properties, aiding plant vigor and health."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regular pruning can help maintain desired shape and encourage bushier growth in Chinese Elm.",
        "Check for pests such as aphids and spider mites, which can occasionally affect the plant.",
        "Repotting every couple of years ensures healthy root development and adequate nutrient availability.",
        "Protection from cold drafts and sudden temperature drops is necessary during winter."
    ]
}