{
    "name": "Cilantro",
    "climate": ["Cilantro thrives in a mild climate with moderate temperatures, neither too hot nor too cold.", "A Mediterranean climate is ideal for cilantro, with cool, wet winters and dry, warm summers.", "Cilantro prefers temperatures between 50 to 85 degrees Fahrenheit, making it suitable for temperate climates.", "This plant does not tolerate extreme heat, as it tends to bolt quickly when temperatures rise above this range."],
    "sunlight": ["Cilantro requires full sun for optimal growth, which means at least six hours of direct sunlight per day.", "In hotter regions, cilantro benefits from partial shade in the afternoon to prevent bolting.", "An east-facing window is suitable for indoor cilantro, providing morning sun and afternoon shade.", "Cilantro can grow under artificial lights if necessary, but natural sunlight is most beneficial."],
    "watering": ["Cilantro requires consistent moisture for healthy growth, so keep the soil evenly damp.", "Water cilantro deeply but less frequently to encourage a robust root system while avoiding overwatering.", "Once the top inch of soil feels dry, it's time to water cilantro again, ensuring good drainage.", "In very hot weather, cilantro may require more frequent watering to prevent wilting."],
    "soil": ["Cilantro thrives in soil that is well-draining and rich in organic matter, such as compost.", "A loamy soil with a slightly acidic to neutral pH between 6.2 and 6.8 is ideal for cilantro.", "Avoid heavy clay soils for cilantro, as poor drainage can lead to root rot and plant stress.", "For container planting, use a high-quality potting mix that provides good aeration and moisture retention."],
    "toxic": ["Cilantro is generally non-toxic to dogs, cats, and humans, making it safe for consumption.", "Parts of the cilantro plant, such as its seeds (coriander), are used in seasoning and are non-toxic.", "Unlike some herbs, cilantro poses no known toxicity risks to household pets.", "In rare cases, individuals may have an allergic reaction to cilantro."],
    "extra_care_tip": ["To prolong the life of cilantro, regularly harvest its leaves by cutting them at the base.", "Sow cilantro seeds successively every two to three weeks to ensure a continuous harvest.", "Trim off flower heads as they appear to prevent cilantro from going to seed too quickly.", "Cilantro can be grown indoors during winter to extend its growing season and availability."]
}