{
    "name": "Citronella Plant",
    "climate": [
        "The Citronella plant thrives in warm, tropical climates. It does best in temperatures above 60°F.",
        "It requires a frost-free environment, making it suitable for USDA zones 9-11.",
        "In cooler regions, it should be grown as an annual or kept indoors during winter.",
        "Humidity levels should be moderate to high, mimicking its native tropical habitat."
    ],
    "sunlight": [
        "Full sun is ideal for the Citronella plant, promoting robust growth.",
        "A minimum of six hours of direct sunlight per day is recommended for optimal health.",
        "If grown indoors, place it near a south-facing window for adequate sunlight exposure.",
        "Partial shade can be tolerated, but may result in less vigorous growth and lower oil production."
    ],
    "watering": [
        "The Citronella plant prefers consistently moist soil, but avoid waterlogging.",
        "Watering frequency should be increased during hot, dry periods to prevent wilting.",
        "Allow the top inch of soil to dry out slightly between waterings in cooler climates.",
        "Indoor plants may require less frequent watering, but avoid letting them dry out completely."
    ],
    "soil": [
        "Well-drained, loamy soil is ideal for the Citronella plant, providing aeration and moisture retention.",
        "Soil pH should be slightly acidic to neutral, typically between 6.0 and 7.0 for optimal growth.",
        "Adding organic matter such as compost can improve soil structure and nutrient availability.",
        "Ensure the pot has drainage holes to prevent water from accumulating at the plant's roots."
    ],
    "toxic": [
        "Generally non-toxic to humans, but can cause mild skin irritation on contact.",
        "Not considered toxic to pets, but ingestion may cause mild gastrointestinal upset."
    ],
    "extra_care_tip": [
        "Pruning the Citronella plant regularly encourages a bushy, healthy appearance.",
        "Pinching off the tips of the stems can promote denser growth and enhance oil production.",
        "Consider using a balanced, water-soluble fertilizer during the active growing season.",
        "Watch for common pests like aphids and spider mites, and treat infestations promptly."
    ]
}