{
    "name": "Clematis",
    "climate": [
        "Clematis thrive in temperate climates with well-defined seasons and cooler summers.",
        "Avoid extreme temperatures as they can potentially harm the plant significantly.",
        "A mild climate, with moderate humidity levels, suits clematis very well and supports growth.",
        "Cold climates may necessitate protective measures for clematis in winter for survival."
    ],
    "sunlight": [
        "Clematis plants require full sun for at least six hours daily for optimal flowering.",
        "Partial shade during the hottest part of the day can help prevent stress in clematis.",
        "Direct sunlight in the morning and filtered shade in the afternoon are beneficial.",
        "For clematis, ensure the roots stay shaded while providing ample light to its foliage."
    ],
    "watering": [
        "Regular watering is essential for clematis, especially during dry weather spells.",
        "Avoid overwatering by allowing the topsoil to dry between water applications carefully.",
        "Deep watering once a week is generally sufficient, though adjust as necessary for climate.",
        "Consistent moisture is key to sustaining clematis but do not let it sit in waterlogged soil."
    ],
    "soil": [
        "Clematis prefer rich, well-draining soil that's high in organic matter for nourishment.",
        "pH level should be neutral to slightly alkaline; avoid extremely acidic soils.",
        "Soil should retain moisture yet not become waterlogged, to prevent root rot in clematis.",
        "Adding compost to the soil can improve fertility and encourage vigorous clematis growth."
    ],
    "toxic": [
        "Clematis contain compounds that can be toxic if ingested, causing stomach upset.",
        "The sap can cause skin irritation; handle with care and wear gloves if necessary."
    ],
    "extra_care_tip": [
        "Prune clematis regularly to encourage flowering and maintain the desired shape and size.",
        "Mulching the base of the plant helps to retain moisture and keep roots cool."
    ]
}