{
    "name": "Clivia",
    "climate": [
        "Clivia plants thrive best in mild climates where temperatures do not drop too low.",
        "These plants prefer climates that have a balance of humidity and dryness for optimal growth.",
        "Clivias are well suited to temperate climates where they can avoid extreme weather conditions.",
        "A stable climate without sudden temperature fluctuations is ideal for Clivia."
    ],
    "sunlight": [
        "Clivia necessita de iluminação brilhante e indireta para prosperar em ambientes internos.",
        "Embora tenha adequado tolerância à baixa luminosidade, climas mais claros são preferíveis.",
        "Evite a luz solar direta intensa, que pode queimar as folhas da Clivia rapidamente.",
        "A exposição à luz moderada, semelhante ao filtro de sombra, é o melhor para Clivia."
    ],
    "watering": [
        "Clivia should be watered sparingly to prevent root rot and allow the soil to dry out between waterings.",
        "During the active growing season, maintain consistent watering but avoid overwatering the Clivia.",
        "In the dormant period, such as winter, watering should be considerably reduced for Clivia.",
        "Ensure the top inches of the soil are dry before adding more water to the Clivia."
    ],
    "soil": [
        "Clivia prefers well-draining, rich potting soil that retains essential nutrients effectively.",
        "A soil mix containing equal parts of peat moss, perlite, and compost works best for Clivia.",
        "Slightly acidic to neutral soil pH is ideal to encourage healthy Clivia growth.",
        "Ensure the soil mix does not compact easily, as Clivia roots require good aeration."
    ],
    "toxic": [
        "Clivia plants are toxic to pets and humans if ingested.",
        "The plant contains lycorine, which can cause vomiting and diarrhea if consumed."
    ],
    "extra_care_tip": [
        "Clivia benefits from a rest period during winter in a cool location to promote blooming."
    ]
}