{
    "name": "Cobra Lily",
    "climate": ["Cobra Lily thrives in a cool and humid climate, often found in the wild in areas with abundant moisture.", "Often found in coastal areas of Northern California and Southern Oregon, Cobra Lily enjoys temperate climates without extreme temperatures.", "It mimics its natural habitat by maintaining average temperatures ranging between 50°F to 70°F.", "These plants prefer environments that do not have harsh, direct sun and keep cooler under the canopy of other vegetation."],
    "sunlight": ["They prefer filtered sunlight, such as the light received under a forest canopy.", "Direct sunlight can be harmful; they thrive best in dappled or partial shade.", "Cobra Lily needs protection from intense midday sun to prevent leaf scorching.", "Indirect sunlight achieved through light curtains or shaded areas is ideal for these plants indoors."],
    "watering": ["Cobra Lily requires consistently moist conditions, mimicking the boggy environment of its natural habitat.", "Utilize distilled or rainwater as they are sensitive to minerals present in tap water.", "Overwatering can be a concern but keeping the soil slightly submerged helps simulate natural bog conditions.", "High humidity is beneficial; consider using a humidifier or regular misting to maintain moisture levels."],
    "soil": ["Preferring nutrient-poor, acidic soil, use a mix of sphagnum moss and sand for aeration.", "Avoid potting soil as it is too rich and retains too much moisture, which could lead to root rot.", "Replicate their natural bog conditions by using a substrate that allows for constant access to moisture.", "Soil must drain well while keeping moist conditions, simulating sandy, peat-based soil seen in their native environment."],
    "toxic": ["Cobra Lily is not considered toxic to humans or animals, making it a safe choice for indoor gardening where pets or children may be present."],
    "extra_care_tip": ["Keep Cobra Lily in a container with a water reservoir to maintain high moisture levels without over-soaking the roots."]
}