{
    "name": "Coleus",
    "climate": [
        "Coleus thrives in warm climates and cannot tolerate frost or cold temperatures.",
        "It prefers a tropical climate that provides consistent warmth and humidity.",
        "The plant can be grown indoors in temperate zones, given adequate warmth.",
        "While tolerant of some shade, Coleus does best in warm, well-lit environments."
    ],
    "sunlight": [
        "Coleus plants require bright, indirect sunlight for optimal growth.",
        "Too much direct sunlight can cause the leaves to scorch and become damaged.",
        "In shadier areas, the plant may display less vibrant leaf coloration.",
        "Consider rotating the plant regularly to ensure even sunlight exposure."
    ],
    "watering": [
        "Water Coleus regularly to keep the soil consistently moist but not soggy.",
        "In hotter climates or during summer, increase watering frequency accordingly.",
        "Ensure pots have drainage holes to prevent water logging and root rot.",
        "Reduce watering during winter as the plant's growth slows significantly."
    ],
    "soil": [
        "A well-draining soil mix is essential to prevent waterlogging and root rot.",
        "Coleus thrives in rich, organic soil that retains moisture yet drains well.",
        "Consider amending the soil with compost to boost nutrients for better growth.",
        "Avoid heavy clay soils that hold too much water and compact easily."
    ],
    "toxic": [
        "Coleus is mildly toxic if ingested by pets like cats and dogs, causing gastrointestinal upset.",
        "Keep the plant out of reach of small children and pets to avoid accidental ingestion."
    ],
    "extra_care_tip": [
        "Pinch back the tips of stems to encourage bushier growth and vibrant foliage.",
        "Be attentive to pest issues like aphids and spider mites and address them promptly.",
        "Rotate the plant periodically to maintain balanced growth and prevent leaning.",
        "Fertilize monthly during the growing season to promote vibrant leaf colors."
    ]
}