{
    "name": "Common Rue",
    "climate": [
        "Common Rue thrives in a Mediterranean climate, which offers warm temperatures.",
        "This plant is quite hardy and can also grow in temperate climates with ease.",
        "It prefers environments that have dry, hot summers along with mild, wet winters.",
        "The plant can survive in areas that do not experience severe frost or harsh cold."
    ],
    "sunlight": [
        "Common Rue requires full sunlight for the best growth and health.",
        "Although it prefers full sun, it can tolerate partial shade if needed.",
        "Exposure to direct sunlight is crucial for the rue to produce its best foliage.",
        "Growing in full sun allows the plant to achieve its optimal growth potential."
    ],
    "watering": [
        "Watering should be moderate; rue does not need excessive moisture.",
        "It is important to let the soil dry out between waterings to prevent rot.",
        "Drought-resistant, this plant can withstand periods of low water supply.",
        "Overwatering should be avoided as Rue prefers somewhat drier conditions."
    ],
    "soil": [
        "Common Rue thrives best in well-draining soil to prevent waterlogged roots.",
        "Preferring sandy or rocky soils, it can grow in poorer quality soils too.",
        "Soils should ideally be slightly alkaline or neutral for best growth.",
        "Heavy, clay-based soils are not recommended unless they are well-drained."
    ],
    "toxic": [
        "Common Rue is toxic to humans and pets if ingested.",
        "Handling the plant can cause skin irritation or rashes in some people.",
        "All parts of the plant contain compounds that can be harmful if eaten.",
        "It's important to exercise caution and use gloves when handling the plant."
    ],
    "extra_care_tip": [
        "Pruning is essential to prevent the plant from becoming woody and ungainly.",
        "Plant rue away from paths as it might cause skin irritation on contact.",
        "Regular pruning will encourage bushy growth and more vibrant foliage.",
        "Rue can repel certain insects, making it useful in companion planting."
    ]
}