{
    "name": "Common Hazelnut Tree",
    "climate": [
        "Common Hazelnut Trees thrive in temperate climates with distinct seasonal changes, including cold winters and warm summers.",
        "These trees can tolerate a wide range of climates but prefer regions with moderate humidity and rainfall throughout the year.",
        "Hazelnut trees are adaptable to various climates but are best suited to areas with cool winters that provide a chilling period necessary for flowering.",
        "In areas with mild and wet winters, Common Hazelnut Trees can still perform well provided they receive sufficient sunlight and are protected from strong winds."
    ],
    "sunlight": [
        "Common Hazelnut Trees require full sun to partial shade, with at least six hours of direct sunlight each day for optimal growth.",
        "Adequate sunlight is crucial for the production of flowers and nuts, making sunny locations preferable for planting hazelnut trees.",
        "While they can grow in partial shade, the yield and overall health of the tree improve with greater sunlight exposure.",
        "It is advisable to avoid shading the hazelnut tree with taller structures or dense foliage from other plants."
    ],
    "watering": [
        "Regular watering is necessary for young Common Hazelnut Trees, especially in dry periods, to ensure proper root establishment.",
        "Mature hazelnut trees are somewhat drought-tolerant but benefit from consistent moisture during the growing season.",
        "To conserve moisture and promote healthy tree growth, consider applying a mulch layer around the base of the tree.",
        "Avoid over-watering, as this can lead to root rot; well-drained soil helps provide optimal water balance."
    ],
    "soil": [
        "Common Hazelnut Trees flourish in well-drained, loamy soils with high organic matter which promotes healthy root growth.",
        "Although they can tolerate a range of soil types, hazelnut trees prefer slightly acidic to neutral pH levels.",
        "Good drainage is essential to prevent waterlogging, which can lead to root diseases and reduced tree vitality.",
        "Improving soil fertility with organic compost or well-rotted manure can enhance tree health and nut production."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Pruning is essential for maintaining the size of the Common Hazelnut Tree and improving light penetration, which boosts nut production.",
        "Regularly inspecting the tree for pests such as filbert worms or aphids can prevent infestations and maintain tree health."
    ]
}