{
    "name": "Common Tansy",
    "climate": ["Common Tansy thrives best in temperate climates where it experiences distinct seasonal changes.", "It can tolerate a range of climates but prefers regions that are neither too hot nor too cold.", "In Mediterranean climates, it can grow effectively, especially in regions with mild, wet winters.", "This plant can also be found in some cooler climates, showing a degree of adaptability across environments."],
    "sunlight": ["Common Tansy prefers full sunlight exposure for optimal growth and flowering.", "Although it thrives in full sun, it can tolerate partial shade but may not flower as vigorously.", "The plant is best situated in areas where it receives at least six to eight hours of direct sunlight daily.", "However, in hotter climates, it may benefit from some afternoon shade to prevent leaf scorch."],
    "watering": ["Common Tansy requires moderate watering and is somewhat drought-tolerant once established.", "During its growing season, regular watering helps promote healthy growth, especially in dry periods.", "Avoid overwatering, as it prefers well-drained soil and excessive moisture can lead to root rot.", "In areas with natural rainfall, supplemental watering might be unnecessary except during drought conditions."],
    "soil": ["The plant thrives in well-drained soil and can tolerate poor soils, showing resilience in various conditions.", "Although it can grow in a range of soil types, it prefers moderately fertile soil for optimal growth.", "Sandy and gravelly soils are particularly suitable, as they mimic its natural environment.", "The soil should be slightly acidic to neutral, pH ranging from about 6.0 to 7.5 for best results."],
    "toxic": ["Common Tansy contains compounds that can be toxic if ingested by humans and pets.", "The toxicity arises from thujone, which can cause adverse effects if consumed.", "It is important to avoid consumption, and care should be taken if grown in areas accessible to children or animals.", "Always handle with care, and consider wearing gloves to prevent skin irritation if sensitive."],
    "extra_care_tip": ["Regular deadheading of flowers can help prevent self-seeding and control its spread.", "Pruning in the fall can encourage healthier and more compact growth in the following season.", "Watch for signs of powdery mildew and other fungal diseases, especially in humid areas.", "Providing adequate spacing between plants can improve air circulation and reduce disease risk."]
}