{
    "name": "Common Quince",
    "climate": [
        "Common Quince thrives best in temperate climates with cool winters to trigger flowering and fruiting.",
        "It is well-suited to regions with mild summers where extremes of heat or cold are rare.",
        "This plant tolerates climates that experience moderate humidity throughout the year.",
        "It prefers locations where frost is not common during the growing season."
    ],
    "sunlight": [
        "Common Quince requires full sunlight for optimal growth and fruit production.",
        "It thrives in conditions where it receives at least six to eight hours of direct sunlight daily.",
        "Partial shade can hinder its growth and significantly reduce fruit yield and quality.",
        "Positioning it in a location with southern exposure ensures ample sunlight throughout the day."
    ],
    "watering": [
        "Regular watering is necessary for Common Quince, especially during dry, summer months.",
        "It benefits from well-drained soil moisture, avoiding both drought and waterlogging conditions.",
        "During the growing season, water regularly to maintain even soil moisture levels.",
        "Overwatering or allowing the soil to completely dry out can stress the plant and reduce fruit."
    ],
    "soil": [
        "Common Quince thrives in well-drained, loamy soils rich in organic matter.",
        "It prefers slightly acidic to neutral pH levels, ideally between 6.0 and 7.0.",
        "Clay soils should be amended with sand or composted material to improve drainage.",
        "Ensuring the soil retains moisture without becoming waterlogged is crucial for health."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Pruning is essential to maintain shape and remove any diseased or dead wood.",
        "Apply mulch around the base to retain moisture and suppress weed growth.",
        "Regularly check for and control pests such as aphids or moths that can damage the fruit.",
        "In colder climates, consider providing winter protection to prevent frost damage."
    ]
}