{
    "name": "Coral Cactus",
    "climate": [
        "Coral Cactus thrives best in warm climates, typically ranging from 60°F to 85°F. They do not tolerate frost well.",
        "They thrive in arid and semi-arid climates, where there is less humidity in the air.",
        "A common requirement is an environment with good air circulation to prevent fungal diseases.",
        "Being a hybrid plant, it can adapt to indoor environments if kept warm and dry."
    ],
    "sunlight": [
        "Coral Cactus prefers bright indirect sunlight to prevent burning of the fleshy parts.",
        "Direct sunlight can cause sunburn. Provide filtered light or partial shade.",
        "If kept indoors, place them near a window where they can receive plenty of light.",
        "In outdoor settings, morning sun or dappled sunlight conditions are preferred."
    ],
    "watering": [
        "Allow the soil to dry out completely between waterings to mimic desert conditions.",
        "Overwatering is a common mistake and can lead to root rot; water sparingly.",
        "During the warmer months, water more frequently, but still allow soil to dry out.",
        "Reduce watering significantly during winter months as the plant's water needs decrease."
    ],
    "soil": [
        "Use well-draining cactus or succulent soil to prevent water retention.",
        "A mix of sand, perlite, and potting soil often provides the ideal drainage.",
        "Soil must have excellent drainage properties to keep roots healthy and dry.",
        "Avoid soils that retain moisture as they can cause root rot in the plant."
    ],
    "toxic": [
        "The Coral Cactus is considered mildly toxic to pets and humans if ingested.",
        "Its milky sap, typical of Euphorbia species, can cause irritation on contact."
    ],
    "extra_care_tip": [
        "Avoid touching or ingesting the plant's sap as it can cause skin irritation.",
        "Regularly inspect for pests such as mealybugs and treat immediately if found."
    ]
}