{
    "name": "Coral Bean",
    "climate": [
        "Coral Bean thrives in a temperate to subtropical climate zone, where temperatures are mild.",
        "This plant prefers a climate with distinct seasons but can tolerate occasional frost.",
        "It grows well in areas where the average annual temperature ranges from 60°F to 80°F.",
        "Coral Bean is suitable for climates with moderate humidity, avoiding extreme arid conditions."
    ],
    "sunlight": [
        "Coral Bean requires full sun conditions, which means it needs at least six hours of direct sunlight daily.",
        "It can adapt to partial shade but may produce fewer flowers if not enough sunlight is available.",
        "The plant thrives in open areas where it can receive unfiltered natural sunlight throughout the day.",
        "Growing it in too much shade could lead to elongated stems and reduced vigor."
    ],
    "watering": [
        "This plant prefers consistently moist soil, especially during its growing season.",
        "Coral Bean should be watered deeply but infrequently, allowing the top few inches to dry out.",
        "It's drought-tolerant once established, but young plants need regular watering to develop.",
        "Avoid overwatering, as excess moisture can lead to root rot in this plant."
    ],
    "soil": [
        "Coral Bean thrives in well-drained, sandy or loamy soil with good aeration.",
        "The soil should have moderate fertility, avoiding overly rich conditions that cause leggy growth.",
        "A slightly acidic to neutral pH, ranging from 6.0 to 7.0, is optimal for Coral Bean.",
        "Improve soil drainage by adding organic matter or coarse sand to the planting area."
    ],
    "toxic": [
        "The seeds and certain parts of the Coral Bean plant are highly toxic if ingested.",
        "Ingestion of the toxic parts can cause symptoms like nausea, vomiting, and diarrhea.",
        "Care should be taken to keep the plant out of reach of children and pets.",
        "It is advised to wear gloves when handling the plant to avoid skin irritation."
    ],
    "extra_care_tip": [
        "Prune the plant after flowering to maintain a tidy shape and promote new growth.",
        "Coral Bean may benefit from mulching to conserve moisture and reduce weeds around the base.",
        "Protect it from harsh winter conditions by covering with a frost cloth if necessary.",
        "Consider staking taller plants to prevent them from toppling over in windy conditions."
    ]
}