{
    "name": "Cordyline",
    "climate": [
        "Cordyline plants thrive in warm and tropical climates where temperatures are consistent.",
        "They prefer a humid climate that mimics their native conditions for optimal growth.",
        "Avoid exposing Cordyline to temperatures below 55°F to prevent damage to leaves.",
        "Indoor growth is possible where outdoor climate conditions are not suitable and warm."
    ],
    "sunlight": [
        "Cordyline plants prefer bright, indirect sunlight for optimal leaf coloration.",
        "Too much direct sunlight can scorch the leaves, leading to browning edges.",
        "In low-light conditions, Cordyline's growth may slow, and leaves may lose color.",
        "Ideal lighting conditions include filtered sunlight or semi-shade outdoors."
    ],
    "watering": [
        "Consistent watering is key, but overwatering can lead to root rot issues.",
        "Allow the top inch of soil to dry out between waterings to prevent soggy soil.",
        "In winter, reduce watering frequency as the plant's growth rate slows down.",
        "Humidity trays can support healthy growth, especially in drier indoor environments."
    ],
    "soil": [
        "A well-draining potting mix is essential to prevent waterlogging around roots.",
        "Incorporating perlite or sand can enhance the aeration and drainage of the soil.",
        "Rich in organic matter, the soil mix should also retain some moisture for roots.",
        "Avoid heavy clay soils which retain too much moisture, hindering root development."
    ],
    "toxic": [
        "Cordyline is toxic to cats and dogs if ingested, causing vomiting and drooling.",
        "Symptoms include loss of appetite and depression in pets that consume Cordyline."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to remove dust and promote photosynthesis.",
        "Prune spent leaves to encourage new growth and maintain the overall appearance."
    ]
}