{
    "name": "Corkscrew Willow",
    "climate": [
        "The Corkscrew Willow thrives in temperate climates with moderate temperature variations.",
        "This tree prefers regions where winters are not extremely harsh or summers too scorching.",
        "It can adapt to a range of climates but does best where humidity is moderate to high.",
        "Areas with regular rainfall throughout the year provide optimal growth conditions."
    ],
    "sunlight": [
        "Corkscrew Willows require full sun to partial shade for healthy growth.",
        "They should receive at least six hours of direct sunlight each day for optimal growth.",
        "While tolerant of some light shade, ample sunlight promotes the best foliage and structure.",
        "In regions with intense sun, some afternoon shade can prevent leaf scorch."
    ],
    "watering": [
        "Regular watering is necessary, especially in dry spells, to keep the soil consistently moist.",
        "The tree appreciates more frequent watering in its initial years to establish roots.",
        "Ensure the soil drainage is sufficient to prevent waterlogging, which can harm roots.",
        "If planted near a water source, it may require less supplemental watering from you."
    ],
    "soil": [
        "Corkscrew Willows are adaptable but prefer rich, well-drained loamy soil for robust growth.",
        "They can tolerate various soil types, including clay, but proper drainage is crucial.",
        "The soil should retain moisture without becoming waterlogged or excessively dry.",
        "Adding organic matter such as compost can enhance soil fertility and texture."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune the Corkscrew Willow regularly to maintain its unique twisted branch structure.",
        "Watch for signs of pests like aphids and address them promptly to avoid damage.",
        "Check for diseases such as cankers and implement control measures if needed.",
        "Mulch around the base to retain soil moisture and reduce weed competition."
    ]
}