{
    "name": "Creeping Mazus",
    "climate": [
        "Creeping Mazus thrives in temperate climates with moderate seasonal variations.",
        "It can handle occasional frost but prefers areas without severe winters or scorching summers.",
        "Adaptable to various climates, it flourishes best where humidity levels are moderate.",
        "Regions with mild, damp conditions are optimal for Creeping Mazus growth."
    ],
    "sunlight": [
        "Creeping Mazus prefers partial to full shade for optimal growth, avoiding harsh afternoon sun.",
        "It can tolerate some direct sunlight, especially morning sun, but prefers filtered light.",
        "In very hot climates, protection from the strongest midday sun is advisable to prevent leaf scorch.",
        "A location that receives dappled sunlight throughout the day is ideal for Creeping Mazus growth."
    ],
    "watering": [
        "Creeping Mazus requires consistently moist soil but should not be left in soggy conditions.",
        "Water regularly to keep the soil damp, especially in dry weather, to prevent drying out.",
        "Although it can survive short dry spells, continual dry soil affects its growth negatively.",
        "Ensure the soil remains evenly wet, especially during establishment and active growth phases."
    ],
    "soil": [
        "Prefers rich, well-draining soil with a good supply of organic matter for best results.",
        "Can adapt to a variety of soil types, including sandy, clay, or loamy soils, as long as drainage is adequate.",
        "Soil should hold moisture but also allow excess water to drain to prevent root rot.",
        "Amend soil with compost or other organic material to enhance nutrients and drainage properties."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To promote denser growth and prevent legginess, trim back Creeping Mazus after flowering.",
        "Consider mulching around the plant to help retain moisture and reduce weed competition."
    ]
}