{
    "name": "Cyclamen",
    "climate": [
        "Cyclamen prefer a temperate climate that is not too hot or cold.",
        "They thrive in temperatures between 50-60°F during the day.",
        "Cold climates can be detrimental, especially if temperatures drop below freezing.",
        "High humidity levels can help, but avoid excessive dew and wetness."
    ],
    "sunlight": [
        "Cyclamen grows best in indirect sunlight or light shade.",
        "Avoid placing them in direct sunlight, which can scorch their leaves.",
        "Filtered light is ideal, such as through a sheer curtain or a shaded area.",
        "They can also tolerate full shade conditions, but growth may slow."
    ],
    "watering": [
        "Water cyclamen regularly but allow the soil to dry slightly between waterings.",
        "Overwatering can cause the tubers to rot, so well-draining soil is crucial.",
        "It's best to water from the bottom to avoid wetting the foliage.",
        "Reduce watering when the plant enters its dormant phase in the summer."
    ],
    "soil": [
        "Cyclamen require well-draining soil to prevent tuber rot and root diseases.",
        "A mix of potting soil with sand or perlite works well for cyclamen.",
        "The soil should be rich in organic matter to provide necessary nutrients.",
        "Slightly acidic to neutral soil is preferred, with a pH of 6.0 to 7.0."
    ],
    "toxic": [
        "Cyclamen are toxic to pets, especially dogs and cats if ingested.",
        "The plant contains saponins, which can cause gastrointestinal distress.",
        "Ingesting tubers, in particular, can lead to more severe symptoms.",
        "Symptoms include vomiting, diarrhea, and in severe cases, seizures."
    ],
    "extra_care_tip": [
        "Deadhead faded flowers to encourage continuous blooming and new growth.",
        "Cyclamen can go dormant in summer; protect tubers from excessive heat.",
        "Consider repotting every 2-3 years to refresh soil and check tubers for rot.",
        "Provide a cool room with bright, indirect light during their growing season."
    ]
}