{
    "name": "Cymbidium Orchid",
    "climate": [
        "Cymbidium Orchids thrive in temperate climates with mild winters. They prefer conditions that are warm in the day and cool at night.",
        "They are ideal for cultivation in coastal areas where temperatures are moderate year-round. Avoid areas with extreme cold or heat.",
        "The orchids benefit from climates with moderate humidity, usually ranging between 50 to 75 percent, helping them maintain turgidity.",
        "In climates with seasonal variations, these orchids need protection from frost, which can damage the delicate flowers and leaves."
    ],
    "sunlight": [
        "Cymbidium Orchids require bright, indirect sunlight for healthy growth, ideally in a spot with filtered light.",
        "Direct sunlight can scorch the leaves, so it's crucial to provide shade during the hottest parts of the day.",
        "Providing morning sun and afternoon shade mimics their natural environment and aids in bud formation.",
        "Low light levels can lead to poor flower production, though the leaves may remain healthy."
    ],
    "watering": [
        "Watering should be consistent, but allow some drying out between waterings to prevent root rot.",
        "In spring and summer, the growing season, watering should be more frequent to support active growth.",
        "During fall and winter, reduce watering to once every 7-10 days or when the potting medium has dried out.",
        "Always use room-temperature water and ensure excess water drains thoroughly to maintain healthy roots."
    ],
    "soil": [
        "Cymbidium Orchids need a coarse, well-draining potting mix, typically made of bark or coco coir.",
        "The mix should retain some moisture but also provide adequate aeration to prevent root suffocation.",
        "Avoid using regular potting soil, which retains too much water and can lead to fungal issues.",
        "Repotting every 2-3 years helps refresh the growing medium and provides nutrients for healthy growth."
    ],
    "toxic": [
        "Cymbidium Orchids are generally non-toxic to pets and humans, making them a safe choice for households."
    ],
    "extra_care_tip": [
        "Cymbidium Orchids benefit from periodic feeding with a balanced orchid fertilizer to support blooming."
    ]
}