{
    "name": "Dahoon Holly",
    "climate": [
        "Dahoon Holly thrives in warm, humid climates and is often found in southeastern US.",
        "This plant is highly adaptable to areas that have milder winter temperatures.",
        "It is best suited for USDA hardiness zones 7 through 11, where it flourishes.",
        "Dahoon Holly can tolerate occasional cold snaps but prefers warm climates."
    ],
    "sunlight": [
        "This plant prefers full sun to partial shade, thriving under ample sunlight.",
        "In areas with intense sunlight, partial shade can help protect it from scorching.",
        "Providing at least 6 hours of direct sunlight daily encourages optimal growth.",
        "While it can grow in shade, it performs best with some daily exposure to sun."
    ],
    "watering": [
        "Dahoon Holly requires consistently moist soil, especially during its growing season.",
        "Avoid letting the soil completely dry out; it prefers regular watering schedules.",
        "In particularly dry periods, additional water may be necessary to sustain health.",
        "Ensure the plant doesn't sit in waterlogged soil, as this can damage its roots."
    ],
    "soil": [
        "Preferring acidic soil, Dahoon Holly does well in environments with low pH levels.",
        "It can tolerate various soil types but thrives in well-draining, fertile soil.",
        "Mulching can help retain soil moisture and maintain ideal growing conditions.",
        "Avoid dense, compacted soils to prevent root rot and ensure healthy root systems."
    ],
    "toxic": [
        "The berries of the Dahoon Holly are mildly toxic if ingested in large quantities.",
        "Symptoms of ingestion may include nausea, vomiting, or mild gastrointestinal upset."
    ],
    "extra_care_tip": [
        "Prune Dahoon Holly in late winter to control size and promote bushy growth.",
        "Watch for pests such as scales or mites, treating with horticultural oil if needed."
    ]
}