{
    "name": "Daphne",
    "climate": [
        "Daphne plants prefer temperate climates with no extreme cold or heat.",
        "They thrive in areas with cool summers and mild winters.",
        "High humidity levels can cause issues; prefer well-aerated environments.",
        "They are best grown in USDA zones 7 to 9, where conditions are optimal."
    ],
    "sunlight": [
        "They prefer partial shade for healthy growth and vibrant blooming.",
        "Full sunlight can be too harsh, leading to leaf scorch or dehydration.",
        "Dappled sunlight, like that under tree canopies, works well for them.",
        "Protect from direct afternoon sun in hot regions to avoid damage."
    ],
    "watering": [
        "Daphne requires well-drained soil as they do not tolerate wet feet.",
        "Overwatering can lead to root rot and eventual death of the plant.",
        "Regular watering is essential in dry spells, but ensure good drainage.",
        "Allow the top soil to dry slightly between waterings to prevent issues."
    ],
    "soil": [
        "Well-drained, loamy soils with good organic content suit Daphne best.",
        "They prefer slightly acidic to neutral pH levels in their soil.",
        "Heavy clay soils should be avoided; they need light, airy textures.",
        "Adding compost can improve soil quality and enhance plant health."
    ],
    "toxic": [
        "Daphne berries are highly toxic if ingested by humans or pets.",
        "The leaves and sap can cause skin irritation in some individuals.",
        "Symptoms of ingestion include nausea, vomiting, and diarrhea.",
        "Use caution when handling and keep them out of reach of children."
    ],
    "extra_care_tip": [
        "Daphne can be finicky; avoid relocating them once established.",
        "Pruning is best done sparingly to maintain their natural shape.",
        "Root disturbance can be detrimental, so be careful when weeding.",
        "Mulching helps retain soil moisture and maintain even temperatures."
    ]
}