{
    "name": "Delphinium",
    "climate": [
        "Delphinium thrives best in cool to moderate climates, avoiding extreme heat.",
        "Preferably grown in areas with mild summers and cold winters.",
        "They are commonly cultivated in temperate regions with defined seasons.",
        "Not well-suited to tropical climates, which can be too hot and humid."
    ],
    "sunlight": [
        "Delphiniums require full sun exposure to bloom optimally and thrive.",
        "While full sun is preferred, partial shade is beneficial in hot climates.",
        "It is important that Delphiniums get at least six hours of direct sunlight.",
        "Avoid planting them in fully shaded areas to prevent stunted growth."
    ],
    "watering": [
        "Consistent moisture is key; soil should be kept evenly moist at all times.",
        "Take care to avoid waterlogging; Delphiniums need good drainage too.",
        "Increase watering frequency during dry spells to prevent dehydration.",
        "Mulching can help retain soil moisture and keep the roots cool."
    ],
    "soil": [
        "Delphiniums prefer rich, well-draining soil that retains some moisture.",
        "The soil should be amended with organic matter, like compost or manure.",
        "A pH balance between 6.5 and 7.5 is often ideal for their growth.",
        "Compacted soils are unsuitable; these plants need aerated environments."
    ],
    "toxic": [
        "Delphinium plants are known to be toxic to humans and livestock.",
        "They contain alkaloids that can cause nausea, paralysis, or even death.",
        "Ingestion, especially of young plants and seeds, should be avoided.",
        "Handling without gloves may cause skin irritation in some individuals."
    ],
    "extra_care_tip": [
        "Stake tall varieties to prevent wind damage and support growth.",
        "Remove faded flowers to encourage a second bloom in the season.",
        "Protect young Delphiniums from slug damage which they are prone to.",
        "They benefit from regular feeding with a balanced, liquid fertilizer."
    ]
}