{
    "name": "Dendrobium Orchid",
    "climate": [
        "Dendrobium orchids thrive best in a climate that mimics their natural tropical habitats.",
        "Moderate climates with warm temperatures suit Dendrobium orchids well.",
        "They prefer a temperature range between 15°C and 30°C for optimal growth.",
        "High humidity levels, ideally between 50% and 70%, are required for these orchids."
    ],
    "sunlight": [
        "Dendrobium orchids require bright, indirect sunlight to flourish well.",
        "Too much direct sunlight can scorch leaves, so it's best avoided.",
        "Early morning sun or late afternoon light is beneficial for these orchids.",
        "Lack of enough light can hinder flowering, so balanced light is crucial."
    ],
    "watering": [
        "Water Dendrobium orchids thoroughly and allow the potting medium to dry out slightly between waterings.",
        "Frequency of watering can vary with climate but generally once a week is sufficient.",
        "During the growing season, they may need more water, but be cautious of overwatering.",
        "Reduce watering significantly during the plant's dormant period in winter."
    ],
    "soil": [
        "Orchids require special potting mixes such as bark, moss, or coconut husk.",
        "The potting medium should be well-aerated for proper root oxygenation.",
        "Good drainage is crucial for preventing root rot in Dendrobium orchids.",
        "Avoid using regular potting soil; it holds too much moisture and lacks aeration."
    ],
    "toxic": [
        "Dendrobium orchids are generally not toxic to humans or pets.",
        "However, ingestion is not recommended, as some individuals may have allergic reactions.",
        "Ensure plants are kept out of reach from pets and children to avoid potential issues.",
        "Although not toxic, always exercise caution and monitor any potential symptoms."
    ],
    "extra_care_tip": [
        "Dendrobium orchids may benefit from a period of rest after flowering.",
        "Keep them in cooler temperatures with less water during their dormant phase.",
        "Fertilize lightly during the growing season with a balanced orchid fertilizer.",
        "Regularly inspect for pests such as spider mites or aphids and manage promptly."
    ]
}