{
    "name": "Dog Rose",
    "climate": [
        "Dog Rose thrives best in temperate climates with mild, wet winters and dry summers.",
        "It can tolerate cold climates, making it suitable for northern regions with frosty conditions.",
        "In warmer climates, it's important to ensure adequate watering during the hot, dry season.",
        "Adapts well to a variety of climates but prefers regions with some seasonal rainfall."
    ],
    "sunlight": [
        "Prefers to be planted in full sunlight where it can soak up direct rays for most of the day.",
        "Can tolerate partial shade, especially in hotter climates, but flowering may be reduced.",
        "Ensure the plant receives at least six hours of sunlight daily to promote healthy growth.",
        "In shaded areas, plant may grow leggy and have fewer blooms, affecting its aesthetics."
    ],
    "watering": [
        "Water regularly during the growing season, ensuring the soil remains consistently moist.",
        "Once established, it is relatively drought-tolerant but still benefits from occasional deep watering.",
        "Avoid waterlogging the roots; ensure good drainage to prevent root rot and fungal diseases.",
        "During dry spells, increase the frequency of watering to support robust growth and flowering."
    ],
    "soil": [
        "Prefers fertile, well-drained soil rich in organic matter to support its growth needs.",
        "Can tolerate a variety of soil types including sandy, loamy, and clay soils if well-drained.",
        "Amend poor soils with compost or organic matter to improve fertility and drainage properties.",
        "Avoid heavy, waterlogged soils which can cause root diseases and hinder plant health."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune annually to maintain shape and remove dead or diseased branches to encourage vigorous growth.",
        "Regularly check for pests such as aphids or caterpillars that can damage leaves and blooms."
    ]
}