{
    "name": "Domino Variegated Peace Lily",
    "climate": [
        "This plant thrives in a warm, humid climate similar to tropical regions.",
        "Ideal temperatures range from 65°F to 80°F, avoiding cold drafts.",
        "Prefers high humidity levels, enhancing growth in indoor environments.",
        "Not suited for dry or arid climates and does best in consistent warmth."
    ],
    "sunlight": [
        "Requires indirect, bright sunlight but can tolerate low light conditions.",
        "Direct sunlight may scorch the leaves, leading to leaf damage.",
        "Best grown near windows that provide filtered or dappled light.",
        "Artificial fluorescent lights can supplement light in darker rooms."
    ],
    "watering": [
        "Keep the soil consistently moist but not overly soggy to prevent root rot.",
        "Watering should be reduced in winter when the plant's growth slows.",
        "Use room-temperature water to avoid shocking the plant's roots.",
        "The plant will indicate it's thirsty when leaves start to droop slightly."
    ],
    "soil": [
        "Prefers well-draining soil with high organic content, such as peat-based mix.",
        "A mixture of potting soil, peat moss, and perlite is ideal for proper drainage.",
        "Ensure the soil remains slightly acidic to neutral for optimal growth.",
        "Repot every 1-2 years in fresh soil to prevent nutrient depletion."
    ],
    "toxic": [
        "Domino Variegated Peace Lily is toxic to pets and humans if ingested.",
        "Contains calcium oxalate crystals that can cause irritation and vomiting.",
        "Keep out of reach of children and animals, especially in households.",
        "Seek immediate medical advice if ingestion occurs, to mitigate symptoms."
    ],
    "extra_care_tip": [
        "Regularly mist the leaves to increase humidity and mimic tropical conditions.",
        "Wipe leaves occasionally with a damp cloth to remove dust and improve shine.",
        "Prune discolored or dead leaves to encourage new growth and maintain health.",
        "During growing season, feed monthly with a balanced, water-soluble fertilizer."
    ]
}