{
    "name": "Dracaena",
    "climate": [
        "Dracaena plants thrive in warm climates with temperatures between 65 to 80°F.",
        "They prefer environments with humidity levels around 40 to 50 percent.",
        "These plants do well in USDA hardiness zones 10 to 11 when grown outside.",
        "Cold drafts or sudden drops in temperature can damage Dracaena plants."
    ],
    "sunlight": [
        "Dracaena prefers bright, indirect light but can tolerate moderate shade.",
        "Direct sunlight can scorch the leaves, causing brown tips and edges.",
        "Ensure the plant is placed near a window with filtered sunlight or partial shade.",
        "Artificial light can be used to supplement lighting in darker areas of the home."
    ],
    "watering": [
        "Water the Dracaena plant when the top inch of soil feels dry to the touch.",
        "Overwatering can lead to root rot, so do not allow the plant to sit in water.",
        "Reduce watering frequency during the winter months when growth slows down.",
        "Always use room-temperature water to avoid shocking the plant roots."
    ],
    "soil": [
        "Use a well-draining potting mix, such as one formulated for houseplants.",
        "A mix of peat, loam, and perlite or sand can be ideal for Dracaena.",
        "Ensure the pot has drainage holes to prevent water from accumulating.",
        "Re-pot the plant every couple of years to refresh the soil and space."
    ],
    "toxic": [
        "Dracaena plants are toxic to pets, particularly cats and dogs.",
        "Ingestion may cause vomiting, loss of appetite, and increased salivation.",
        "Seek veterinary advice if pets show symptoms after biting the plant."
    ],
    "extra_care_tip": [
        "Regularly wipe leaves with a damp cloth to remove dust.",
        "Rotate the plant periodically to ensure even growth on all sides.",
        "Fertilize every two to four weeks during the growing season for best results.",
        "Prune any brown or damaged leaves to maintain the plant's appearance."
    ]
}