{
    "name": "Dragon Lily",
    "climate": [
        "Dragon Lilies thrive in temperate climates with mild changes in temperature.",
        "They prefer environments with a consistent temperature range but can tolerate some fluctuation.",
        "Humidity is important; they grow well in environments with moderate to high humidity levels.",
        "Avoid extremely cold climates as they are not frost tolerant and can be damaged."
    ],
    "sunlight": [
        "Dragon Lilies prefer filtered or dappled sunlight, similar to their natural forest habitats.",
        "Direct, strong sunlight can be harmful, so it's best to offer partial shade during peak hours.",
        "They can adapt to lower light conditions, but growth may be slower or less robust.",
        "Morning sunlight or indirect light through a window is usually optimal for these plants."
    ],
    "watering": [
        "Keep the soil consistently moist, but avoid waterlogging the plant, which can lead to root rot.",
        "Allow the top layer of soil to dry out slightly between waterings to prevent overwatering.",
        "During their growing season, which is spring and summer, more frequent watering may be necessary.",
        "In the dormant winter months, reduce watering significantly, allowing it to dry out more."
    ],
    "soil": [
        "Well-draining soil is essential to prevent water accumulation around the roots.",
        "A soil mix rich in organic matter, such as peat or compost, is beneficial for Dragon Lilies.",
        "They thrive in slightly acidic to neutral pH levels, so adjust soil acidity accordingly.",
        "A combination of potting soil, sand, and organic matter generally works well for potting."
    ],
    "toxic": [
        "Dragon Lilies are toxic to both humans and animals if ingested, causing irritation and illness.",
        "Handling the plant may cause skin irritation; wear gloves to protect against sap."
    ],
    "extra_care_tip": [
        "Incorporate a monthly balanced feed during growing seasons to support healthy growth.",
        "Repot the plant every couple of years to refresh soil nutrients and provide room for growth."
    ]
}