{
    "name": "Dragonfruit",
    "climate": [
        "Dragonfruit thrives in warm climates with temperatures between 65°F and 80°F. It cannot withstand frost and requires a consistent warm environment.",
        "Ideal climates for dragonfruit are tropical or subtropical regions, where the temperature remains stable throughout the year.",
        "This plant prefers regions with high humidity, although it can adapt to drier areas if necessary, but growth may be slower.",
        "Dragonfruit needs to be protected from cold winds and frost, especially during winter months, to prevent damage to the plant."
    ],
    "sunlight": [
        "Dragonfruit plants require full sunlight to thrive, necessitating at least six to eight hours of direct sunlight daily.",
        "While full sun is ideal, dragonfruit can tolerate some afternoon shade in particularly hot climates to prevent sun scorch.",
        "Inadequate sunlight can lead to poor growth and fruit production, so ensure the planting location offers ample light.",
        "If growing indoors or in a greenhouse, supplemental lighting may be needed to provide sufficient light exposure for optimal growth."
    ],
    "watering": [
        "Dragonfruit requires moderate watering, allowing the soil to dry out between watering to prevent root rot issues.",
        "Overwatering can be detrimental, as dragonfruit is a type of cactus that can tolerate some drought conditions.",
        "In the summer, the plant may need watering once a week, while in winter, reduce watering to every two to three weeks.",
        "Monitor soil moisture levels closely; the soil should be slightly moist but well-drained to support healthy growth."
    ],
    "soil": [
        "The ideal soil for dragonfruit cultivation is well-draining sandy or loamy soil enriched with organic matter.",
        "Dragonfruit prefers slightly acidic to neutral soil with a pH range of 6.0 to 7.0 for nutrient uptake.",
        "To improve drainage, consider adding perlite or coarse sand to the soil mix, which helps prevent waterlogging.",
        "Compacted or heavy clay soils should be avoided, as they can trap excess water and lead to root rot problems."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Support the plant with a sturdy trellis or climbing structure to encourage growth upward and prevent the sprawling habit.",
        "Regularly check for pests such as aphids or mealybugs, which can damage the plant, and apply appropriate organic pesticides as needed."
    ]
}