{
    "name": "Easter Cactus",
    "climate": [
        "Easter Cactus thrives in a temperate climate that avoids intense heat or frost. They are accustomed to mild temperatures.", 
        "An ideal temperature range for Easter Cacti is between 60 to 75 degrees Fahrenheit, ensuring they are neither too hot nor too cold.", 
        "This plant prefers a climate with moderate humidity levels, similar to the natural conditions of the Brazilian rainforest.", 
        "Sudden changes in temperature should be avoided, as they can stress the plant, leading to potential health issues."
    ],
    "sunlight": [
        "Bright, indirect light is ideal for Easter Cacti as direct sunlight can scorch their leaves.", 
        "East or north-facing windows are perfect, providing the gentle morning sun without afternoon intensity.", 
        "Excessive exposure to direct sunlight should be avoided to prevent leaf damage or color fading.", 
        "If kept outdoors, placing them under a tree canopy can filter light effectively, protecting them from harsh rays."
    ],
    "watering": [
        "Allow the soil to dry out slightly before watering again, especially during their rest period.", 
        "Overwatering can lead to root rot; thus, checking the topsoil's dryness is crucial.", 
        "During active growth in spring, more frequent watering might be necessary to support growth.", 
        "Watering should be on a schedule but adjusted for humidity and temperature conditions in their environment."
    ],
    "soil": [
        "A well-draining potting mix, often a cactus or succulent blend, helps prevent waterlogging.", 
        "Incorporating perlite or pumice into the soil mix can enhance aeration and drainage.", 
        "The soil should be slightly acidic to neutral, mimicking their natural habitat for optimal growth.", 
        "Regular repotting every couple of years can replace old soil, refreshing nutrients and ensuring proper root health."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To encourage blooming, allow the plant a resting period with cooler temperatures around 50-55°F at night.", 
        "Once flower buds appear, avoid relocating the plant to prevent bud drop or stress.", 
        "Regularly remove dead flowers and leaves to maintain plant health and aesthetics.", 
        "Maintain a light feeding schedule using a balanced, water-soluble fertilizer every few weeks during growing seasons."
    ]
}