{
    "name": "Elephant's Ear",
    "climate": [
        "Elephant's Ear plants thrive in tropical and subtropical climates, requiring warm temperatures.",
        "These plants prefer a humid environment, making them suitable for humidity of around 70%.",
        "It's crucial to provide a consistent temperature without sudden drops below 50°F (10°C).",
        "Avoid exposing the plant to dry and cold climates as it can hinder their growth."
    ],
    "sunlight": [
        "They thrive in bright, indirect sunlight and can tolerate some dappled shade.",
        "Avoid direct sunlight as it can scorch their large, delicate leaves.",
        "Bright, indirect light provides optimal conditions for growth and foliage development.",
        "In lower light situations, growth may slow, and leaves may become smaller."
    ],
    "watering": [
        "Water Elephant's Ear plants consistently to keep the soil evenly moist.",
        "Avoid letting the soil dry out completely between waterings to prevent stress.",
        "During active growth, they may require more frequent watering sessions.",
        "Reduce watering frequency during the plant's dormant period in winter months."
    ],
    "soil": [
        "A rich, well-draining potting mix is ideal, with good organic matter content.",
        "Ensure the soil retains moisture but does not become waterlogged to avoid root rot.",
        "Incorporate materials like peat moss or coco coir to enhance moisture retention.",
        "Soil pH should be slightly acidic to neutral, around 5.5 to 7.0, for optimal health."
    ],
    "toxic": [
        "Elephant's Ear plants contain calcium oxalate crystals, which are toxic if ingested.",
        "Ingestion can cause severe irritation and swelling of the mouth and throat in pets and humans.",
        "It is important to keep these plants out of the reach of children and pets due to toxicity.",
        "Symptoms of ingestion include drooling, oral pain, and difficulty swallowing or breathing."
    ],
    "extra_care_tip": [
        "Provide adequate humidity, as dry air can cause leaf edges to brown and become crispy.",
        "Regularly clean the leaves to remove dust and debris, ensuring optimal photosynthesis.",
        "If grown indoors, consider placing the plant near a humidifier for added moisture.",
        "Repot annually or biannually to replenish nutrients and provide room for root growth."
    ]
}