{
    "name": "Elephant's Foot",
    "climate": [
        "Elephant's Foot thrives in a warm, semi-arid climate, which mimics its native habitats in Mexico.",
        "Leans towards arid and semi-desert conditions, making it ideal for dry indoor environments.",
        "Tolerates a range of temperatures but does not survive freezing or frosty conditions.",
        "Prefers moderate humidity but is very drought tolerant, suitable for indoor home climates."
    ],
    "sunlight": [
        "Requires full sun exposure for several hours daily to thrive, mimicking its natural habitat.",
        "Can tolerate partial shade but will grow optimally in bright, direct sunlight settings.",
        "If grown indoors, place near a window that receives plenty of direct sunlight throughout the day.",
        "Insufficient sunlight may cause elongated stems and reduced growth, impacting its unusual shape."
    ],
    "watering": [
        "Needs infrequent watering; allow the soil to dry out completely between waterings.",
        "Overwatering is a common issue, as the plant stores water in its thick trunk; water sparingly.",
        "In winter, reduce watering significantly, mimicking its dormant state in natural conditions.",
        "Best practice is to water thoroughly but rarely, ensuring good drainage to avoid root rot."
    ],
    "soil": [
        "Prefers well-draining soil mixes that resemble cactus or succulent potting soil.",
        "A mix of sand, perlite, and potting soil ensures proper drainage and prevents waterlogging.",
        "Not tolerant of heavy, clay soils which retain more moisture and can lead to root damage.",
        "Adding gravel or small stones to the bottom of the pot can improve drainage significantly."
    ],
    "toxic": [
        "Elephant's Foot is generally non-toxic, making it safe for homes with pets and children."
    ],
    "extra_care_tip": [
        "Avoid frequent repotting as the plant grows slowly; it thrives in tight spaces.",
        "Wipe the leaves occasionally to remove dust and allow better light absorption.",
        "Prune dead or damaged leaves to maintain appearance and encourage new growth.",
        "Fertilize sparingly in the growing season; too much fertilizer can harm the plant."
    ]
}