{
    "name": "Elephant Bush",
    "climate": [
        "Elephant Bush thrives in warm, dry climates typically found in arid regions.",
        "It is well-suited for climates that do not experience frost or freezing temperatures.",
        "This plant can tolerate mild drought conditions, making it ideal for xeriscaping gardens.",
        "Elephant Bush prefers areas with low humidity and minimal rainfall for optimal growth."
    ],
    "sunlight": [
        "Elephant Bush requires bright light for at least four to six hours daily for healthy growth.",
        "It can tolerate direct sunlight but prefers some afternoon shade in extremely hot regions.",
        "Insufficient sunlight can result in leggy growth and dull leaf color in Elephant Bush.",
        "Consider placing the plant near a south-facing window for optimal sun exposure indoors."
    ],
    "watering": [
        "Water Elephant Bush sparingly, allowing the soil to dry out completely between waterings.",
        "Overwatering is a common issue; the plant dislikes consistently moist or waterlogged soil.",
        "During the dormant winter months, reduce watering frequency significantly to prevent root rot.",
        "Ensure proper drainage by using pots with drainage holes to avoid water stagnation."
    ],
    "soil": [
        "Elephant Bush thrives in well-draining soil, typically a cactus or succulent mix.",
        "A sandy or gritty soil composition helps prevent root rot by allowing excess water to escape.",
        "Avoid heavy clay soils that retain water, as they can lead to root issues for Elephant Bush.",
        "Incorporate organic matter or perlite into the soil mix to enhance aeration and drainage."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune Elephant Bush regularly to encourage bushier growth and remove leggy stems.",
        "Propagation is easily done by cuttings; allow cut ends to callous before potting.",
        "Keep an eye out for pests like mealybugs and spider mites, particularly indoors.",
        "Avoid sudden temperature changes; introduce Elephant Bush to new conditions gradually."
    ]
}