{
    "name": "English Lavender",
    "climate": ["English Lavender thrives in temperate climates where winters are cool and summers are mild. It can tolerate drought but prefers regular watering.", "Ideal climate for English Lavender includes coastal regions where humidity levels are moderate to low, preventing diseases.", "It is well-suited for regions with Mediterranean climates, experiencing warm, dry summers and cool, wet winters.", "English Lavender does not tolerate cold, wet winters well and needs protection when temperatures fall below freezing."],
    "sunlight": ["English Lavender requires full sunlight to thrive, ideally six to eight hours per day. This promotes strong growth and abundant flowering.", "The plant can tolerate partial shade, but this often leads to reduced flowering and less aromatic foliage compared to full sun.", "Ensure that English Lavender is planted in an open area where it can receive sunlight throughout the day for optimal health.", "For best results, position the lavender on a southern-facing slope or area that ensures maximum sun exposure without obstruction."],
    "watering": ["English Lavender prefers well-drained soil and is drought-tolerant once established. Excess watering can lead to root rot.", "Water deeply but infrequently, allowing the soil to dry out completely between watering sessions to mimic its natural habitat.", "In the growing season, reduce watering frequency as the plant becomes more hardy to drought conditions and requires less moisture.", "Avoid overhead watering to prevent moisture on leaves and flowers, which can lead to fungal diseases."],
    "soil": ["Soil for English Lavender should be well-draining, alkaline to neutral, with a pH of around 6.5 to 7.5 for optimal growth.", "Gravelly or sandy soil types work best to ensure adequate drainage, preventing waterlogging that can harm the roots.", "Adding organic matter such as compost can improve the soil structure, but ensure it doesn’t increase moisture retention excessively.", "Avoid clay-heavy soils that retain water, as they can cause root rot and hinder the plant’s growth."],
    "toxic": ["English Lavender is generally non-toxic to humans and pets, making it a safe option for gardens used by families and animals."],
    "extra_care_tip": ["Prune English Lavender annually to maintain shape and encourage new growth. Cut back about one-third of the plant after flowering is ideal."]
}