{
    "name": "English Bluebells",
    "climate": [
        "English Bluebells thrive in temperate climates where the seasons are distinct.",
        "They prefer regions with cool summers and moist, humid conditions throughout the year.",
        "Ideal climates for English Bluebells have moderate rainfall and well-distributed moisture.",
        "These plants often grow in slightly cooled climates with mild winter temperatures."
    ],
    "sunlight": [
        "English Bluebells flourish in partial shade, often found under the canopy of deciduous trees.",
        "They require dappled sunlight, similar to that found in woodland habitats during spring.",
        "Direct sun exposure is best avoided, especially in hotter climates to prevent drying.",
        "While they can tolerate brief periods of morning sun, they thrive better without full sun exposure."
    ],
    "watering": [
        "Consistent moisture is crucial during the growing season; avoid letting the soil dry out.",
        "Watering should be regular but not excessive, maintaining soil moisture without saturation.",
        "It is important to provide extra water during dry spells to emulate natural woodland rainfall.",
        "Overwatering should be avoided as English Bluebells prefer consistently moist but not waterlogged soil."
    ],
    "soil": [
        "English Bluebells prefer fertile, well-drained soil rich in organic matter and humus.",
        "Slightly acidic to neutral pH is ideal, ensuring adequate nutrient availability.",
        "Soil structure should be loose and crumbly, mimicking the forest floor ecosystem.",
        "Avoid heavy clay soils; they should be amended to enhance drainage and aeration."
    ],
    "toxic": [
        "English Bluebells contain glycosides that are toxic if ingested by humans and animals.",
        "All parts of the plant, including the bulbs, are considered toxic to pets such as dogs and cats."
    ],
    "extra_care_tip": [
        "Deadheading spent flowers can help prevent seed formation, encouraging bulb energy storage.",
        "After flowering, allow foliage to die back naturally to nourish the bulb for next year's growth."
    ]
}