{
    "name": "Epazote",
    "climate": ["Epazote thrives in warm climates and can often be found growing in regions with hot temperatures. It is native to tropical areas and adapts well to similar environments.", "This plant prefers a climate with moderate humidity, making it well-suited for regions that do not experience extreme dryness.", "While epazote is quite hardy, it doesn't tolerate frost well, so it grows best in areas where temperatures do not drop too low.", "Epazote can be grown in a temperate climate but requires protection from cold snaps to ensure healthy growth."],
    "sunlight": ["Epazote requires full sunlight to thrive, ensuring the plant receives at least six hours of direct sun daily.", "In partial shade, epazote might survive but won't grow as vigorously; it needs bright light conditions for optimal health.", "Providing full sun will help the plant produce more aromatic leaves, enhancing its culinary uses.", "If growing indoors, place epazote near a south-facing window or provide supplemental lighting to mimic outdoor sunlight conditions."],
    "watering": ["Epazote prefers moderate watering, ensuring the soil remains moist but never waterlogged, as overly damp conditions can promote root rot.", "During hotter spells, increase watering frequency to prevent the plant from drying out, especially if planted in a container.", "Allow the top inch of soil to dry out between waterings, as epazote does not like consistently wet roots.", "Adjust watering levels based on rainfall and season; reduce watering during cooler months to avoid excess moisture."],
    "soil": ["Epazote thrives in well-drained soil, which prevents water accumulation around its roots and promotes healthy growth.", "A sandy or loamy soil mix is ideal for epazote, as it provides the necessary drainage and nutrients for the plant.", "Adding organic matter or compost to the soil will improve fertility and help retain some moisture without becoming soggy.", "Ensure the soil pH is neutral to slightly acidic; this can be tested and adjusted if necessary for optimal plant health."],
    "toxic": ["Epazote contains compounds, such as ascaridole, that can be toxic in large amounts, so it should be used cautiously.", "Pregnant women should avoid consuming epazote, as it may induce uterine contractions and pose health risks."],
    "extra_care_tip": ["Regularly prune epazote to maintain its shape and encourage bushier growth, as well as prevent it from becoming invasive.", "Be aware of its strong aroma, which might be unpleasant to some; plant it in a location where the scent will be appreciated."]
}