{
    "name": "Euphorbia Ingens",
    "climate": [
        "Euphorbia Ingens thrives best in warm regions where temperatures are consistently high.",
        "This plant prefers semi-arid climates that replicate its natural habitat in Southern Africa.",
        "It can tolerate a range of temperatures but is best suited for areas without frost.",
        "High humidity is not ideal; it prefers dry conditions similar to desert environments."
    ],
    "sunlight": [
        "Euphorbia Ingens requires ample sunlight to grow robustly and maintain its health.",
        "This species thrives in full sun and should receive at least six hours of direct sunlight daily.",
        "If grown indoors, placing it near a south-facing window can provide adequate light.",
        "Lack of sunlight can cause the plant to become weak and potentially stretch towards the light."
    ],
    "watering": [
        "Water Euphorbia Ingens thoroughly but allow the soil to dry out completely between waterings.",
        "During the growing season, which is spring and summer, watering should be more frequent.",
        "In the dormancy period, notably in winter, watering should be reduced significantly.",
        "Overwatering can lead to root rot, a serious issue for this drought-tolerant plant."
    ],
    "soil": [
        "Euphorbia Ingens requires well-draining soil to prevent water retention around its roots.",
        "A cactus or succulent mix with added sand or perlite can enhance drainage and mimic natural conditions.",
        "The soil should be loose and airy to facilitate adequate oxygen circulation to the roots.",
        "Avoid dense or clay-heavy soils that can trap moisture and lead to root rot issues."
    ],
    "toxic": [
        "Euphorbia Ingens is toxic if ingested and can be hazardous to pets and humans when consumed.",
        "The plant's sap is irritating to the skin and eyes and should be handled with caution.",
        "Ingesting parts of this plant can cause symptoms like nausea, vomiting, and diarrhea.",
        "Wear gloves when handling Euphorbia Ingens to avoid skin contact with its toxic sap."
    ],
    "extra_care_tip": [
        "Euphorbia Ingens can become top-heavy, so use a heavy pot or plan for support as it grows.",
        "Regularly clean the plant or prune dead parts to prevent pests and maintain health.",
        "Gently wash off dust from its surface with water, allowing for better photosynthesis.",
        "Check for signs of pests like spider mites or aphids and treat with non-toxic solutions."
    ]
}