{
    "name": "Eureka Lemon Tree",
    "climate": [
        "Eureka lemon trees thrive in a warm climate and are best suited for USDA zones 9-11.",
        "They require a Mediterranean climate, with hot, dry summers and mild, wet winters.",
        "They can tolerate a few degrees of frost, but prolonged exposure can be damaging.",
        "Eureka lemon trees prefer moderate humidity levels, around 50-60%, for optimal growth."
    ],
    "sunlight": [
        "Eureka lemon trees need full sun, requiring at least 8 hours of direct sunlight each day.",
        "They should be planted in a location where they receive unobstructed sunlight throughout the day.",
        "Insufficient sunlight can lead to poor fruit production and stunted growth.",
        "In indoor settings, placing them near a south-facing window can help meet their light needs."
    ],
    "watering": [
        "Eureka lemon trees need regular watering, especially in their early growing stages.",
        "They prefer soil that is consistently moist but not waterlogged to prevent root rot.",
        "During hot seasons, increase watering frequency to accommodate increased evaporation.",
        "Reduce watering in winter, allowing the top inch of soil to dry out between waterings."
    ],
    "soil": [
        "Eureka lemon trees prefer well-draining soil with a slightly acidic to neutral pH.",
        "A sandy loam is ideal, allowing adequate drainage while retaining some moisture.",
        "A rich soil with organic matter supports healthy growth and fruit production.",
        "Avoid heavy clay soils that retain too much water, which can lead to root rot."
    ],
    "toxic": [
        "Eureka lemon trees are not toxic to humans when consumed in typical fruit amounts.",
        "The leaves, if ingested in large quantities, can cause mild gastrointestinal discomfort.",
        "Essential oils from the tree should not be ingested by pets like cats and dogs.",
        "Contact with citrus oils may cause skin irritation in sensitive individuals."
    ],
    "extra_care_tip": [
        "Regular pruning helps manage tree size and shape, promoting healthy fruiting.",
        "Protect trees from frost by covering them or moving pots indoors during winter.",
        "Monitor for pests like aphids and scale insects; treat using natural pesticides.",
        "Supplement the tree's diet with citrus-specific fertilizers for optimal nutrition."
    ]
}