{
    "name": "False Indigo",
    "climate": [
        "False Indigo is well-suited to climates with cold, freezing winters and warm summers.",
        "It can thrive in USDA hardiness zones ranging from 3 to 9, withstanding various temperatures.",
        "In regions with humid summers, ensure there is good air flow to prevent fungal diseases.",
        "In extremely hot climates, it may require some shade during the hottest part of the day."
    ],
    "sunlight": [
        "False Indigo prefers full sun exposure with at least six hours of direct sunlight daily.",
        "Partial shade may be suitable, but full sun will result in better flowering and growth.",
        "In shadier areas, plants may grow leggy, producing fewer blooms over the growing season.",
        "Avoid planting in areas with too much shade as it will impact the plant's overall health."
    ],
    "watering": [
        "Water young False Indigo plants regularly until they are well-established in the ground.",
        "Once established, they are drought-tolerant and require infrequent watering sessions.",
        "Overwatering can lead to root rot; ensure the soil is well-drained before watering again.",
        "During extreme drought conditions, additional watering might be needed to sustain growth."
    ],
    "soil": [
        "False Indigo thrives in well-drained soils ranging from sandy to rocky conditions.",
        "It prefers soil that can hold some moisture but drain away excess water efficiently.",
        "The plant is adaptable to soil pH levels, tolerating both slightly acidic and alkaline soils.",
        "Avoid heavy clay soils, as they retain too much water, potentially causing root damage."
    ],
    "toxic": [
        "All parts of the False Indigo plant are toxic if ingested by humans or animals.",
        "Exposure to the plant can cause symptoms like nausea, vomiting, and diarrhea."
    ],
    "extra_care_tip": [
        "Cut back old stems in early spring to promote new growth and enhance flowering.",
        "Consider plant division every few years to manage growth and encourage vigor."
    ]
}