{
    "name": "Fava Bean",
    "climate": [
        "Fava beans thrive in cool climates with temperatures between 60 to 65°F for best growth.",
        "They are suitable for temperate zones, preferring mild weather conditions over extremes.",
        "Avoid hot and humid climates as these conditions negatively impact growth and yield.",
        "In regions with mild winters, fava beans can be planted in the fall and overwintered."
    ],
    "sunlight": [
        "Fava beans need full sunlight for optimal growth, requiring at least 6 hours per day.",
        "While they prefer full sun, they can tolerate partial shade if necessary.",
        "In excessively hot regions, they might benefit from some afternoon shade.",
        "Ensure the plants receive adequate sunlight to maximize their flowering and pod development."
    ],
    "watering": [
        "Provide consistent watering to fava beans, particularly during flowering and pod development.",
        "Avoid waterlogging soil as it can lead to root rot; use well-draining soil for healthy plants.",
        "Mulching can help retain moisture and keep soil temperatures moderated around the roots.",
        "Adequate moisture is critical; drought conditions can significantly reduce yield."
    ],
    "soil": [
        "Fava beans prefer loamy soil that is rich in organic matter for the best growth results.",
        "The soil pH should ideally be between 6.0 and 6.8 to ensure nutrient availability.",
        "Ensure soil has good drainage, as persistent waterlogging can damage roots.",
        "Incorporate compost or aged manure to improve soil fertility before planting."
    ],
    "toxic": [
        "Fava beans contain compounds that can cause a condition called favism in susceptible individuals.",
        "Favism is a form of hemolytic anemia triggered by consuming fava beans, especially affecting those with G6PD deficiency."
    ],
    "extra_care_tip": [
        "Support plants with stakes or grow them along a trellis to prevent lodging from wind.",
        "Regularly check for aphids and other pests, and employ organic control measures if needed."
    ]
}