{
    "name": "Ficus Audrey",
    "climate": [
        "Ficus Audrey thrives in warm and humid environments, mimicking its native habitat.",
        "It is best suited to tropical and subtropical regions where temperatures are consistent.",
        "Avoid exposing Ficus Audrey to cold drafts or temperatures below 60°F (15°C).",
        "For optimal growth, this plant should be kept in climates with moderate humidity."
    ],
    "sunlight": [
        "Provide Ficus Audrey with bright, indirect sunlight to ensure its leaves remain vibrant.",
        "Avoid direct sunlight as this can scorch the leaves, causing them to yellow or brown.",
        "In lower light conditions, growth may slow, but the plant will generally tolerate it.",
        "If natural light is limited, consider using grow lights to supplement for best results."
    ],
    "watering": [
        "Water Ficus Audrey when the top inch of soil feels dry to the touch, averting overwatering.",
        "Consistency is crucial; ensure the soil is evenly moist but not soggy at any time.",
        "Reduce the frequency of watering during the winter months when growth naturally slows.",
        "Make sure the pot has good drainage to prevent root rot, a common issue if overwatered."
    ],
    "soil": [
        "Ficus Audrey prefers well-draining soil mixtures to prevent water accumulation around roots.",
        "A mix including peat moss, perlite, and pine bark enhances aeration and drainage.",
        "Regular potting soil can be amended with sand or perlite for improved drainage.",
        "Ensure the soil pH remains slightly acidic to neutral, which suits Ficus Audrey."
    ],
    "toxic": [
        "Ficus Audrey is toxic if ingested, especially to pets such as dogs and cats.",
        "Contact with the sap may cause skin irritation in sensitive individuals."
    ],
    "extra_care_tip": [
        "Regularly wipe the leaves with a damp cloth to remove dust and facilitate photosynthesis.",
        "Prune to maintain shape and remove dead or yellowing leaves to encourage growth."
    ]
}