{
    "name": "Ficus Tineke",
    "climate": [
        "Ficus Tineke thrives in tropical and subtropical climates, mimicking jungle conditions.",
        "It prefers warm environments with high humidity and consistent moisture.",
        "The plant is sensitive to cold temperatures and drafts, requiring indoor warmth.",
        "While it can adapt to temperate zones, consistent warmth enhances growth."
    ],
    "sunlight": [
        "Ficus Tineke prefers bright, indirect sunlight to thrive and maintain its color.",
        "Direct sunlight can scorch its leaves, so filtered light is ideal inside homes.",
        "It tolerates lower light but grows slower; optimal light keeps foliage vibrant.",
        "Avoid placing the plant in heavy shade to prevent leaf drop and poor health."
    ],
    "watering": [
        "Water Ficus Tineke when the top inch of soil is dry but avoid overwatering.",
        "It prefers regular watering during the growing season to support active growth.",
        "Reduce watering in the winter months when the plant's growth is slower.",
        "Overwatering can lead to root rot; it's crucial to let the soil dry out slightly."
    ],
    "soil": [
        "Ficus Tineke grows best in well-draining soil rich in organic matter and nutrients.",
        "A potting mix with peat, pine bark, and perlite helps maintain soil aeration.",
        "The soil should retain moisture without remaining saturated to prevent root issues.",
        "Re-pot with fresh soil every two years to replenish nutrients and promote growth."
    ],
    "toxic": [
        "Yes, Ficus Tineke is toxic to pets if ingested, causing irritation or vomiting.",
        "The sap contains compounds that can cause skin irritation in sensitive individuals."
    ],
    "extra_care_tip": [
        "Rotate the plant regularly to ensure even growth and prevent leaning toward light.",
        "Clean leaves periodically to remove dust, allowing the plant to photosynthesize efficiently."
    ]
}