{
    "name": "Fiddle-Leaf Fig",
    "climate": [
        "Fiddle-Leaf Figs thrive in warm and humid climates similar to their native tropical regions.",
        "They prefer environments where temperatures remain consistently between 60-75°F (15-24°C).",
        "This plant does not tolerate cold drafts and sudden temperature changes, making indoor growth ideal.",
        "High humidity levels benefit Fiddle-Leaf Figs, so maintain through misting or humidifiers."
    ],
    "sunlight": [
        "Fiddle-Leaf Figs require a good amount of bright, indirect sunlight to thrive.",
        "Direct sunlight for prolonged periods may scorch the leaves of a Fiddle-Leaf Fig.",
        "It's best to place them near a window with filtered light coming through a sheer curtain.",
        "Rotate the plant regularly to ensure all sides receive equal sunlight exposure and grow evenly."
    ],
    "watering": [
        "Fiddle-Leaf Figs prefer their soil to dry out somewhat between waterings to prevent root rot.",
        "Water thoroughly when the top inch of soil feels dry, typically once a week depending on conditions.",
        "In winter, reduce the frequency compared to summer, as the plant's growth slows down.",
        "Drainage is crucial—never let the plant sit in standing water as it can cause root damage."
    ],
    "soil": [
        "A well-draining potting mix is essential to keep the roots aerated and healthy.",
        "Soil containing some organic matter, such as peat or compost, ensures nutrients are available.",
        "Consider adding perlite or bark to the mix to improve drainage and prevent soil compaction.",
        "The pH level of the soil should ideally be kept between 6-7 for optimal growth conditions."
    ],
    "toxic": [
        "Fiddle-Leaf Figs are toxic to pets and humans, causing oral irritation if ingested.",
        "The sap can lead to skin irritation, so it's best to handle with care when pruning."
    ],
    "extra_care_tip": [
        "Dust the leaves regularly with a damp cloth to keep them clean and allow proper photosynthesis.",
        "Monitor for pests like spider mites and treat promptly if they appear to prevent infestations."
    ]
}