{
    "name": "Firespike",
    "climate": [
        "Firespike favors a warm and humid climate typical of tropical regions for optimal growth.",
        "This plant thrives in temperatures ranging from 60°F to 85°F, avoiding cold drafts.",
        "Humidity should be kept high, mirroring its native rainforest environments.",
        "Firespike does not tolerate frost; ensure temperatures remain above freezing."
    ],
    "sunlight": [
        "Firespike prefers bright, indirect sunlight, avoiding harsh direct sunlight exposure.",
        "It can tolerate some early morning or late afternoon sun without damage.",
        "For indoor growth, place near a window where it gets filtered light throughout the day.",
        "If the plant receives too little light, it may result in leggy growth and fewer blooms."
    ],
    "watering": [
        "Water the Firespike regularly to keep the soil consistently moist but not waterlogged.",
        "During the active growing season, increase watering frequency, reducing it in winter.",
        "Ensure adequate drainage in the pot to prevent root rot from excessive water accumulation.",
        "Monitor the plant's leaves for signs of wilting, adjusting watering habits accordingly."
    ],
    "soil": [
        "Plant the Firespike in well-draining, fertile soil rich in organic matter for best results.",
        "Alopeaty soil mix is ideal, allowing for moisture retention without becoming waterlogged.",
        "Ensure that the pH level of the soil remains neutral to slightly acidic for optimal growth.",
        "Improving soil with compost can provide additional nutrients and improve overall health."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune regularly to maintain bushy shape and remove any dead or diseased foliage promptly.",
        "Provide support or a trellis if the plant becomes leggy, to encourage upright growth.",
        "Fertilize monthly with a balanced, water-soluble fertilizer during the growing season.",
        "Repot every two years or when the plant outgrows its container to refresh the soil."
    ]
}