{
    "name": "Firepower Nandina",
    "climate": [
        "Firepower Nandina thrives best in temperate climates, with moderate winter temperatures.",
        "This plant is suitable for regions with mild winters and warm summers.",
        "Avoid planting in areas with extremely harsh winters or extremely hot summers.",
        "Best suited for USDA hardiness zones 6 to 10, where it can grow well."
    ],
    "sunlight": [
        "Requires full sun to partial shade, performing best in areas receiving good sunlight.",
        "Can tolerate some shade, but the foliage colors are more vibrant in sunny conditions.",
        "If planted in full shade, it may not develop its characteristic red color well.",
        "Four to six hours of sunlight daily is optimal for best growth and color."
    ],
    "watering": [
        "Firepower Nandina prefers well-drained soil and moderate watering to thrive.",
        "Water regularly during the first growing season to establish a deep, extensive root system.",
        "Once established, the plant is fairly drought-tolerant and needs less frequent watering.",
        "Avoid overwatering, as this can lead to root rot; allow the soil to dry out between waterings."
    ],
    "soil": [
        "Prefers acidic to neutral pH soils, which provide optimal growing conditions.",
        "Well-drained, loamy soil rich in organic matter is best for healthy growth.",
        "Avoid heavy clay soil that retains too much moisture, causing root issues.",
        "Can adapt to a variety of soil types, provided they are well-draining."
    ],
    "toxic": [
        "Firepower Nandina contains compounds that are toxic to pets, particularly berries.",
        "The plant's berries contain cyanogenic glycosides, which can be harmful if ingested.",
        "Keep pets and children away from the plant to avoid accidental ingestion.",
        "Symptoms of toxicity in animals include vomiting, diarrhea, and in severe cases, organ failure."
    ],
    "extra_care_tip": [
        "Prune in late winter or early spring to maintain the desired size and shape.",
        "Remove dead or damaged branches promptly to ensure healthy growth.",
        "Applying a balanced, slow-release fertilizer in spring can boost growth.",
        "Mulching can help retain moisture and protect roots in cooler climates."
    ]
}