{
    "name": "Fittonia",
    "climate": [
        "Fittonia thrive in warm, humid environments, typically found in tropical rainforests.",
        "They prefer temperatures between 60-85°F (16-30°C) to grow well.",
        "These plants are sensitive to cold drafts and sudden temperature changes.",
        "A humidity level of 60% or higher is ideal for Fittonia's optimal growth."
    ],
    "sunlight": [
        "Fittonia prefer indirect bright light and can tolerate low light conditions.",
        "Direct sunlight can scorch their leaves, so they should be shielded from harsh rays.",
        "In low light conditions, growth may slow, but the plant can still survive.",
        "Artificial fluorescent lighting can support Fittonia in spaces with limited natural light."
    ],
    "watering": [
        "Fittonia need consistent moisture; keep soil evenly and moderately moist.",
        "They are sensitive to drying out, so regular watering is essential to prevent wilting.",
        "Ensure excess water drains well as soggy soil can lead to root rot in Fittonia.",
        "During winter, reduce watering frequency but maintain sufficient humidity levels."
    ],
    "soil": [
        "Fittonia prefer well-draining soil, such as peat-based mix with perlite or sand.",
        "The soil should retain some moisture while preventing waterlogged conditions.",
        "A balanced potting mix for houseplants often works well for Fittonia plants.",
        "PH levels in the soil should ideally range from 6.5 to 7.0 for healthy growth."
    ],
    "toxic": [
        "Fittonia plants are generally non-toxic to humans and pets.",
        "Though classified as non-toxic, ingesting large amounts may cause minor digestive issues.",
        "Cats and dogs usually do not experience any adverse reactions to Fittonia.",
        "Always monitor pets around houseplants to prevent accidental ingestion."
    ],
    "extra_care_tip": [
        "Fittonia appreciate regular misting or placing near a humidifier for moisture.",
        "Avoid letting the soil completely dry out to prevent wilting foliage.",
        "Prune occasionally to remove dead leaves and keep the plant bushy.",
        "Group Fittonia with other plants to naturally increase humidity levels in the environment."
    ]
}