{
    "name": "Flamingo Willow",
    "climate": [
        "Flamingo Willow thrives in temperate climates with cool summers and mild winters.",
        "It's suitable for USDA hardiness zones 4 to 8, where temperatures remain moderate.",
        "This plant prefers areas with high humidity, common in coastal or riverine environments.",
        "Extreme heat or cold can damage the plant, so moderate climates are best."
    ],
    "sunlight": [
        "Flamingo Willow requires full sun for vibrant foliage colors throughout the season.",
        "It can tolerate partial shade, but growth may be less vigorous without ample sunlight.",
        "The plant benefits from morning sun, which helps to dry off dew on the leaves.",
        "Avoid deep shade as it can lead to leggy growth and dull leaf colorations."
    ],
    "watering": [
        "Regular watering is necessary to keep the soil consistently moist but not waterlogged.",
        "Flamingo Willow has a moderate drought tolerance but prefers consistent watering.",
        "During dry spells, increase frequency to prevent stress and leaf drop.",
        "Always water at the base and avoid overhead watering to prevent fungal diseases."
    ],
    "soil": [
        "The plant prefers well-drained, fertile soil enriched with organic matter like compost.",
        "Slightly acidic to neutral pH levels between 5.5 and 7.0 are optimal for growth.",
        "Poorly drained or heavy clay soils can lead to root rot and other issues.",
        "In containers, use a high-quality potting mix with good drainage capabilities."
    ],
    "toxic": [
        "Flamingo Willow is not known to be toxic to pets or humans, making it a safe choice."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain shape and promote vibrant new growth in spring.",
        "Mulching around the base helps retain moisture and suppress weeds effectively.",
        "Look out for common pests like aphids and use neem oil as an organic deterrent.",
        "Regularly check for signs of disease and apply fungicides if necessary."
    ]
}