{
    "name": "Florida Beauty",
    "climate": [
        "Florida Beauty grows well in tropical climates with warm temperatures.",
        "This plant thrives in areas with high humidity and moderate rainfall.",
        "It can be grown in subtropical areas where winters are mild and short.",
        "Florida Beauty does not tolerate frost and needs protection from cold."
    ],
    "sunlight": [
        "Florida Beauty prefers bright, indirect sunlight for optimal growth.",
        "Direct sunlight can be harmful, as it may scorch the leaves of the plant.",
        "Partially shaded areas that receive filtered sunlight are ideal locations.",
        "In low light conditions, growth may slow, but the plant can still survive."
    ],
    "watering": [
        "Water regularly to keep the soil consistently moist but not waterlogged.",
        "During the growing season, increase frequency to support active growth.",
        "Reduce watering in winter to prevent root rot, allowing soil to dry slightly.",
        "Ensure good drainage to avoid standing water, which can lead to plant issues."
    ],
    "soil": [
        "Florida Beauty requires well-draining soil rich in organic matter for growth.",
        "A soil mix with peat, perlite, and sand will help simulate ideal conditions.",
        "The soil should retain moisture yet allow excess water to drain efficiently.",
        "Ensure soil pH is slightly acidic to neutral, as this supports healthy growth."
    ],
    "toxic": [
        "Florida Beauty is considered toxic to pets if ingested, causing irritation.",
        "The plant contains saponins, making it harmful to cats and dogs when eaten."
    ],
    "extra_care_tip": [
        "Regularly dust leaves with a damp cloth to maintain leaf health and shine.",
        "Provide occasional misting to boost humidity, especially in dry indoors.",
        "Prune as needed to remove dead or damaged leaves and promote new growth.",
        "Repot every couple of years to refresh soil and accommodate root expansion."
    ]
}