{
    "name": "Flowering Tobacco",
    "climate": [
        "Flowering tobacco thrives in temperate climates where frost is minimal.",
        "It can be grown in regions with warm summers and mild winters.",
        "This plant prefers a stable climate and can struggle with extreme cold.",
        "It is suitable for USDA hardiness zones 10 and above, where it flourishes."
    ],
    "sunlight": [
        "Flowering tobacco prefers full sun but can tolerate partial shade.",
        "It grows best in areas that receive around six hours of sunlight daily.",
        "If grown in too much shade, the plant may not bloom as profusely.",
        "For optimal growth, morning sun and afternoon shade are recommended."
    ],
    "watering": [
        "Flowering tobacco requires regular watering, especially in dry spells.",
        "The soil should be kept consistently moist but not waterlogged.",
        "It is important to water at the base to avoid wetting the leaves.",
        "Mulching can help retain soil moisture and reduce watering frequency."
    ],
    "soil": [
        "Flowering tobacco grows well in fertile, well-drained soil.",
        "A sandy loam soil is ideal for its root development and health.",
        "It thrives in soil with a neutral to slightly acidic pH level.",
        "Amending soil with organic matter can improve its growth conditions."
    ],
    "toxic": [
        "Flowering tobacco is toxic if ingested, causing nausea and vomiting.",
        "All parts of the plant contain alkaloids that are harmful to pets.",
        "Handling the plant with bare hands can cause irritation in some cases.",
        "Keep away from children and pets to prevent accidental consumption."
    ],
    "extra_care_tip": [
        "Deadhead the spent flowers to encourage continuous blooming.",
        "Pests such as aphids can be managed using insecticidal soap sprays.",
        "Avoid planting near vegetables as toxins can affect their growth.",
        "Pinching back young plants can promote bushier growth and more flowers."
    ]
}