{
    "name": "Flowering Crabapple",
    "climate": [
        "Flowering crabapples thrive in temperate climates with cold winters essential for bud formation.",
        "They tolerate humidity but are susceptible to diseases in excessively moist environments.",
        "These trees prefer environments where they can experience full seasonal changes.",
        "Cold hardiness is critical, and they grow well in USDA zones 4 through 8."
    ],
    "sunlight": [
        "Flowering crabapples require full sunlight for at least six hours daily to bloom optimally.",
        "Partial shade is tolerated, but too little sun will result in poor blooming performance.",
        "A location with morning sun and afternoon shade can reduce disease risk from moisture.",
        "Avoid completely shaded areas, as they may lead to legginess and reduced flowering."
    ],
    "watering": [
        "Crabapples require consistent watering during the first year, especially in dry spells.",
        "Established trees are drought-tolerant but thrive with moderate moisture levels.",
        "Proper drainage is essential; avoid waterlogged soil to prevent root rot.",
        "Monitor rainfall and water deeply but infrequently for mature trees to encourage deep roots."
    ],
    "soil": [
        "Well-drained loamy soil with a pH of 6.0 to 7.5 is ideal for flowering crabapples.",
        "They can tolerate a range of soil types, including clay, if drainage is adequate.",
        "Avoid overly rich soil compositions that can lead to excessive leafy growth.",
        "Amending soil with organic matter can improve its structure and fertility."
    ],
    "toxic": [
        "Flowering crabapple seeds contain cyanogenic compounds toxic to pets if ingested in large quantities."
    ],
    "extra_care_tip": [
        "Prune crabapples in late winter to early spring before new growth to maintain shape and health.",
        "Regularly check for signs of apple scab and other diseases; consider fungicidal treatments if needed."
    ]
}