{
    "name": "French Marigold",
    "climate": [
        "French Marigolds thrive in warm, temperate climates, thriving best in conditions that mimic Mediterranean climates.",
        "They can tolerate a range of conditions but prefer climates with plenty of warmth and sunlight for optimal growth.",
        "These plants are generally hardy and can be grown in both humid and semi-arid environments successfully.",
        "While tolerant of heat, they do not do well in extreme cold and must be protected from frost."
    ],
    "sunlight": [
        "French Marigolds require full sun exposure, meaning they need at least six to eight hours of direct sunlight daily.",
        "They can tolerate partial shade but bloom more profusely when they receive ample sunlight throughout the day.",
        "In areas with extremely hot summers, some afternoon shade can help protect the plants from scorching.",
        "Consistent and direct sunlight helps the plant to develop strong, vibrant flowers and healthy foliage."
    ],
    "watering": [
        "Regular watering is essential, but French Marigolds do not like to be overwatered; the soil should be kept moist but not soggy.",
        "Allow the top inch of soil to dry out between waterings to prevent root rot, adapting frequency based on climate.",
        "In particularly dry or hot climates, they may require more frequent watering to remain hydrated and healthy.",
        "Water deeply and less frequently rather than giving little amounts often to promote strong root growth."
    ],
    "soil": [
        "They thrive in well-draining soil rich in organic matter; ideal soil is slightly acidic to neutral in pH.",
        "Sandy or loamy soil is ideal as it provides good drainage, preventing water-logged roots.",
        "Adding compost or aged manure will enhance soil fertility, encouraging healthy plant growth and bloom.",
        "Avoid heavy clay soils unless amended to improve drainage, as French Marigolds are prone to root issues in compacted soils."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Remove dead and spent flowers regularly; this deadheading encourages continuous blooming throughout the season.",
        "Watch for slugs and snails, especially in damp conditions, as they can damage plants; use eco-friendly slug repellents.",
        "Companion planting with vegetables can help deter pests naturally, utilizing the Marigold’s natural properties.",
        "If the plants become leggy or sparse, pinching them back can promote bushier and more robust growth."
    ]
}