{
    "name": "Gardenia",
    "climate": [
        "Gardenias thrive in tropical and subtropical climates that provide warmth and humidity.",
        "They require a stable environment with temperatures between 65째F to 75째F (18째C to 24째C).",
        "Frost or cold temperatures can damage gardenias, so they need protection during winter.",
        "They prefer environments where the humidity levels are high to mimic their native conditions."
    ],
    "sunlight": [
        "Gardenias need bright, indirect sunlight to bloom well, avoiding harsh midday sun.",
        "They're best grown in locations where they can receive morning sun and afternoon shade.",
        "Too much direct sunlight can lead to leaf scorch, while too little can hinder flowering.",
        "Ideally, a spot with filtered light or semi-shade is perfect for healthy growth."
    ],
    "watering": [
        "Regular watering is essential; soil should remain consistently moist but not soggy.",
        "Wilting leaves may indicate underwatering, while yellow leaves may suggest overwatering.",
        "Use tepid water to prevent root shock, especially during the growing season.",
        "High humidity is beneficial, so frequent misting can help maintain adequate moisture."
    ],
    "soil": [
        "Gardenias require well-draining, acidic soil rich in organic matter for optimum growth.",
        "A pH range between 5.0 and 6.0 is ideal for ensuring nutrient availability.",
        "Amend soil with peat moss or pine bark to maintain acidity and improve drainage.",
        "Ensure soil has good aeration and retains moisture without waterlogging the roots."
    ],
    "toxic": [
        "Gardenias are generally safe but can cause mild gastrointestinal distress if ingested.",
        "The sap may cause skin irritation in sensitive individuals when handled."
    ],
    "extra_care_tip": [
        "Prune gardenias after flowering to maintain shape and encourage bushy growth.",
        "Remove dead or diseased wood and faded flowers to prevent fungal infections.",
        "Use a balanced, slow-release fertilizer formulated for acid-loving plants.",
        "Monitor for pests like aphids and scale; treat them early to prevent infestation."
    ]
}