{
    "name": "Geraniums",
    "climate": [
        "Geraniums thrive in temperate climates where temperatures are moderate.",
        "They can tolerate mild frost but prefer climates without extreme cold.",
        "Geraniums grow well in climates with warm, sunny days and cool nights.",
        "Avoid regions with excessively humid or rainy climate conditions."
    ],
    "sunlight": [
        "Geraniums require full sun to flourish, needing at least six hours of direct sunlight.",
        "Partial shade can be tolerated, particularly in hotter climates to prevent leaf scorch.",
        "Ensure they receive abundant morning sunlight and some afternoon shade when it's hot.",
        "Insufficient sunlight can lead to poor flowering and spindly plant growth."
    ],
    "watering": [
        "Water geraniums thoroughly, but allow the soil to dry out between waterings.",
        "Overwatering can cause root rot, so ensure proper drainage is present.",
        "During warmer periods, geraniums may need more frequent watering.",
        "Reduce watering during winter as geraniums are dormant and need less moisture."
    ],
    "soil": [
        "Geraniums prefer well-draining soil to avoid waterlogging and root rot.",
        "A mix of potting soil with perlite or sand improves drainage for geraniums.",
        "Soil should be rich in organic matter to provide necessary nutrients.",
        "Slightly acidic to neutral soil pH is optimal for healthy geranium growth."
    ],
    "toxic": [
        "Geraniums can be mildly toxic to pets if ingested, causing stomach upset.",
        "Signs of toxicity in pets include vomiting, loss of appetite, or lethargy."
    ],
    "extra_care_tip": [
        "Pinching back stems encourages bushier growth and more blooms in geraniums.",
        "Deadhead spent flowers regularly to promote continuous blooming for longer periods.",
        "In colder climates, bring the geraniums indoors or keep in a greenhouse during winter.",
        "Apply balanced fertilizer every four to six weeks during the growing season."
    ]
}