{
    "name": "Ginseng Ficus",
    "climate": [
        "Thrives in warm temperatures, ideally between 60-75°F (15-24°C) throughout the day.",
        "Cannot tolerate frost; should be kept indoors or in a heated environment during winter months.",
        "Prefers a humid climate, though it can adapt to moderate household humidity levels.",
        "Tends to grow best in climates that do not experience extreme cold or dry air conditions."
    ],
    "sunlight": [
        "Requires bright, indirect sunlight, which mimics the light of its native tropical environments.",
        "Should be kept away from direct afternoon sun to prevent leaf scorching and damage.",
        "Can tolerate lower light levels, but growth may be slower and less robust as a result.",
        "Rotate the plant regularly to ensure even growth and exposure to sunlight across foliage."
    ],
    "watering": [
        "Water when the top inch of soil dries out, typically once a week or as needed.",
        "Ensure proper drainage by emptying standing water from saucers to prevent root rot.",
        "Reduce watering frequency during the plant’s dormant winter period significantly.",
        "Check the soil moisture consistently to avoid both overwatering and underwatering."
    ],
    "soil": [
        "Grows best in well-draining potting mix, often a blend of peat, pine bark, and coarse sand.",
        "Soil should retain some moisture but also provide adequate aeration for healthy roots.",
        "Avoid soil mixes that are too dense or compacted, which can lead to waterlogging issues.",
        "Repotting with fresh soil every couple of years can help maintain necessary nutrients."
    ],
    "toxic": [
        "The sap of the Ginseng Ficus is toxic to pets and may cause mild irritation if ingested.",
        "Symptoms in pets can include drooling, vomiting, and oral discomfort due to irritation."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain desired shape and remove any dead or damaged leaves.",
        "Misting the leaves occasionally can help to mimic humidity levels of its native habitat."
    ]
}