{
    "name": "Goat Willow",
    "climate": ["Goat Willow thrives in temperate climates and is well-suited for regions with moderate temperatures.", "This plant can withstand cold conditions and is often found in northern climates.", "It prefers areas with regular rainfall as it naturally grows near water bodies.", "Goat Willow can tolerate a wide range of climates but grows best in wet, cool regions."],
    "sunlight": ["Goat Willow prefers full sunlight for optimal growth and thrives when receiving six or more hours of direct sunlight.", "Although it can handle partial shade, full sun exposure helps it develop a healthier structure.", "In shady areas, Goat Willow may grow but will likely exhibit slower growth rates.", "To achieve maximum vigor, place Goat Willow in an area with abundant direct sunlight."],
    "watering": ["Regular watering is important for young and newly planted Goat Willows, especially in dry conditions.", "Established Goat Willows need less frequent watering but still appreciate consistent soil moisture.", "During drought conditions, additional watering will benefit the plant's health and growth.", "Watering should ensure that the soil remains consistently damp without becoming waterlogged."],
    "soil": ["Goat Willow grows best in rich, loamy soils that provide sufficient nutrients and drainage.", "It can tolerate heavier clay soils as long as there is adequate drainage to prevent waterlogging.", "The plant thrives in moist to wet soils often found near riverbanks and wetlands.", "For best results, ensure soil is consistently moist but not overly saturated with water."],
    "toxic": [],
    "extra_care_tip": ["Pruning Goat Willow in late winter can help shape the plant and encourage strong growth.", "Mulching around the base can help retain soil moisture and regulate temperature conditions.", "If grown near water bodies, monitor for any signs of flooding or water stagnation.", "Regularly check for pests such as aphids and caterpillars, which can affect its health."]
}