{
    "name": "Greek Valerian",
    "climate": [
        "Greek Valerian prefers temperate climates with mild temperatures and not extreme weather.",
        "This plant thrives in areas where there is consistent rainfall and moderate humidity levels.",
        "Avoid very hot or desert-like climates as they may cause stress to the plant.",
        "It can tolerate cold climates but severe frost might damage the plant."
    ],
    "sunlight": [
        "Greek Valerian thrives best in partial shade where it can get some sunlight but not direct harsh rays.",
        "It can tolerate full sun for parts of the day but benefits from some protection during peak sun hours.",
        "Indirect sunlight is ideal, especially in hotter climates, to prevent the leaves from scorching.",
        "Avoid placing this plant in deep shade, as insufficient light may hinder its blooming process."
    ],
    "watering": [
        "Water Greek Valerian regularly, ensuring the soil remains consistently moist but not waterlogged.",
        "This plant prefers consistent moisture levels; keep the soil evenly damp, watering more in dry spells.",
        "In colder months, reduce watering frequency, allowing the soil surface to dry out slightly between waterings.",
        "Never let the plant sit in waterlogged soil as it can lead to root rot and other diseases."
    ],
    "soil": [
        "Greek Valerian prefers well-drained, rich, and loamy soil that retains moisture well without becoming soggy.",
        "Enriching the soil with organic matter like compost will promote healthier growth and flowering.",
        "The soil's pH should be neutral to slightly acidic to meet the plant's growing requirements.",
        "Ensure the soil is loose to allow easy root penetration and good drainage to avoid water accumulation."
    ],
    "toxic": [
        "Greek Valerian is not considered toxic to humans or pets, making it a safe choice for gardens."
    ],
    "extra_care_tip": [
        "Deadhead spent flowers to encourage prolonged blooming and maintain plant tidiness."
    ]
}