{
    "name": "Heartleaf Philodendron",
    "climate": [
        "Heartleaf Philodendrons thrive in tropical and subtropical climates, where humidity is high.",
        "These plants prefer warm temperatures ranging from 65°F to 80°F for optimal growth.",
        "They do best in conditions where temperatures do not drop below 55°F to avoid stress.",
        "Maintaining humidity around the plant will give it the feel of its native tropical environment."
    ],
    "sunlight": [
        "Heartleaf Philodendrons prefer bright, indirect sunlight for healthy growth.",
        "They can tolerate low light but their growth rate may slow down significantly.",
        "Avoid placing them in direct sunlight as it can scorch and damage the leaves.",
        "Fluorescent light can also be suitable if natural light is insufficient in a room."
    ],
    "watering": [
        "Water the Heartleaf Philodendron when the top inch of soil feels dry to the touch.",
        "Overwatering can be harmful; ensure that the plant container has proper drainage.",
        "In winter, reduce the watering frequency to prevent water from sitting in the soil.",
        "Misting can help increase humidity but avoid wetting leaves excessively often."
    ],
    "soil": [
        "Use a well-draining potting mix, such as one designed for tropical houseplants.",
        "A mix containing peat moss, perlite, and vermiculite will support healthy roots.",
        "Avoid heavy soils that retain too much moisture, leading to root rot issues.",
        "A pH level slightly acidic to neutral works well for Heartleaf Philodendron."
    ],
    "toxic": [
        "Heartleaf Philodendron is toxic if ingested by pets or humans, causing stomach issues.",
        "It contains calcium oxalate crystals that can irritate the mouth and digestive tract.",
        "Ensure that the plant is placed out of reach of children and animals in the home.",
        "Seek medical advice if ingestion occurs and causes significant discomfort or pain."
    ],
    "extra_care_tip": [
        "Regularly dust the leaves to ensure they can photosynthesize effectively.",
        "Prune any yellowing or dead leaves to encourage new growth and maintain its shape.",
        "Consider using a support structure if the plant starts to vine and grow extensively.",
        "Repot the plant every couple of years or when roots outgrow the current container."
    ]
}