{
    "name": "Heirloom Tomato",
    "climate": [
        "Heirloom tomatoes thrive in warm climates with temperatures ranging from 70°F to 85°F for optimal growth.",
        "These plants require a frost-free period of at least 100 days to produce healthy, ripe fruit.",
        "In cooler climates, it's essential to use greenhouses or other protection to extend the growing season.",
        "Humidity levels need to be moderate; too much moisture may lead to fungal diseases."
    ],
    "sunlight": [
        "Heirloom tomatoes need full sunlight for at least six to eight hours a day for the best fruit production.",
        "Insufficient sunlight can result in leggy plants and reduced fruit yield.",
        "Position the plants in a south-facing location to maximize their exposure to sunlight.",
        "Shaded conditions will inhibit their growth and may cause poor fruit development."
    ],
    "watering": [
        "Heirloom tomatoes require consistent, deep watering to maintain even soil moisture throughout their growing season.",
        "Water at the base of the plant to avoid moisture on the leaves, which can lead to diseases.",
        "Soil should be kept moist but not waterlogged, which can cause root rot and other issues.",
        "Drip irrigation systems are optimal for conserving water and ensuring even distribution."
    ],
    "soil": [
        "The ideal soil for heirloom tomatoes is well-draining and rich in organic matter to provide necessary nutrients.",
        "A pH level of 6.0 to 6.8 is best for maximizing nutrient uptake and plant health.",
        "Heavy clay soils should be amended with compost or sand to improve drainage and aeration.",
        "Regular soil testing is recommended to identify nutrient deficiencies and amend accordingly."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Support heirloom tomato plants with stakes or cages to prevent them from collapsing under the weight of the fruit.",
        "Rotate crops annually to prevent soil-borne diseases and maintain soil fertility."
    ]
}