{
    "name": "Heliconia",
    "climate": [
        "Heliconia thrives in tropical and subtropical climates with high humidity and warm temperatures.",
        "These plants prefer a climate with consistent warmth, avoiding colder temperatures below 50°F (10°C).",
        "A stable climate without extreme temperature variations is ideal for Heliconia growth.",
        "They flourish in climates with adequate rainfall, providing the moisture they need to grow well."
    ],
    "sunlight": [
        "Heliconia plants grow best in full sun, though they can tolerate partial shade.",
        "A bright environment with ample sunlight encourages vibrant flowering and healthy growth.",
        "Direct sunlight for most of the day is beneficial, but protection from the harshest midday sun in very hot regions is advisable.",
        "While adaptable to some shade, insufficient light may lead to reduced flowering and growth vigor."
    ],
    "watering": [
        "Heliconia requires regular watering to maintain moist but not waterlogged soil conditions.",
        "Consistent soil moisture is important, especially during the plant's growing season in warmer months.",
        "Avoid letting the plant dry out completely between waterings to prevent stress.",
        "In regions with lower rainfall, supplemental irrigation may be necessary to meet moisture needs."
    ],
    "soil": [
        "Well-draining, rich, organic soil is ideal to support Heliconia's nutritional requirements.",
        "The soil should retain moisture while providing adequate drainage to prevent root rot.",
        "Amending the soil with compost or organic matter can enhance fertility and structure.",
        "A slightly acidic to neutral pH level of soil helps optimize nutrient availability for Heliconia."
    ],
    "toxic": [
        "Heliconia is generally non-toxic to humans and pets, making it safe for gardens."
    ],
    "extra_care_tip": [
        "Heliconia may require support stakes to keep tall varieties upright during windy conditions."
    ]
}