{
    "name": "Hindu Rope Plant",
    "climate": [
        "The Hindu Rope Plant thrives in warm and humid environments typical of tropical regions.",
        "It prefers temperatures between 60-80°F and cannot tolerate frost or cold conditions.",
        "High humidity is beneficial, and it does well in environments above 40% humidity.",
        "This plant is best suited for indoor climates or outdoors in USDA zones 10-11."
    ],
    "sunlight": [
        "Hindu Rope Plant needs bright, indirect sunlight for optimal growth.",
        "Direct sunlight can scorch its leaves, so it should be shielded from harsh sunlight.",
        "It can adapt to lower light conditions but may grow more slowly in such environments.",
        "Placing it near an east or north-facing window provides ideal light conditions."
    ],
    "watering": [
        "Water Hindu Rope Plant sparingly, allowing the soil to dry out between waterings.",
        "Overwatering can lead to root rot, which is a common issue with this plant.",
        "Depending on conditions, watering every two to three weeks is usually sufficient.",
        "During winter months, reduce watering frequency as the plant’s growth slows down."
    ],
    "soil": [
        "Well-draining soil is essential to prevent water accumulation at the roots.",
        "A cactus or succulent potting mix works well as it allows good air circulation.",
        "Avoid heavy soils that retain water, as they can lead to root health issues.",
        "For optimal results, mixing perlite or pumice into standard potting soil enhances drainage."
    ],
    "toxic": [
        "Hindu Rope Plant is non-toxic to cats, dogs, and humans, making it a safe houseplant option."
    ],
    "extra_care_tip": [
        "Prune occasionally to maintain shape and remove any dead or unhealthy stems.",
        "Fertilize during the growing season with a balanced, water-soluble fertilizer diluted to half strength.",
        "Repotting is typically needed only every few years, as the plant grows best when slightly pot-bound."
    ]
}