{
    "name": "Holiday Cactus",
    "climate": [
        "Thrives in mild to warm climates and prefers temperatures between 60-70°F.",
        "Can adapt to slightly cooler climates but should not be exposed to frost or freezing.",
        "Does best in a household environment where temperatures remain relatively stable.",
        "Avoid placing near cold drafts or sources of heat like radiators or heaters."
    ],
    "sunlight": [
        "Requires bright, indirect light and should be shielded from direct sunlight.",
        "Direct sunlight can scorch the leaves, so filtered light is recommended.",
        "During summer, diffuse sunlight or shade from other plants works well.",
        "East or north window exposures are ideal to provide consistent light."
    ],
    "watering": [
        "Keep the soil evenly moist, but allow it to dry out slightly between waterings.",
        "Overwatering can lead to root rot, so ensure good drainage is provided.",
        "Reduce watering during its dormant period after flowering, usually in winter.",
        "Increased humidity will benefit the plant, mimicking its natural environment."
    ],
    "soil": [
        "Prefers well-draining soil, such as a cactus or succulent potting mix.",
        "A mix of potting soil, perlite, and sand helps provide necessary aeration.",
        "Ensure the soil retains moisture without becoming boggy or waterlogged.",
        "Repotting every couple of years helps refresh the soil's nutrients for it."
    ],
    "toxic": [
        "Non-toxic to pets such as cats and dogs, making it a safe houseplant choice."
    ],
    "extra_care_tip": [
        "Encourage blooming by providing eight weeks of cooler nighttime temperatures.",
        "Reduce water intake gradually after blooming until new growth starts again.",
        "Pruning after blooming can help maintain the desired shape and encourage growth.",
        "Repot after flowering season to boost healthy resource uptake for next cycle."
    ]
}