{
    "name": "Hoya Rosita",
    "climate": [
        "Hoya Rosita thrives in a warm, tropical climate similar to its native habitat. It prefers temperatures between 60-85째F (15-30째C).",
        "This plant does not tolerate frost or extreme cold, and should be protected from temperatures below 50째F (10째C).",
        "High humidity levels, around 60-80%, are ideal, mimicking the plant's natural rainforest environment.",
        "It can adapt to indoor conditions with proper care, but will flourish in environments that replicate tropical climates."
    ],
    "sunlight": [
        "Hoya Rosita requires bright, indirect sunlight to grow and bloom optimally. Direct sunlight can damage the leaves.",
        "The plant can tolerate some direct sun, especially during the early mornings or late afternoons, but not during peak hours.",
        "If grown indoors, placing it near an east or west-facing window that filters light can provide ideal conditions.",
        "Too little light will hinder its blooming. Artificial grow lights can supplement natural light if needed."
    ],
    "watering": [
        "Water Hoya Rosita moderately, allowing the top inch of soil to dry out between waterings. Overwatering can lead to root rot.",
        "During the growing season in spring and summer, water more frequently to support active growth phases.",
        "In fall and winter, reduce watering as the plant's growth slows. Ensure water drainage to prevent soggy soil.",
        "Consistent moisture is key, as prolonged drought or overwatering can stress the plant, affecting its health."
    ],
    "soil": [
        "This plant prefers a well-draining soil mix, such as a combination of orchid bark, perlite, and peat moss.",
        "A chunky, airy soil mix ensures adequate airflow to the roots and avoids water retention that can cause rot.",
        "Commercially available cactus or orchid mix can work well when lightly amended with organic matter.",
        "The soil should ideally maintain slight moisture while allowing excess water to drain freely to avoid saturation."
    ],
    "toxic": ["Hoya Rosita is considered toxic to pets due to compounds that can cause mild irritation if ingested."],
    "extra_care_tip": ["Regularly clean the leaves to prevent dust buildup, which can hinder photosynthesis and attract pests."]
}