{
    "name": "Hoya Kerrii",
    "climate": [
        "Hoya Kerrii thrives in warm, humid climates similar to tropical regions.",
        "It prefers temperatures between 65°F and 80°F for optimal growth.",
        "This plant does not tolerate cold well and should be kept above 50°F at all times.",
        "High humidity levels are ideal, resembling their native Southeast Asian environment."
    ],
    "sunlight": [
        "Hoya Kerrii needs bright, indirect light to grow optimally indoors.",
        "Direct sunlight can scorch the leaves, so it should be avoided.",
        "Artificial grow lights can supplement sunlight, especially in winter months.",
        "It can tolerate some low light conditions but will grow slowly."
    ],
    "watering": [
        "Allow the soil to dry out between waterings to prevent root rot.",
        "In spring and summer, water more frequently, but do not overwater.",
        "In fall and winter months, reduce frequency as the plant's growth pace slows.",
        "Ensure good drainage to keep roots from sitting in water, which can be harmful."
    ],
    "soil": [
        "A well-draining potting mix with good aeration is ideal for Hoya Kerrii.",
        "Use a mix designed for succulents or cacti, containing perlite or orchid bark.",
        "Avoid heavy potting soils that retain water and can suffocate roots.",
        "A light, aerated soil helps prevent the complications of overwatering."
    ],
    "toxic": [
        "Hoya Kerrii is considered non-toxic, but ingestion by pets may cause mild stomach upset.",
        "Keep the plant out of reach of curious pets to ensure it remains undamaged.",
        "The plant's sap could cause slight skin irritation to sensitive individuals.",
        "While non-toxic, it is always best to prevent ingestion by pets and children."
    ],
    "extra_care_tip": [
        "Rotate Hoya Kerrii occasionally to ensure even light exposure and growth.",
        "Clean leaves regularly with a damp cloth to remove dust and allow for better photosynthesis.",
        "During the growing season, a diluted, balanced liquid fertilizer can be applied monthly.",
        "If propagating, cut a leaf with at least a small piece of stem attached for best results."
    ]
}