{
    "name": "Hoya Wayetii",
    "climate": [
        "Hoya Wayetii thrives in a warm and humid environment, mimicking its natural tropical habitat.",
        "It is essential for the plant to avoid temperatures dropping below 50°F (10°C) for optimal growth.",
        "The plant can tolerate indoor conditions but prospers in temperatures between 60°F-80°F (15°C-27°C).",
        "High humidity levels are beneficial, and misting the plant can help maintain the necessary moisture."
    ],
    "sunlight": [
        "Hoya Wayetii prefers bright, indirect sunlight, similar to dappled sunlight in its native habitat.",
        "Direct sunlight can scorch the leaves, so it is crucial to protect the plant from harsh rays.",
        "Place the plant near an east or north-facing window for optimal light conditions throughout the day.",
        "If natural light is insufficient, fluorescent grow lights can help provide the necessary brightness."
    ],
    "watering": [
        "Water thoroughly when the top inch of soil feels dry, ensuring excess water drains out properly.",
        "Avoid letting the plant sit in water to prevent root rot, as it prefers to dry out slightly between waterings.",
        "During the winter months, reduce watering frequency to accommodate the plant's lower growth rate.",
        "Use lukewarm water to avoid shocking the plant, and consider using distilled water if tap water is hard."
    ],
    "soil": [
        "A well-draining potting mix is essential for Hoya Wayetii, preventing waterlogging and root rot.",
        "Consider using a mix designed for epiphytic plants, which typically includes orchid bark and perlite.",
        "Incorporating some peat or coco coir can help retain moisture without overly dampening the roots.",
        "Ensure the pot has drainage holes to allow excess water to escape, maintaining optimal soil conditions."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune dead or unhealthy stems to encourage new growth and maintain the plant's shape.",
        "Feed with a balanced liquid fertilizer every 4-6 weeks during the growing season for best results."
    ]
}