{
    "name": "Hydrangea",
    "climate": [
        "Hydrangeas thrive in temperate climates with mild summers and winters.",
        "Regions with higher humidity levels are generally better for Hydrangeas.",
        "They prefer climates where temperatures do not drop too low in winter.",
        "Avoid extremely hot and dry climates, which can stress the plants."
    ],
    "sunlight": [
        "Hydrangeas usually prefer partial shade to full sun; however, full sun is tolerable.",
        "In areas with hot summers, morning sun with afternoon shade is ideal.",
        "Full shade can lead to reduced flowering and leggy growth in Hydrangeas.",
        "Direct, intense afternoon sun in hot regions can scorch Hydrangea leaves."
    ],
    "watering": [
        "Regular watering is essential to keep the soil consistently moist for Hydrangeas.",
        "In the heat of summer, daily watering may be necessary in well-draining soil.",
        "Hydrangeas are sensitive to drought, so it's important not to let them dry out.",
        "Overwatering, which can lead to root rot, should still be avoided with careful balance."
    ],
    "soil": [
        "Hydrangeas prefer rich, well-draining soil to prevent root waterlogging.",
        "Soil pH can affect bloom color; acidic soils may produce blue flowers.",
        "Loamy soil enriched with organic matter supports healthy growth in Hydrangeas.",
        "Soil should retain moisture but also allow for adequate aeration of the roots."
    ],
    "toxic": [
        "Hydrangeas are toxic to pets, including cats and dogs, if ingested.",
        "They contain cyanogenic glycosides that can release cyanide when digested.",
        "Symptoms of toxicity include vomiting, diarrhea, and lethargy in pets.",
        "It's important to keep pets from chewing or eating Hydrangea plant parts."
    ],
    "extra_care_tip": [
        "To increase flower production, prune Hydrangeas in early spring before new growth.",
        "Mulching around the base helps retain moisture and regulate soil temperature.",
        "In colder climates, protect Hydrangeas with a thick layer of mulch during winter.",
        "Adjust soil pH to change bloom colors; aluminum sulfate makes flowers blue."
    ]
}