{
    "name": "Imperial Red Philodendron",
    "climate": [
        "Imperial Red Philodendron grows best in a climate where temperature levels do not drop below 55°F (13°C).",
        "It is important to maintain a humid environment, typically between 60% to 80% humidity.",
        "These plants thrive in a tropical or subtropical climate simulating rainforests.",
        "Avoid placing the plant in cold or dry climates as it can affect growth and health."
    ],
    "sunlight": [
        "Imperial Red Philodendron prefers bright, indirect sunlight for optimal growth.",
        "Direct sunlight can scorch the leaves, so it should be avoided at all costs.",
        "These plants can tolerate low light conditions, but growth may be slower.",
        "If indoors, a location near a window with filtered light is ideal."
    ],
    "watering": [
        "Water Imperial Red Philodendron when the top inch of soil feels dry to the touch.",
        "Ensure proper drainage to prevent waterlogging, which can lead to root rot.",
        "In warmer months, watering frequency may increase compared to cooler months.",
        "Using distilled or rainwater helps prevent mineral build-up in the soil."
    ],
    "soil": [
        "The ideal soil mix is well-draining, incorporating peat, perlite, and pine bark.",
        "Soil should retain some moisture but not become compacted or stay soggy.",
        "A pH level between 5.5 and 6.5 is preferred for optimal nutrient absorption.",
        "Re-potting every two years with fresh soil ensures healthy growth and root development."
    ],
    "toxic": [
        "The Imperial Red Philodendron is toxic to pets and humans if ingested.",
        "It contains calcium oxalate crystals, which can cause irritation and swelling."
    ],
    "extra_care_tip": [
        "Wipe leaves with a damp cloth occasionally to keep them dust-free.",
        "Consider providing a moss pole or trellis for support as it grows.",
        "Keep away from drafts, air-conditioners, and heaters to prevent stress.",
        "Monitor the plant regularly for pests such as aphids and spider mites."
    ]
}