{
    "name": "Indian Hawthorn",
    "climate": [
        "Indian Hawthorn thrives in mild, temperate climates where frost is rare.",
        "This plant grows best in regions with distinct hot, dry summers and cool winters.",
        "It can tolerate a range of climates but prefers areas without severe cold weather.",
        "Though adaptable, Indian Hawthorn does best in warm, sunny climates with mild winters."
    ],
    "sunlight": [
        "Indian Hawthorn requires full sun for most of the day to produce abundant flowers.",
        "This plant can tolerate partial shade but performs best in sunlight for at least 6 hours daily.",
        "Too much shade can result in leggy growth and reduced flowering of the plant.",
        "It is important for Indian Hawthorn to receive ample sunlight for optimal health and appearance."
    ],
    "watering": [
        "Water Indian Hawthorn regularly, especially during the first growing season for root establishment.",
        "Once established, it has moderate drought tolerance, but benefits from occasional deep watering.",
        "Avoid overwatering as it prefers well-drained soil and can be susceptible to root rot.",
        "During extremely dry conditions, additional watering will help maintain plant vitality."
    ],
    "soil": [
        "Indian Hawthorn grows well in well-drained soils rich in organic matter to thrive.",
        "It can adapt to various soil types but prefers sandy, loamy soils for proper growth.",
        "Avoid planting in heavy clay soils which can retain excess water and harm the roots.",
        "Amending soil with compost can improve drainage and provide essential nutrients."
    ],
    "toxic": [
        "Indian Hawthorn berries are mildly toxic if consumed in large quantities by pets and humans."
    ],
    "extra_care_tip": [
        "Prune Indian Hawthorn after flowering to maintain its shape and encourage new growth.",
        "Regular pruning also helps improve air circulation, reducing disease risks."
    ]
}