{
    "name": "Indian Paintbrush",
    "climate": [
        "Indian Paintbrush thrives in temperate climates and prefers cool temperatures.",
        "It can be found in regions with cold winters and mild summers.",
        "This plant is adapted to environments with distinct seasonal changes.",
        "It grows best in locations where temperatures are not excessively hot or cold."
    ],
    "sunlight": [
        "This plant requires full sunlight for optimal growth and vibrant blooms.",
        "Partial shade can be tolerated, but full sun exposure is ideal.",
        "Ensure the plant gets at least six to eight hours of sunlight daily.",
        "Avoid placing it in heavily shaded areas for best flower production."
    ],
    "watering": [
        "Water the Indian Paintbrush moderately, allowing the soil to dry between waterings.",
        "Overwatering should be avoided as it may lead to root rot and other issues.",
        "Ensure the soil remains moist but never waterlogged to promote healthy growth.",
        "During drought conditions, additional watering may be necessary for survival."
    ],
    "soil": [
        "Prefers well-drained soil that mimics its natural, sandy habitats.",
        "Soil should be rich in nutrients while maintaining good drainage.",
        "A mix of sand and loamy soil creates the ideal growing environment.",
        "Avoid heavy clay soils as they retain too much water, harming the plant."
    ],
    "toxic": [
        "Indian Paintbrush contains compounds that can be toxic if ingested.",
        "The plant may cause gastrointestinal irritation in humans and pets.",
        "Consumption can lead to symptoms like nausea, vomiting, and diarrhea.",
        "Care should be taken to prevent accidental ingestion by pets or children."
    ],
    "extra_care_tip": [
        "Indian Paintbrush is a hemiparasite, meaning it partially relies on nearby plants.",
        "Plant it near compatible species to support its growth through root connections.",
        "Prune dead or damaged growth to encourage healthy blooming and shape the plant.",
        "Regular weeding helps prevent competition and promotes better nutrient access."
    ]
}