{
    "name": "Invincibelle Spirit Hydrangea",
    "climate": [
        "Invincibelle Spirit Hydrangea thrives in temperate climates with moderate seasonal variation.",
        "It prefers areas with sufficient rainfall or irrigation facilities.",
        "The plant can withstand colder temperatures but should be protected from extreme cold.",
        "Too much prolonged heat or drought can stress the plant, affecting blooms."
    ],
    "sunlight": [
        "This hydrangea prefers partial shade to full sunlight for optimal bloom.",
        "Morning sun with afternoon shade is ideal to prevent wilting.",
        "In hotter climates, avoid full-day exposure to intense sunlight.",
        "Too much shade can reduce flowering, limiting blooming potential."
    ],
    "watering": [
        "Regular watering is essential, especially in the dry season to maintain soil moisture.",
        "The plant needs consistent moisture but must not be waterlogged.",
        "A deep watering once a week is recommended rather than frequent shallow watering.",
        "Be cautious of overwatering, which can lead to root rot or fungal diseases."
    ],
    "soil": [
        "Invincibelle Spirit Hydrangea grows best in rich, well-draining soil that retains moisture.",
        "The soil's pH can affect the flower color, though this variety is less pH sensitive.",
        "Adding organic matter or compost enhances soil quality and provides nutrients.",
        "Ensure proper drainage to prevent waterlogging, especially after heavy rains."
    ],
    "toxic": [
        "All parts of the hydrangea plant are toxic if ingested by humans or pets.",
        "Symptoms of poisoning include nausea, vomiting, and diarrhea."
    ],
    "extra_care_tip": [
        "Pruning should be done in early spring before new growth commences.",
        "Mulching in summer helps retain moisture and keep roots cool.",
        "Fertilize in spring with a balanced, slow-release fertilizer for healthy growth.",
        "Protect from harsh winds which can damage flowers and branches."
    ]
}