{
    "name": "Italian Stone Pine",
    "climate": [
        "Italian Stone Pine thrives in a Mediterranean climate, which is characterized by long, hot, dry summers and mild, wet winters.",
        "This plant can also adapt to other climates with adequate drainage and can tolerate some drought once established.",
        "It is generally hardy in USDA zones 8 through 10, where temperatures rarely drop significantly below freezing.",
        "The tree prefers locations that do not experience high humidity and excessive rainfall throughout the year."
    ],
    "sunlight": [
        "Full sunlight is ideal for the Italian Stone Pine as it replicates its native southern European habitats.",
        "Ensure the tree receives at least six to eight hours of direct sunlight per day for optimal growth.",
        "Partial shading can be tolerated but may result in less vigorous growth and a less dense canopy.",
        "Avoid shaded areas where the pine could be deprived of the sunlight needed for healthy development."
    ],
    "watering": [
        "Italian Stone Pine requires regular watering during its initial growing period until it's established.",
        "Once mature, it becomes relatively drought-tolerant and may require watering during prolonged dry spells.",
        "Nevertheless, avoid waterlogging the soil as it can lead to root rot, which is deleterious to the plant.",
        "For container-grown pines, ensure that the pot has adequate drainage to prevent standing water issues."
    ],
    "soil": [
        "The tree prefers well-draining, sandy soils that mimic the rocky, nutrient-poor soil of its native environment.",
        "A slightly acidic to neutral pH level is best for the Italian Stone Pine, avoiding highly alkaline soils.",
        "While it can tolerate poorer soils, enriched loamy soil with good drainage supports faster growth.",
        "Compacted clay or excessively wet soils should be avoided as these conditions can harm the root system."
    ],
    "toxic": [],
    "extra_care_tip": []
}