{
    "name": "Itoh Peony",
    "climate": [
        "Itoh Peonies are best suited to growing in temperate climates where winters are cold enough to promote dormancy.",
        "They thrive in USDA hardiness zones 4 through 9, where winter temperatures are cold but not excessively harsh.",
        "Itoh Peonies prefer a climate that offers a distinct cold winter, as this impacts flowering performance.",
        "While adaptable, they are least successful in regions with hot, humid summers lacking winter chill."
    ],
    "sunlight": [
        "Itoh Peonies require full sun exposure for at least six to eight hours a day to bloom their best.",
        "Partial shade is acceptable, especially in very hot areas, but it might reduce floral display.",
        "They perform well in gardens receiving morning sunlight and some afternoon shade to protect from heat.",
        "For optimal growth, avoid planting Itoh Peonies in areas fully shaded by nearby trees or structures."
    ],
    "watering": [
        "Regular watering is crucial for Itoh Peonies, especially during their first year of growth.",
        "Water deeply once a week to maintain consistent moisture but avoid waterlogged soil.",
        "Mulching is recommended to help retain soil moisture and reduce water evaporation.",
        "During drought conditions, more frequent watering will be necessary to keep them hydrated."
    ],
    "soil": [
        "Itoh Peonies require well-drained soil, rich in organic matter for best growth.",
        "They thrive in loamy soils with a neutral pH but are adaptable to slightly acidic conditions.",
        "Ensure the planting location has good drainage to prevent root rot during wet seasons.",
        "Amend clay-heavy soils with compost to improve drainage and aeration for healthy root development."
    ],
    "toxic": [
        "Itoh Peonies have mild toxic properties; ingestion might cause mild stomach upset in pets or children.",
        "All parts of the peony plant contain compounds that can cause gastrointestinal distress if consumed."
    ],
    "extra_care_tip": [
        "Deadheading spent blooms will encourage a tidy appearance and may promote additional flowering.",
        "In colder regions, apply a light mulch post-season to protect roots from freezing soil temperatures.",
        "Divide and transplant peonies every 3-5 years to rejuvenate older plants and maintain plant vigor.",
        "Avoid overhead watering to minimize disease risk; watering at the soil level is preferred."
    ]
}