{
    "name": "Ivory Silk Lilac",
    "climate": [
        "Ivory Silk Lilacs thrive in temperate climates with cold winters. They require a winter chill to promote healthy spring growth and flowering.",
        "These trees are adaptable to a range of climates but prefer areas with a defined seasonal change, including warm summers and cold winters.",
        "They grow best in USDA plant hardiness zones 3 to 7, where winter temperatures can fall below freezing but summers are warm.",
        "Although adaptable, Ivory Silk Lilacs do not perform well in tropical climates where there is little to no winter chill necessary for dormancy."
    ],
    "sunlight": [
        "Ivory Silk Lilacs prefer full sun conditions to thrive; ideally, they need at least six hours of direct sunlight per day.",
        "These trees can tolerate partial shade, but for optimal growth and flowering, full sunlight exposure is recommended.",
        "Limited sunlight can lead to reduced flower production, so plant the tree in a location with abundant sun exposure.",
        "Maximizing sun exposure by planting on the south or east side of buildings can promote healthier growth and more vibrant blooms."
    ],
    "watering": [
        "While establishing, Ivory Silk Lilacs require regular watering to develop strong root systems, especially in dry periods.",
        "Once established, they are moderately drought tolerant but benefit from regular watering during prolonged dry spells.",
        "Overwatering should be avoided as the tree prefers slightly moist but not waterlogged soil conditions, which can lead to root rot.",
        "Water deeply and infrequently, allowing the soil to dry out slightly between waterings to support healthy root development."
    ],
    "soil": [
        "Ivory Silk Lilacs prefer well-drained soil with a slightly alkaline pH for optimal growth and flower production.",
        "They adapt to various soil types, including clay, loam, or sandy soils, provided drainage is adequate to prevent water stagnation.",
        "Organic matter such as compost can be added to improve soil structure, fertility, and moisture retention for healthier plant growth.",
        "Avoid heavy, waterlogged soils; instead, choose a location with good drainage to prevent root diseases and encourage vigorous blooms."
    ],
    "toxic": [
        "Ivory Silk Lilacs are generally considered non-toxic to humans and pets, making them a safe choice for home landscapes.",
        "Despite their non-toxic nature, ingestion of large quantities by pets may still lead to mild gastrointestinal upset."
    ],
    "extra_care_tip": [
        "Regular pruning after flowering helps maintain a tidy shape and encourages more lush flowering in subsequent seasons.",
        "Applying a layer of mulch around the base can help retain moisture, suppress weeds, and regulate soil temperature."
    ]
}