{
    "name": "Japanese Zelkova",
    "climate": [
        "Japanese Zelkova prefers a temperate climate with distinct seasonal changes.",
        "It thrives in areas where winters are cold enough for dormancy and summers warm enough for growth.",
        "The tree can adapt to both humid and moderately dry environments, making it versatile.",
        "It is native to East Asia and does well where there are moderate temperatures year-round."
    ],
    "sunlight": [
        "Full sun exposure is ideal for Japanese Zelkova, promoting healthy growth and leaf production.",
        "While it can tolerate some shade, reduced sunlight may lead to a less vigorous growth pattern.",
        "Ensure planting in a location where it will receive at least six to eight hours of sunlight daily.",
        "Adequate sunlight exposure supports the development of the tree’s broad, spreading canopy."
    ],
    "watering": [
        "Japanese Zelkova requires regular watering, especially during its initial establishment period.",
        "Once established, the tree is somewhat drought-tolerant but prefers consistent moisture.",
        "Over-watering should be avoided as well-drained soil is necessary to prevent root rot.",
        "During dry, hot periods, ensure the soil remains moist to support optimal growth."
    ],
    "soil": [
        "Well-drained soil is crucial for Japanese Zelkova to prevent waterlogging and root diseases.",
        "The tree can grow in a variety of soil types, including loamy, sandy, or clay soils.",
        "Soil with slightly acidic to neutral pH levels supports the tree's health and vitality.",
        "Enriching the soil with organic matter can improve drainage and nutrient availability."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune Japanese Zelkova in the late winter to remove dead wood and shape its structure.",
        "Regular inspection for pests such as aphids and scales can prevent infestations.",
        "Mulching around the base helps retain soil moisture and suppress weeds effectively.",
        "Protect young trees from harsh winds and frost for the first few years after planting."
    ]
}