{
    "name": "Japanese Lilac Tree",
    "climate": [
        "Prefers a temperate climate with distinct seasons, ensuring healthy growth.",
        "Cold hardy and can withstand harsh winter conditions typical of temperate zones.",
        "Requires a period of winter dormancy to thrive and produce abundant blossoms every year.",
        "Does best in areas with moderate humidity levels and avoids extreme dryness."
    ],
    "sunlight": [
        "Thrives in full sun conditions, receiving at least six hours of direct sunlight daily.",
        "Can tolerate some partial shade but flower production might be reduced as a consequence.",
        "Ensure the plant isn't overshadowed by larger trees, which could impact sunlight exposure.",
        "Full sun exposure helps in maintaining its vibrant leaf color and plentiful blooms."
    ],
    "watering": [
        "Prefers consistently moist soil, especially during its active growing seasons in spring and summer.",
        "Avoid waterlogged conditions, which could lead to root rot and other issues.",
        "Drought-tolerant once established, but consistent watering encourages optimal flowering.",
        "Water deeply once a week, particularly during dry spells or extended hot periods."
    ],
    "soil": [
        "Grows best in rich, well-drained soil with a pH ranging from slightly acidic to neutral.",
        "Heavy clay soils should be improved by incorporating organic matter like compost.",
        "Aerated soil is crucial to promote healthy root development and nutrient uptake.",
        "Not fussy about soil type but thrives in fertile loam for the most vigorous growth."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune annually after flowering to maintain shape and encourage more blooms the following year.",
        "Avoid excessive pruning which could lead to fewer flowers; focus on deadheading spent blooms.",
        "Watch for common pests such as lilac borers and deal with them promptly to prevent damage.",
        "Mulch around the base to keep roots cool, conserve moisture, and suppress weed growth."
    ]
}