{
    "name": "Jostaberry Bush",
    "climate": [
        "Jostaberry bushes thrive in temperate climates, where they are not exposed to extreme temperatures.",
        "They do well in regions that have cold winters, as some chilling is required for fruit production.",
        "Avoid hot, dry climates, as these can cause stress and reduce the plant's ability to bear fruit.",
        "Humid climates can be tolerated, but overly wet conditions should be avoided to prevent root diseases."
    ],
    "sunlight": [
        "Jostaberry bushes prefer full sun exposure, which promotes healthy growth and fruit production.",
        "Partial shade can be tolerated but may result in fewer fruits and slower growth.",
        "Ensure the plant gets at least 6 to 8 hours of sunlight per day for the best results.",
        "Insufficient sunlight may lead to leggy growth and weak branches that do not support fruit well."
    ],
    "watering": [
        "Water young jostaberry bushes regularly to help establish a strong root system.",
        "Once established, these plants prefer consistent watering but should not be waterlogged.",
        "Allow the soil to dry out slightly between watering to prevent root rot.",
        "In hotter climates, more frequent watering may be necessary to maintain soil moisture levels."
    ],
    "soil": [
        "Jostaberry bushes prefer well-draining soil rich in organic matter to support growth.",
        "Slightly acidic to neutral pH soil, ranging from 6.0 to 7.0, is ideal for these plants.",
        "Poor soil can be improved with the addition of compost or well-rotted manure.",
        "Avoid heavy clay soils unless they are amended, as these can lead to water retention issues."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune jostaberry bushes in late winter to early spring to remove dead wood and promote airflow.",
        "Mulching around the base helps retain moisture and suppresses weeds effectively during seasons."
    ]
}