{
    "name": "Lamb's Ears",
    "climate": [
        "Lamb's Ears thrive in temperate climates with mild summers and winters.",
        "This plant can tolerate a range of climates but prefers regions without extreme cold.",
        "It is not suited for extremely humid climates but can handle light frost.",
        "Ideal for zones where summers are dry, ensuring good growth and silver leaves."
    ],
    "sunlight": [
        "Lamb's Ears require full sun to partial shade for optimal growth and appearance.",
        "In regions with intense sunlight, some afternoon shade can help prevent leaf scorching.",
        "While tolerant of some shade, their foliage is most vibrant in direct sunlight.",
        "Ensuring adequate sun exposure helps maintain the plant's compact, fuzzy leaves."
    ],
    "watering": [
        "This plant prefers well-drained soil and should not be overwatered to avoid root rot.",
        "Water deeply but infrequently, allowing the soil to dry between watering sessions.",
        "In drought conditions, they may require more frequent watering to maintain vitality.",
        "Excessive moisture can lead to fungal issues; ensure good air circulation around the plant."
    ],
    "soil": [
        "Lamb's Ears grow best in well-draining soil with a neutral to slightly alkaline pH.",
        "They can tolerate poor soil conditions but thrive in nutrient-rich, loose soil mixes.",
        "Amending the soil with sand or gravel can improve drainage and ensure plant health.",
        "Compacted or heavy soil should be avoided as it can retain too much moisture, harming the plant."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regularly trim spent flowers to encourage a tidier appearance and new growth.",
        "Divide clumps every few years to maintain healthy growth and prevent overcrowding.",
        "Monitor for pest infestations, particularly from slugs which can damage leaves.",
        "Mulching around the base can help retain moisture and suppress weeds, but avoid direct stem contact."
    ]
}