{
    "name": "Lantana",
    "climate": [
        "Lantana thrives in tropical and subtropical climates where it can grow year-round.",
        "Warm climates with mild winters are ideal for lantana, allowing continuous growth.",
        "They prefer climates with hot summers and can tolerate some drought conditions.",
        "Frost-free climates ensure the best growth, as lantana is frost-sensitive."
    ],
    "sunlight": [
        "Lantana requires full sun to produce the most vibrant blooms and fruits.",
        "At least six hours of direct sunlight daily is necessary for healthy growth.",
        "Partial shade will result in fewer flowers, as full sun is best for lantana.",
        "Consistent exposure to intense sunlight helps the plant thrive and resist pests."
    ],
    "watering": [
        "Lantana prefers moderate watering, allowing soil to dry slightly between sessions.",
        "Overwatering can cause root rot; ensure the soil dries before watering again.",
        "During hot weather, lantana may need more frequent watering to prevent wilting.",
        "Reducing watering frequency in colder months helps prevent excess moisture in soil."
    ],
    "soil": [
        "Lantana grows best in well-draining soil with a neutral to slightly acidic pH.",
        "Sandy or loamy soils are ideal as they prevent water from pooling around roots.",
        "Soil that retains moisture can lead to root rot; good drainage is essential.",
        "Amend clay soil with sand or organic matter to improve drainage and aeration."
    ],
    "toxic": [
        "Lantana is toxic to pets, causing vomiting and other symptoms if ingested.",
        "Children should avoid touching the berries, which are particularly toxic.",
        "Effects of toxicity include abdominal pain, diarrhea, and in severe cases, death.",
        "Handle lantana with care to prevent accidental ingestion by animals or humans."
    ],
    "extra_care_tip": [
        "Pruning regularly helps maintain shape and encourages more prolific blooming.",
        "Remove spent flowers and old wood to stimulate new growth and enhance beauty.",
        "Lantana can become invasive in some regions, so monitor its spread carefully.",
        "Mulching can help retain moisture and control weeds, benefiting lantana growth."
    ]
}