{
    "name": "Lemon Cypress",
    "climate": [
        "Thrives in mild climates with moderate humidity, suitable for coastal regions.",
        "Prefers temperatures that do not drop below freezing, best in USDA zones 7-10.",
        "Can adapt to indoor environments if temperatures are too cold outside.",
        "Cool Mediterranean climates with not too much summer heat are ideal for growth."
    ],
    "sunlight": [
        "Requires full sun exposure to thrive, though can tolerate partial shade.",
        "At least 6-8 hours of sunlight each day is optimal for its health.",
        "Insufficient sunlight can lead to weak and leggy growth, affecting its shape.",
        "In very hot climates, some afternoon shade can prevent leaf scorching."
    ],
    "watering": [
        "Consistent watering is needed, but avoid waterlogging which can harm roots.",
        "Allow the topsoil to dry out slightly between waterings to prevent overwatering.",
        "During the growing season, ensure the plant is well-hydrated, particularly in sunny locations.",
        "Reduce watering during winter months to mimic natural dormancy and prevent root rot."
    ],
    "soil": [
        "Prefers well-drained, sandy loam soil enriched with organic matter for nutrients.",
        "Soil with good drainage is crucial to avoid water retention and root diseases.",
        "A slightly acidic to neutral pH level, around 6.0 to 7.0, is preferable for optimal growth.",
        "Regular soil amendment with compost can improve fertility and structure over time."
    ],
    "toxic": [
        "The plant is generally non-toxic to humans and pets, making it a safe ornamental choice."
    ],
    "extra_care_tip": [
        "Prune annually to maintain a desired shape and promote bushier growth.",
        "When grown indoors, periodically mist to increase humidity around the plant.",
        "Regularly rotate the plant if indoors to ensure even growth on all sides.",
        "Be cautious of pests such as spider mites; use insecticidal soap if needed."
    ]
}