{
    "name": "Lemon Verbena",
    "climate": [
        "Lemon Verbena thrives in warm climates and prefers temperatures that stay consistently above 50°F.",
        "It is best suited for USDA hardiness zones 9 to 11, where the temperatures rarely drop below freezing.",
        "In cooler climates, it can be grown in pots and brought indoors during the winter months.",
        "This plant does not tolerate frost, so it must be protected or moved indoors when temperatures drop."
    ],
    "sunlight": [
        "Lemon Verbena requires full sunlight to grow optimally and to maintain its aromatic foliage.",
        "The plant should receive at least six to eight hours of direct sunlight each day for healthy growth.",
        "If growing indoors, place it near a south or west-facing window for maximum natural light exposure.",
        "Insufficient light may result in leggy growth and reduced production of its fragrant leaves."
    ],
    "watering": [
        "Water Lemon Verbena regularly but ensure the soil is well-draining to prevent root rot.",
        "The plant should be watered thoroughly when the top inch of soil feels dry to the touch.",
        "Be cautious not to overwater; the plant prefers to dry out slightly between watering.",
        "In hot climate zones, increased watering may be necessary, especially during dry periods."
    ],
    "soil": [
        "A well-draining potting mix with added sand or perlite is ideal to prevent excess moisture.",
        "It prefers a neutral to slightly alkaline pH soil, ranging from 6.5 to 7.5 for optimal health.",
        "Heavy clay soils should be avoided unless amended to improve drainage capabilities.",
        "Regularly check soil composition and replenish nutrients with organic matter if needed."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune Lemon Verbena regularly to encourage bushier growth and increase leaf production.",
        "In cooler climates, consider growing it in pots which can be moved indoors during cold seasons."
    ]
}