{
    "name": "Lemon Tree",
    "climate": [
        "Lemon trees thrive best in warm, subtropical climates where temperatures rarely drop below freezing.",
        "Moderate temperatures with seasonal differences are ideal for producing quality fruits in lemon trees.",
        "A lemon tree can tolerate short periods of cold as long as the climate returns to mild temperatures.",
        "High humidity and consistent warm weather provide the optimum growth conditions for citrus trees like lemons."
    ],
    "sunlight": [
        "Lemon trees require full sun exposure to produce healthy fruit and maintain robust growth.",
        "Daily sunlight exposure for about 8 to 12 hours is recommended for the best fruit production.",
        "Direct sunlight with no shading from nearby structures is crucial for lemon tree vitality.",
        "In cooler climates, lemon trees benefit from being in the brightest possible spot available to them."
    ],
    "watering": [
        "Regular watering is essential, especially when the tree is young and during dry spells.",
        "Lemon trees prefer deep but infrequent watering, allowing the soil to dry slightly between waterings.",
        "Watering early in the day can help prevent fungal diseases by allowing the foliage to dry off.",
        "Overwatering should be avoided as it can cause root rot, a common problem with citrus plants."
    ],
    "soil": [
        "Lemon trees grow best in well-draining, sandy loam soils that are slightly acidic.",
        "Poorly drained soil can lead to root rot; hence, amending with organic matter helps drainage.",
        "Nutrient-rich soil with a pH between 5.5 and 6.5 supports healthy growth and fruiting in lemon trees.",
        "Regular soil testing ensures that necessary nutrients like nitrogen are adequately available."
    ],
    "toxic": [
        "Lemon tree leaves and fruits contain a compound called psoralen, which can be toxic to pets if ingested."
    ],
    "extra_care_tip": [
        "Pruning lemon trees regularly helps to maintain their shape and encourages fruit production."
    ]
}