{
    "name": "Lenten Rose",
    "climate": [
        "Lenten Roses prefer temperate climates with cool, moist conditions.",
        "Ideal growing regions include areas with mild winters and cool summers.",
        "They are hardy in USDA zones 4 to 9, handling a range of climates.",
        "Avoid extremely hot or dry climates, as they may stress the plant."
    ],
    "sunlight": [
        "Lenten Roses thrive in partial to full shade, avoiding direct sunlight.",
        "Morning sun with afternoon shade is often recommended for best growth.",
        "Too much direct sunlight, especially hot afternoon sun, can scorch leaves.",
        "They can adapt to different light conditions, but prefer filtered light."
    ],
    "watering": [
        "Keep soil consistently moist, especially during the plant's active growth.",
        "Avoid allowing the soil to completely dry out, which can harm the plant.",
        "Ensure good drainage to prevent waterlogged soil, which can lead to root rot.",
        "Water more frequently during dry spells or extremely hot periods."
    ],
    "soil": [
        "Lenten Roses prefer rich, well-draining soil for optimal growth.",
        "A soil pH in the range of 6.0 to 7.5 is generally suitable for them.",
        "Incorporate organic matter like compost to improve soil fertility and structure.",
        "Heavy clay soils should be amended to enhance drainage and aeration."
    ],
    "toxic": [
        "Lenten Roses are toxic if ingested by humans or pets, causing symptoms.",
        "Handling the plant may cause skin irritation for sensitive individuals.",
        "Keep away from small children and pets to prevent accidental ingestion.",
        "Symptoms of ingestion include vomiting, diarrhea, and excessive drooling."
    ],
    "extra_care_tip": [
        "Mulching can help conserve moisture and maintain consistent soil temperature.",
        "Deadhead spent flowers to encourage healthy growth and prevent self-seeding.",
        "Divide clumps every few years in early spring to manage size and vigor.",
        "Protect the plant from strong winds which can damage its evergreen foliage."
    ]
}