{
    "name": "Ligularia",
    "climate": [
        "Ligularia thrives in temperate climates with cooler summers and mild temperatures.",
        "This plant prefers areas with high humidity levels and frequent rainfall during the growing season.",
        "It can tolerate cold climates if provided with adequate winter protection such as mulching.",
        "Avoid planting in regions with extremely hot or dry climates as it may struggle."
    ],
    "sunlight": [
        "Ligularia grows best in partial shade to full shade, avoiding direct midday sun.",
        "Ensure it receives some morning sunlight but protect it from harsh afternoon sunlight.",
        "In full shade locations, growth may be slightly slower but overall health is maintained.",
        "Place it under deciduous trees where it can receive filtered sunlight through the foliage."
    ],
    "watering": [
        "Consistent moisture is key; water regularly to keep the soil evenly moist but not waterlogged.",
        "During hot months, increase watering frequency to prevent wilting and stress.",
        "Use mulch to retain moisture as it helps sustain adequate dampness in the soil.",
        "Establish a watering schedule and monitor soil conditions to avoid drought stress."
    ],
    "soil": [
        "Ligularia requires rich, organic soil that retains moisture yet drains well.",
        "Amend the planting area with compost or well-rotted manure to enhance soil fertility.",
        "Avoid heavy clay soils that retain excess water leading to possible root rot issues.",
        "Ensure soil pH is slightly acidic to neutral, around 5.5 to 7.0, for ideal growth."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regularly remove faded flowers and dead foliage to promote new growth and improve aesthetics.",
        "In regions with harsh winters, apply a thick layer of mulch to protect roots from freezing.",
        "Watch out for slugs and snails which can damage leaves; consider using natural deterrents.",
        "Avoid overcrowding plants, maintain good air circulation to prevent fungal diseases."
    ]
}