{
    "name": "Lilac Bush",
    "climate": [
        "Lilac bushes thrive in temperate regions with cool summers and cold winters.",
        "They are well-suited to USDA hardiness zones 3 through 7 and prefer a cold climate.",
        "To bloom properly, lilac bushes need a winter chill with temperatures below freezing.",
        "Avoid planting lilacs in regions with very hot or humid climates all year long."
    ],
    "sunlight": [
        "Lilac bushes require full sunlight, ideally about six to eight hours per day.",
        "They can tolerate partial shade but may produce fewer flowers if sunlight is limited.",
        "To encourage robust blooming, position lilac bushes where they receive morning sun.",
        "Avoid planting in areas that are shaded by buildings or other large structures."
    ],
    "watering": [
        "Water lilac bushes deeply but infrequently to encourage deep root growth.",
        "They prefer consistently moist soil but should not be waterlogged or soggy.",
        "During dry spells, more frequent watering may be necessary to keep the soil damp.",
        "Ensure good drainage to prevent root rot, as lilacs do not like standing water."
    ],
    "soil": [
        "Lilac bushes prefer well-drained, fertile soil with a neutral pH of around 6.5 to 7.0.",
        "Amend clay or sandy soil with plenty of organic matter to improve drainage.",
        "Soil should be rich in nutrients, but overly acidic soils can impair growth.",
        "Regularly test soil pH to maintain optimal conditions for lilac bushes to thrive."
    ],
    "toxic": [
        "Lilac bushes are generally non-toxic to humans and pets if ingested."
    ],
    "extra_care_tip": [
        "Prune lilacs annually immediately after flowering to encourage new growth.",
        "Removing spent blooms and overgrown branches will help maintain shrub shape.",
        "Avoid heavy pruning, as it can significantly reduce blooms for the next season.",
        "Apply mulch around the base of the lilac bush to help retain moisture and moderate soil temperature."
    ]
}