{
    "name": "Living Stones",
    "climate": [
        "Living Stones thrive in arid climates that mimic their natural desert habitats.",
        "These plants prefer warm conditions similar to those of their native Southern Africa.",
        "They can survive long periods without rainfall, typical of dry desert climates.",
        "Although they are adapted to low-humidity environments, they can tolerate some humidity."
    ],
    "sunlight": [
        "Living Stones require plenty of bright light to thrive and maintain their vibrant colors.",
        "They do best in full sunlight for at least five to six hours each day.",
        "Without adequate sunlight, Living Stones may lose color and become elongated or leggy.",
        "Ensure they are placed in a location where they receive maximum natural light exposure."
    ],
    "watering": [
        "Living Stones have specific watering needs, requiring water only during active growth.",
        "It's crucial to allow soil to completely dry out between waterings to prevent root rot.",
        "During their dormancy period, in summer and mid-winter, reduce watering significantly.",
        "Overwatering is a common mistake; these plants require very little water for survival."
    ],
    "soil": [
        "A well-draining soil mix, preferably cactus or succulent mix, is essential for Living Stones.",
        "The soil should contain sand or small gravel to ensure ample drainage and aeration.",
        "Poor drainage can lead to root rot, so it's vital to use a soil mix with good permeability.",
        "An alkaline soil environment suits them best, emulating conditions found in their natural habitat."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Be cautious during the dormant season by limiting watering to prevent root issues.",
        "Monitor the leaves' shape and color to adjust sunlight and watering accordingly.",
        "Repotting should be done sparingly and only when absolutely necessary to avoid disturbance.",
        "Ensure the pots have drainage holes to allow any excess water to escape easily."
    ]
}