{
    "name": "London Plane",
    "climate": [
        "The London Plane tree thrives in temperate climates with distinct seasonal variation.",
        "It can adapt to urban climates with pollution, fluctuating temperatures, and humidity.",
        "This tree can withstand mild frosts, thriving in climates with cool winters and warm summers.",
        "It is commonly planted in cities where it can endure heat and low moisture conditions."
    ],
    "sunlight": [
        "London Plane trees require full sun for optimal growth, needing at least six hours of direct sunlight daily.",
        "They are tolerant of partial shade but exhibit best growth in sunny locations.",
        "Shade can reduce the density and robustness of the London Plane's foliage.",
        "Consistent access to direct sunlight helps the tree maintain its robust health and shape."
    ],
    "watering": [
        "Young London Plane trees need regular watering, especially during dry periods or drought conditions.",
        "Once established, these trees are moderately drought tolerant but still benefit from occasional deep watering.",
        "Watering should be sufficient to keep the soil moist but not waterlogged, especially in summer.",
        "In sandy or well-draining soils, more frequent watering may be necessary to maintain soil moisture."
    ],
    "soil": [
        "The London Plane is not fussy about soil types but prefers well-drained, loamy soils.",
        "It can tolerate a range of soil pH levels, from slightly acidic to slightly alkaline.",
        "Compacted soils should be avoided as they can hinder root growth and health.",
        "It thrives in urban areas with poor soil conditions, thanks to its adaptability."
    ],
    "toxic": [
        "The leaves and bark may cause skin irritation or allergic reactions upon contact.",
        "Inhaling the hairs shed by the leaves can cause respiratory issues in sensitive individuals."
    ],
    "extra_care_tip": [
        "Prune dead or diseased branches in late winter to maintain shape and encourage healthy growth.",
        "Monitoring for pests like lace bugs or aphids can help maintain the tree's health with timely interventions."
    ]
}