{
    "name": "Love-Lies-Bleeding",
    "climate": [
        "Love-Lies-Bleeding thrives in tropical climates where it can enjoy warm temperatures.",
        "This plant prefers a subtropical climate but can adapt to cooler environments if necessary.",
        "It requires a growing environment that replicates its native conditions in the Americas.",
        "Humidity is essential, and frost can severely damage Love-Lies-Bleeding."
    ],
    "sunlight": [
        "This plant flourishes in full sunlight, needing at least six hours of direct sun daily.",
        "Partial shade may be tolerated, but optimal growth occurs with more sun exposure.",
        "Sunlight allows the vibrant red tassels to develop fully and maintain their bright color.",
        "Too much shade can lead to leggy plants with fewer, less vivid flowering tassels."
    ],
    "watering": [
        "Keep the soil consistently moist, though not waterlogged, to support healthy growth.",
        "Regular watering is essential, especially during dry periods, to maintain vibrancy.",
        "Overwatering should be avoided, as it can lead to root rot and other diseases.",
        "Use a balanced approach: let the topsoil dry slightly between thorough waterings."
    ],
    "soil": [
        "Well-draining soil with a rich composition is ideal for Love-Lies-Bleeding.",
        "A slightly acidic to neutral soil pH enhances nutrient uptake for this plant.",
        "Amend the soil with organic matter to improve water retention and fertility.",
        "Avoid overly compacted soils, as they can impede root growth and plant health."
    ],
    "toxic": [
        "Love-Lies-Bleeding is not considered toxic, but its seeds should not be consumed."
    ],
    "extra_care_tip": [
        "Support tall plants with stakes to prevent wind or rain damage to the stems.",
        "Deadheading is unnecessary, but removing faded blooms can improve appearance.",
        "Regular fertilization during the growing season promotes lush foliage and flowers.",
        "Monitor for pests like aphids and spider mites, taking action if infestations occur."
    ]
}