{
    "name": "Lungwort",
    "climate": [
        "Lungwort thrives in temperate climates with moderate temperatures, avoiding extremes too hot or too cold.",
        "It prefers a climate with high humidity levels, similar to woodland environments where it naturally grows.",
        "The plant requires a cool and mild climate, particularly in the summer months for optimal growth.",
        "Lungwort is well-suited for areas with distinct seasons, where winters are cold but not severely harsh."
    ],
    "sunlight": [
        "Thrives in partial shade environments, avoiding direct sunlight to prevent leaf scorch.",
        "Although it can tolerate full shade, Lungwort blooms more prolifically with some indirect sunlight.",
        "Prefers dappled sunlight similar to that of a woodland understory where light filters gently.",
        "It benefits from morning sun combined with afternoon shade, balancing light needs efficiently."
    ],
    "watering": [
        "Regular watering is essential, ensuring the soil remains consistently moist but not waterlogged.",
        "Reduce watering frequency in the growing season to twice a week, increasing if conditions are dry.",
        "In winter, Lungwort water requirements drop significantly, needing only occasional moisture.",
        "Ensure the plant's soil retains moisture during hot, dry spells to prevent dehydration and stress."
    ],
    "soil": [
        "Prefers well-drained soil with rich organic compost to provide necessary nutrients for growth.",
        "Lungwort thrives in slightly acidic to neutral soils, balancing pH around 6.0 to 7.0 for optimal health.",
        "Soil should be amended with leaf mold or peat moss to ensure high moisture retention capabilities.",
        "Loamy soil types are ideal, providing adequate aeration to support root development effectively."
    ],
    "toxic": [
        "Lungwort is not toxic to humans; however, caution is advised if consumed in large quantities."
    ],
    "extra_care_tip": [
        "Remove any dead or damaged leaves regularly to promote healthier growth and appearance."
    ]
}