{
    "name": "Lychee",
    "climate": [
        "Lychee trees thrive in warm subtropical to tropical climates with high humidity levels.",
        "They prefer climates where temperatures remain above freezing during winter months.",
        "Lychee requires a defined dry season to stimulate flowering and subsequent fruit set.",
        "Ideal temperatures for lychee growth range from 25 to 35 degrees Celsius, especially in summer."
    ],
    "sunlight": [
        "Lychee trees require full sun to produce high-quality fruits with optimal sweetness.",
        "They should be planted in a location that receives at least 6 to 8 hours of direct sunlight daily.",
        "While they can tolerate some shade, full exposure to sunlight boosts flowering and fruiting.",
        "Lychee requires adequate sunlight exposure to maintain healthy foliage and vigor."
    ],
    "watering": [
        "Consistent watering is essential for lychee trees, especially in dry periods, to ensure fruit development.",
        "Avoid waterlogging by ensuring the soil has adequate drainage; excessive water can harm roots.",
        "During dry seasons, irrigation helps maintain the necessary moisture levels for flowering.",
        "Reduce watering during the dormant phase in winter to mimic natural dry season conditions."
    ],
    "soil": [
        "Lychee prefers rich, well-drained, loamy soil with high organic matter content for best growth.",
        "Acidic to neutral pH levels between 5.5 and 7 are ideal for lychee for optimal nutrient uptake.",
        "The soil should have good drainage to prevent root rot from waterlogged conditions.",
        "Lychee trees benefit from soil that retains moisture yet has proper aeration to sustain roots."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune lychee trees to maintain an open canopy, allowing light penetration and reducing disease.",
        "Lychee fruits are best harvested when fully ripe; improper timing can affect taste and quality.",
        "Protect young trees from harsh winds or frost, which can cause significant damage to growth.",
        "Regularly inspect for pests such as fruit bats and apply protective measures as needed."
    ]
}