{
    "name": "Macadamia Nut Tree",
    "climate": [
        "Macadamia nut trees thrive in tropical and subtropical climates, where temperatures are moderate throughout the year.",
        "They require an environment with high humidity and moderate rainfall, ideally between 60 to 120 inches annually.",
        "These trees are sensitive to frost and prefer climates where temperatures do not fall below freezing.",
        "Ideal growth occurs in regions where there is minimal temperature fluctuation and plenty of warm, sunny days."
    ],
    "sunlight": [
        "Macadamia nut trees need full sun exposure to maximize growth and nut production.",
        "They grow best in areas that receive at least six to eight hours of direct sunlight each day.",
        "While they can tolerate partial shade, optimal nut yield is achieved in full sun conditions.",
        "Care should be taken to ensure the trees are not overshadowed by larger plants or structures."
    ],
    "watering": [
        "Macadamia trees require consistent watering, especially during dry spells or prolonged periods of heat.",
        "While they need regular irrigation, it is crucial to avoid waterlogged conditions which can harm the roots.",
        "Mulching around the base helps retain soil moisture and reduces the frequency of watering needed.",
        "Drip irrigation systems are often utilized to provide steady moisture with minimal evaporation."
    ],
    "soil": [
        "They prefer well-drained, slightly acidic soils rich in organic matter to support healthy growth.",
        "Loamy or sandy loam soils with good drainage properties are ideal for macadamia trees.",
        "Heavy clay soils are not suitable unless they have been substantially modified for drainage.",
        "Regular soil testing is recommended to adjust pH and nutrient levels for optimal growth."
    ],
    "toxic": [
        "Macadamia nuts are toxic to dogs, causing symptoms like weakness, vomiting, and tremors.",
        "There is no known antidote for macadamia nut poisoning in dogs; symptoms usually resolve in 48 hours."
    ],
    "extra_care_tip": [
        "Pruning is important to maintain shape, remove dead wood, and allow light penetration through the canopy.",
        "Regular monitoring for pests such as macadamia nut borer and applying appropriate controls is necessary."
    ]
}