{
    "name": "Madagascar Periwinkle",
    "climate": [
        "Madagascar Periwinkle thrives in tropical to subtropical climates, interacting well with warm temperatures.",
        "It can also adapt to temperate climates, provided it is protected from cold and frost.",
        "In cooler climates, it is often grown as an annual or can be overwintered indoors.",
        "Humidity levels should be moderate; too much humidity can lead to fungal diseases."
    ],
    "sunlight": [
        "This plant prefers full sun exposure, which helps it to produce more vibrant blooms.",
        "It can tolerate partial shade but may lead to less flowering if sunlight is insufficient.",
        "Direct sunlight is ideal for optimal growth, but in very hot regions, some afternoon shade can be beneficial.",
        "Ensuring about six to eight hours of sunlight daily promotes healthy foliage and blooms."
    ],
    "watering": [
        "Madagascar Periwinkle prefers consistently moist soil but should not be waterlogged.",
        "Watering should be reduced in winter or during periods of lower growth to prevent root rot.",
        "Allow the top inch of soil to dry out between waterings to maintain optimal moisture levels.",
        "Overwatering can lead to fungal diseases and root problems; ensure proper drainage."
    ],
    "soil": [
        "The plant grows best in well-draining soil with a slightly acidic to neutral pH level.",
        "A sandy or loamy soil mix can enhance drainage, reducing the risk of water retention.",
        "Soil enriched with organic matter can provide necessary nutrients for robust growth.",
        "Avoid heavy clay soils unless amendments are made to improve texture and drainage."
    ],
    "toxic": [
        "Madagascar Periwinkle is toxic to both humans and pets if ingested, containing alkaloids.",
        "Symptoms of poisoning may include stomach pain, vomiting, diarrhea, and in severe cases, neurological effects."
    ],
    "extra_care_tip": [
        "Prune regularly to encourage bushy growth and remove any diseased or dead foliage.",
        "Regular fertilization during the growing season can boost flower production and overall health."
    ]
}