{
    "name": "Mahonia",
    "climate": [
        "Mahonia plants thrive best in a temperate climate, with moderate rainfall throughout the year, providing a balanced growth environment.",
        "These plants are adaptable to various climates but prefer mild winters and cool to warm summers, avoiding extreme temperatures.",
        "Mahonia species can tolerate partial shade and are often found in woodland garden areas that replicate their native forest conditions.",
        "They are well-suited to areas with good humidity levels, as excessively dry conditions may cause stress and poor growth."
    ],
    "sunlight": [
        "Mahonia plants prefer partial to full shade, as direct sunlight for extended periods can lead to leaf scorching.",
        "These shrubs are excellent for shaded garden spots, growing well under tall trees or beside buildings where sunlight is filtered.",
        "Morning sun with afternoon shade can be ideal for Mahonia, minimizing stress from harsh midday sunlight exposure.",
        "Too much shade can reduce flowering and cause leggy growth, so balanced light conditions are important."
    ],
    "watering": [
        "Regular watering is crucial for Mahonia, keeping the soil consistently moist but not waterlogged, ensuring healthy root development.",
        "During dry spells, increase the frequency of watering to prevent the soil from drying out completely, which can hamper growth.",
        "Avoid overwatering as it can lead to root rot; ensure proper drainage is in place to keep plant health in check.",
        "Mulching around the base helps retain soil moisture and moderate temperature, reducing watering frequency slightly."
    ],
    "soil": [
        "Mahonia prefers well-drained, rich, loamy soil that is high in organic matter for optimal growth and flowering.",
        "These plants tolerate various soil types, including clay, as long as drainage is adequate and there is no water stagnation.",
        "Amending the soil with compost can improve fertility and structure, providing necessary nutrients for lush foliage.",
        "Acidic to neutral soil pH levels are ideal, helping to facilitate nutrient uptake and reduce the risk of nutrient lockout."
    ],
    "toxic": [
        "Mahonia berries are mildly toxic if ingested in large quantities, potentially causing stomach discomfort.",
        "While not deadly, they should be kept out of reach of young children and pets to prevent accidental consumption."
    ],
    "extra_care_tip": [
        "Prune Mahonia plants after flowering to maintain shape and encourage bushiness, removing dead or damaged stems.",
        "Protect from strong winds and frost, as these conditions can cause damage, especially in young or tender plants."
    ]
}