{
    "name": "Mangolia Tripetala",
    "climate": [
        "Magnolia tripetala thrives in temperate climates with distinct, mild seasonal changes.",
        "It prefers areas with humid summers and cool to cold winters for optimal growth.",
        "This species can tolerate a range of temperatures but is best in moderate climates.",
        "Magnolia tripetala is not suitable for very hot or extremely harsh chilly climates."
    ],
    "sunlight": [
        "Magnolia tripetala grows well in full sun, which is defined as six or more hours of direct sunlight.",
        "Partial shade is also suitable, meaning it gets between four to six hours of sunlight daily.",
        "While it can tolerate partial shade, too much shade may inhibit its flowering potential.",
        "Ensure it receives adequate light exposure for healthy growth and successful blooms."
    ],
    "watering": [
        "It requires consistently moist soil conditions, especially during dry periods to thrive.",
        "Magnolia tripetala benefits from regular watering but avoid waterlogging the roots.",
        "Ensure soil is well-drained to prevent any water accumulation around the root system.",
        "During the growing season, provide deep watering to reach the deeper roots."
    ],
    "soil": [
        "Magnolia tripetala prefers fertile, loam-based soils that are rich in organic content.",
        "The soil should be well-draining while still retaining enough moisture for the roots.",
        "Neutral to slightly acidic soil pH is ideal, supporting healthy nutrient absorption.",
        "Avoid compacted or very sandy soils as they do not provide sufficient nutrition."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Mulch around the base to retain moisture and regulate soil temperature effectively.",
        "Pruning should be done after flowering to maintain the desired shape and size.",
        "Regularly check for pests such as magnolia scale, and treat as necessary promptly.",
        "Ensure a consistent moisture supply, especially during dry spells for optimal health."
    ]
}