{
    "name": "Manjula Pothos",
    "climate": [
        "Manjula Pothos prefers a warm and humid environment typical of tropical regions.",
        "This plant thrives best in temperatures between 65-85 degrees Fahrenheit.",
        "Avoid exposing the plant to cold drafts or temperatures below 50 degrees Fahrenheit.",
        "Maintaining a consistent environment with adequate humidity levels is beneficial."
    ],
    "sunlight": [
        "Manjula Pothos needs bright, indirect light for optimal growth.",
        "Direct sunlight can cause the leaves to scorch, so it's best to avoid it.",
        "Fluorescent lighting can also support the growth of Manjula Pothos indoors.",
        "It can tolerate low light conditions but growth may be slower as a result."
    ],
    "watering": [
        "Water the plant once the top inch of the soil feels dry to the touch.",
        "Overwatering can lead to root rot, so avoid keeping the soil too wet.",
        "Ensure the pot has adequate drainage to prevent water from accumulating.",
        "During winter, watering frequency can be reduced as growth slows down."
    ],
    "soil": [
        "A well-draining potting mix is essential for Manjula Pothos' health.",
        "You can use a standard indoor plant potting mix with good aeration.",
        "Including materials like perlite or orchid bark can improve drainage.",
        "Avoid heavy soils that retain too much moisture, causing root issues."
    ],
    "toxic": [
        "Manjula Pothos is considered toxic to pets, including cats and dogs.",
        "Ingestion can cause oral irritation, vomiting, and difficulty swallowing.",
        "Keep the plant out of reach of small children and curious pets.",
        "Consult a veterinarian immediately if ingestion is suspected."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain the desired shape and promote bushier growth.",
        "Wipe leaves occasionally with a damp cloth to remove dust buildup.",
        "Fertilize every 4-6 weeks during the growing season with a balanced fertilizer.",
        "Rotate the plant periodically to ensure even light exposure on all sides."
    ]
}