{
    "name": "Marble Queen Pothos",
    "climate": [
        "Prefers a warm climate with temperatures between 65 and 85°F. Avoid exposing it to colder temperatures, as it is not frost resistant.",
        "Can thrive in high humidity levels, similar to its native tropical environments, but can also adapt to lower humidity levels indoors.",
        "Protect this plant from cold drafts and sudden temperature changes, as they can cause stress and damage to the plant.",
        "Although it can survive in various climates, it prefers environments that mimic its natural tropical habitat."
    ],
    "sunlight": [
        "Prefers bright, indirect sunlight but can tolerate low light conditions, making it versatile for indoor spaces.",
        "Direct sunlight can scorch the leaves, so it's best to place it in a spot where it receives filtered light.",
        "Can adapt to lower light conditions but may result in slower growth and less vibrant leaf variegation.",
        "For best results, a well-lit room with lots of filtered natural light is ideal for maintaining leaf color and health."
    ],
    "watering": [
        "Water when the top inch of soil is dry, generally every 1-2 weeks, depending on the environment and season.",
        "Ensure to not overwater; allow excess water to drain to prevent root rot, which can be detrimental to the plant's health.",
        "In lower light or cooler conditions, reduce watering frequency to avoid waterlogged soil.",
        "Mist the foliage occasionally to increase humidity around the plant, especially in dry indoor air, but avoid letting water stand on leaves."
    ],
    "soil": [
        "Thrives in a well-draining potting mix that holds moisture but doesn't remain soggy, such as a peat-based mix.",
        "Ideal soil should be rich in organic matter to provide essential nutrients while allowing adequate airflow to the roots.",
        "Combine equal parts potting soil, peat moss, and perlite for a balanced mix that encourages healthy growth.",
        "Avoid heavy or clay-based soils, as they retain too much water and can lead to root rot, impacting the plant's vitality."
    ],
    "toxic": [
        "Toxic to pets, including cats and dogs, causing oral irritation, vomiting, and difficulty swallowing.",
        "Contains calcium oxalate crystals, which can cause adverse reactions if ingested by animals or humans."
    ],
    "extra_care_tip": [
        "Regularly wipe the leaves with a damp cloth to remove dust and keep the plant looking vibrant while improving photosynthesis.",
        "Consider using a balanced fertilizer monthly during the growing season to promote vigorous growth and healthier foliage."
    ]
}