{
    "name": "Marshmallow",
    "climate": [
        "Marshmallow plants thrive in temperate climates where the temperatures are moderate and consistent.",
        "In cooler climates, marshmallow plants may require some additional protection or care during colder temperatures.",
        "They are adaptable to different moisture levels, making them suitable for marshy regions with fluctuating conditions.",
        "These plants can grow well in maritime climates, where the proximity to large bodies of water provides a stable environment."
    ],
    "sunlight": [
        "Marshmallow plants prefer full sun, requiring at least six to eight hours of direct sunlight daily.",
        "When grown in partial shade, marshmallow plants might not achieve optimal growth, affecting flower and root production.",
        "Even though they can tolerate some shade, it is essential that marshmallow plants receive direct sunlight regularly.",
        "In hotter climates, some afternoon shade can be beneficial to prevent excessive moisture loss in marshmallow plants."
    ],
    "watering": [
        "Marshmallow plants require regular watering, especially during dry spells, to maintain their moisture levels.",
        "They prefer consistent moisture and do not tolerate completely dry soils or prolonged periods of drought.",
        "It is essential to ensure that marshmallow plants are not overwatered, as this can lead to root rot or fungal problems.",
        "During the growing season, marshmallow plants benefit from frequent irrigation, mimicking their natural marshy habitat."
    ],
    "soil": [
        "Marshmallow plants thrive in loamy or clay soils that retain moisture while offering adequate drainage.",
        "They prefer slightly acidic to neutral soils, which provide a supportive environment for nutrient uptake.",
        "The soil should be enriched with organic matter to ensure that the marshmallow plant has access to essential nutrients.",
        "Compacted or poorly drained soils are unsuitable for marshmallow plants and can lead to poor growth or diseases."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regularly check for pests such as aphids that might affect the foliage of the marshmallow plant.",
        "Mulching around the base of marshmallow plants can help retain soil moisture and regulate ground temperature.",
        "Pruning back spent flowers and older stems can promote new growth and maintain plant health.",
        "In colder climates, applying a layer of mulch or garden fleece can protect marshmallow plants during winter."
    ]
}