{
    "name": "Marsh Marigold",
    "climate": [
        "Marsh marigold thrives in temperate climate zones where winters are cold.", 
        "It is well-suited to regions with wetland environments and high humidity.", 
        "This plant can also grow in areas with cool summer temperatures.", 
        "Ideal climate conditions include areas with abundant rainfall over the year."
    ],
    "sunlight": [
        "Marsh marigold requires full sun to part shade for optimal growth.", 
        "This plant can handle morning sun and afternoon shade conditions.", 
        "It thrives in open areas with diffused sunlight and partial cover.", 
        "Too much shade might hinder its flowering and growth development."
    ],
    "watering": [
        "Marsh marigold prefers constantly moist to wet soil conditions.", 
        "It's essential to keep the soil consistently damp, especially in hotter months.", 
        "Waterlogged conditions simulating a marsh or bog are ideal for this plant.", 
        "Ensure water levels are high enough to cover roots during dry spells."
    ],
    "soil": [
        "Soil for marsh marigold should be rich in organic matter and nutrients.", 
        "It thrives in loose, well-draining substrates like silt or loam.", 
        "The plant is adaptable to acidic soil conditions commonly found in wetlands.", 
        "A muddy or boggy soil environment supports its natural growth habits."
    ],
    "toxic": [
        "All parts of the marsh marigold plant are toxic if ingested.", 
        "Contact with the plant may cause skin irritation or an allergic reaction.", 
        "Toxicity levels decrease when the plant is cooked or dried.", 
        "Ensure pets and children do not consume or handle the plant carelessly."
    ],
    "extra_care_tip": [
        "In frost-prone areas, consider covering the plant to prevent root damage.", 
        "Remove dead or decaying foliage to maintain plant health and aesthetics.", 
        "Provide extra moisture during dry spells to prevent stress to the plant.", 
        "It's beneficial to mimic a natural marsh environment for key growth."
    ]
}