{
    "name": "Mastic Tree",
    "climate": ["The Mastic Tree thrives in a Mediterranean climate, which typically has wet winters and hot, dry summers.", "This plant is well-suited for coastal climates that experience mild temperatures throughout the year.", "It can withstand semi-arid climates, as it has adapted to survive in regions with minimal rainfall.", "The Mastic Tree is also capable of growing in subtropical environments that do not experience frost."],
    "sunlight": ["The Mastic Tree requires full sun exposure to thrive, which means it needs at least six hours of direct sunlight per day.", "While it can tolerate partial shade, full sun is essential for optimum resin production and healthy growth.", "Insufficient sunlight might lead to stunted growth and reduced vitality, making full sun preferable.", "This plant is well-adapted to bright, sunny locations commonly found in its native environment."],
    "watering": ["The Mastic Tree is drought-tolerant once established, requiring infrequent but deep watering during dry spells.", "Overwatering can be detrimental, so it’s important to allow the soil to dry out between waterings.", "Water sparingly during winter months, as the tree goes dormant and requires less moisture.", "It's crucial to avoid waterlogging conditions, which can harm the root system and overall health of the tree."],
    "soil": ["The Mastic Tree prefers well-draining, sandy soils that mimic its natural Mediterranean habitat.", "Soils rich in organic matter may encourage better growth but must remain well-draining to prevent root rot.", "It can tolerate poor, rocky soils, making it a versatile choice for less fertile ground.", "While it adapts to various soil types, alkaline soils are particularly suitable for healthy growth."],
    "toxic": [],
    "extra_care_tip": ["Prune the Mastic Tree regularly to maintain its shape and encourage bushier growth, especially if grown ornamentally.", "Applying mulch around the base can help retain soil moisture and regulate temperature, especially in hotter climates."]
}