{
    "name": "Mediterranean Fan Palm",
    "climate": [
        "Mediterranean Fan Palms thrive in warm, temperate climates where frost is infrequent.",
        "They are well-suited to regions with a Mediterranean climate, featuring dry summers.",
        "These palms prefer climates with mild, wetter winters and very little risk of snow.",
        "While they tolerate brief cold spells, prolonged cold temperatures are detrimental."
    ],
    "sunlight": [
        "Mediterranean Fan Palms require full sun exposure for optimal growth and health.",
        "While they can withstand some light shade, full sunlight promotes better foliage production.",
        "In shaded conditions, growth may be stunted and the plant may become leggy.",
        "Well-lit areas are preferable to ensure robust and vibrant foliage development."
    ],
    "watering": [
        "Regular watering is essential, especially during the first few years after planting.",
        "Ensure the soil remains moist but not waterlogged, avoiding standing water.",
        "As the plant establishes, it becomes more drought-tolerant, needing less frequent watering.",
        "In hot, dry climates, supplemental watering may be necessary during prolonged dry spells."
    ],
    "soil": [
        "Mediterranean Fan Palms grow best in well-draining soils to prevent root rot.",
        "A sandy or loamy soil mix is ideal, allowing water to drain efficiently.",
        "They are adaptable to various soil types, but good drainage is crucial for health.",
        "Amend heavy clay soils with organic matter to improve drainage and aeration."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune dead or damaged fronds regularly to maintain plant appearance and health.",
        "Protect young plants from frost damage using frost cloths or similar covers during cold spells.",
        "Use a balanced fertilizer to promote growth during the growing season, especially in poor soils.",
        "Keep an eye out for pests such as spider mites and treat them promptly to prevent infestation."
    ]
}