{
    "name": "Mexican Marigolds",
    "climate": [
        "Mexican Marigolds thrive in warm climates, preferring temperatures that seldom drop below 60°F.",
        "These plants can tolerate a variety of climates, but they are best suited to areas with full sun exposure.",
        "In temperate climates, they are often grown as annuals, as frost can damage them.",
        "They are heat-tolerant and can withstand the dry conditions often found in Mediterranean climates."
    ],
    "sunlight": [
        "Mexican Marigolds require full sun to bloom profusely; they perform best with at least 6 hours of sunlight.",
        "Without adequate sunlight, the plants may flower less frequently and the blooms could be smaller.",
        "They are well-suited for sunny borders, where they receive ample daylight throughout the growing season.",
        "Insufficient sun can lead to leggy growth and diminished overall plant health and appearance."
    ],
    "watering": [
        "Consistent watering is essential, particularly during the growing season, to ensure healthy blooms.",
        "Allow the soil to dry slightly between waterings to prevent root rot, especially in containers.",
        "Overwatering Mexican Marigolds can lead to fungal diseases, so ensure proper drainage.",
        "During hotter months, increase watering frequency, but be careful not to water excessively."
    ],
    "soil": [
        "Mexican Marigolds prefer well-draining soil that is moderately fertile to promote robust growth.",
        "They can tolerate poor soil conditions, but the addition of organic matter can enhance performance.",
        "A neutral to slightly acidic soil pH is ideal, though they can adapt to a range of soil types.",
        "Clay-heavy soils should be amended with sand or gravel to improve drainage capabilities."
    ],
    "toxic": ["Mexican Marigolds are considered toxic to cats and dogs, causing mild gastrointestinal distress if ingested."],
    "extra_care_tip": ["Deadheading spent blooms can encourage Mexican Marigolds to produce more flowers throughout the season."]
}