{
    "name": "Mexican Bush Sage",
    "climate": [
        "Mexican Bush Sage thrives in warm and temperate climates. It prefers areas where summers are long and winters are mild, making it suitable for USDA zones 8 to 11.",
        "This plant can withstand some drought conditions but does best with consistent warmth. It benefits from climates with consistent rainfall or regular irrigation.",
        "It is ideal for growing in regions that do not experience frost, as frost can damage its foliage and reduce its growth potential.",
        "Humidity levels should be moderate; while it can tolerate dry air, regions with extremely high humidity might affect its growth."
    ],
    "sunlight": [
        "Mexican Bush Sage requires full sun for most of the day to thrive. It is best grown in locations where it receives at least six to eight hours of direct sunlight daily.",
        "This plant can tolerate light shade, but lack of sufficient sunlight can lead to less vibrant flowering and leggy growth habits.",
        "While it is adaptable to varying light conditions, optimal flowering and vigor occur when it is placed in spots with unobstructed sunlight.",
        "In very hot climates, some afternoon shade can be beneficial to prevent scorching, but overall, it flourishes best in sunny environments."
    ],
    "watering": [
        "Mexican Bush Sage enjoys well-drained soil; overwatering can lead to root rot and other related diseases. Watering should be deep but less frequent, allowing the soil to dry slightly between sessions.",
        "In its active growing season, it may require more regular watering to support its lush growth and prolific blooming habits.",
        "The plant is somewhat drought-tolerant once established but will perform optimally with consistent moisture available in the soil.",
        "Heavy or waterlogged soils should be avoided; ensure good drainage to prevent water from sitting around the roots."
    ],
    "soil": [
        "Mexican Bush Sage prefers soil that is light, airy, and well-draining to support healthy root systems and vigorous growth.",
        "A sandy or loamy soil composition works well, and adding organic matter can improve soil fertility and drainage characteristics.",
        "While it is adaptable to various soil types, ensuring that the soil pH is neutral to slightly acidic will help it flourish.",
        "Compacted or clay-heavy soils can impede growth; amend such soils with sand or compost to enhance their structure and drainage."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To encourage a bushier growth habit, prune back taller stems after flowering seasons. This will promote denser foliage and more prolific blooms.",
        "Protect the plant from extreme cold by covering it during unexpected frost events or by growing it in containers that can be moved indoors."
    ]
}