{
    "name": "Mona Lavender",
    "climate": [
        "Mona Lavender thrives in a warm climate, ideally between 65-75°F. It cannot tolerate frost and should be kept indoors during colder months.",
        "This plant enjoys humidity levels similar to its native tropical habitat. It benefits from regular misting to mimic tropical conditions.",
        "It's best to protect Mona Lavender from extreme temperature swings; avoid placing it near drafts or heat sources to keep it healthy.",
        "Grow Mona Lavender in USDA hardiness zones 9-11; in cooler zones, it should be treated as an annual or moved indoors."
    ],
    "sunlight": [
        "Mona Lavender prefers bright, indirect sunlight to thrive; direct sun can scorch its leaves.",
        "In its native habitat, it grows under a canopy, so providing filtered sunlight is ideal for healthy growth.",
        "Too little light can result in leggier growth and reduced flowering, so ensure it receives adequate illumination.",
        "If grown indoors, placing it near an east or west-facing window can provide the right light conditions for Mona Lavender."
    ],
    "watering": [
        "Water Mona Lavender regularly, allowing the top inch of soil to dry out before watering again to avoid overwatering.",
        "Consistent moisture is key, but avoid waterlogging, as this can lead to root rot in the plant.",
        "Reduce the frequency of watering during dormant winter months but do not allow the soil to become completely dry.",
        "It's important to ensure proper drainage, so empty any standing water from saucers and use well-draining pots."
    ],
    "soil": [
        "A well-draining soil mix, such as one meant for African violets, is ideal for Mona Lavender as it provides needed aeration.",
        "The soil should retain some moisture but not be soggy, helping to prevent root rot and other water-related issues.",
        "Incorporating perlite or sand can enhance drainage and improve soil structure, benefiting overall plant health.",
        "Regular potting soil with added peat or coconut coir can also work, maintaining a balance of moisture retention and drainage."
    ],
    "toxic": [
        "Mona Lavender is non-toxic to pets and humans, making it a safe choice for households with animals or children."
    ],
    "extra_care_tip": [
        "Prune Mona Lavender regularly to encourage bushier growth and remove spent flowers to promote continuous blooming throughout the growing season."
    ]
}