{
    "name": "Monkey Tail",
    "climate": [
        "Monkey Tail cactus thrives in hot, dry desert climates typically found in South America.",
        "This plant adapts well to arid regions with drastic temperature changes between day and night.",
        "It is suited to subtropical climates, avoiding frost and high humidity environments.",
        "While it prefers arid conditions, it can tolerate light rainfall during its dormant winter period."
    ],
    "sunlight": [
        "Monkey Tail cactus needs bright, direct sunlight for most of the day to thrive and bloom profusely.",
        "It can tolerate indirect sunlight, but this will reduce its blooming potential and overall growth.",
        "Placing it in a south-facing window indoors can replicate the full sun conditions it requires.",
        "Due to its sunlight needs, it grows best in environments where daylight exceeds six hours daily."
    ],
    "watering": [
        "Water the Monkey Tail cactus sparingly, allowing the soil to dry completely between waterings.",
        "During the active growing season, provide a thorough watering approximately every two weeks.",
        "In its dormant winter period, reduce watering significantly to prevent excess moisture.",
        "Overwatering can lead to root rot, so ensure the container has proper drainage holes."
    ],
    "soil": [
        "Use a well-draining, gritty cactus mix for Monkey Tail cactus to prevent root rot.",
        "A mixture of perlite, sand, and potting soil can create ideal drainage conditions.",
        "Ensure the soil remains airy and does not compact over time, allowing oxygen flow to roots.",
        "Including a layer of gravel at the bottom of the pot enhances drainage efficiency."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Provide sturdy support as Monkey Tail cactus stems grow longer and heavier over time.",
        "Protect the plant from extreme cold, as temperatures below 50°F can damage it.",
        "Repot the plant when it becomes root-bound, ideally every couple of years in spring.",
        "Handle with care to avoid damaging the delicate spines, which can break easily."
    ]
}