{
    "name": "Monstera Subpinnata",
    "climate": [
        "Monstera Subpinnata thrives in tropical climates with high humidity.",
        "It requires warm temperatures and can be sensitive to cold conditions.",
        "The plant prefers an environment with consistent moisture levels.",
        "Avoid exposing it to extremely dry or desert-like climates."
    ],
    "sunlight": [
        "This plant prefers bright, indirect sunlight for optimal growth.",
        "It can tolerate some direct morning sun but avoid harsh midday sunlight.",
        "Too much direct sunlight can cause the leaves to scorch and become damaged.",
        "In low light conditions, growth may slow, but the plant can survive."
    ],
    "watering": [
        "Monstera Subpinnata needs regular watering, keeping the soil moist.",
        "Allow the top inch of soil to dry out slightly between waterings.",
        "Overwatering can lead to root rot, so avoid letting it sit in water.",
        "Underwatering can cause the leaves to wilt and the plant to suffer."
    ],
    "soil": [
        "A well-draining potting mix is essential for this plant's health.",
        "The soil should be rich in organic matter, providing nutrients.",
        "A mix containing peat, perlite, and pine bark is often recommended.",
        "Ensure the soil pH is between 5.5 and 7.5 for proper nutrient uptake."
    ],
    "toxic": [
        "Monstera Subpinnata is toxic to pets if ingested and can cause irritation.",
        "Symptoms of toxicity include oral irritation, drooling, and difficulty swallowing.",
        "Ensure that pets and small children do not chew on or ingest any part of the plant."
    ],
    "extra_care_tip": [
        "Provide a moss pole or support for aerial roots to encourage climbing.",
        "Wiping leaves regularly with a damp cloth can remove dust and pests.",
        "Misting the plant occasionally increases humidity and prevents dryness.",
        "Repot every couple of years to refresh the soil and provide room for growth."
    ]
}