{
    "name": "Monstera Acacoyaguensis",
    "climate": [
        "Monstera Acacoyaguensis thrives in tropical climates where humidity is high. It prefers warm temperatures typical of Central American regions.",
        "This plant does well in a consistent warm environment with no drastic temperature changes. Frost and cold temperatures can damage it.",
        "It is native to regions where temperatures range from 65°F to 80°F most of the time, and where it can receive the constant moisture it requires.",
        "Monstera Acacoyaguensis prefers a hot and humid environment similar to rainforests where it originates and can struggle in dry air."
    ],
    "sunlight": [
        "Monstera Acacoyaguensis needs bright, indirect sunlight for optimal growth. Direct sunlight can scorch its leaves.",
        "In its native habitat, it receives dappled sunlight as it often grows under the canopy of taller trees, avoiding direct sun exposure.",
        "This plant prefers environments with sunlight filtered through sheer curtains if kept indoors to simulate its natural shade environment.",
        "While adaptable, it can tolerate lower light levels, although growth might slow down considerably without proper lighting."
    ],
    "watering": [
        "Regular watering is essential, keeping the soil consistently moist but not waterlogged. Overwatering can lead to root rot.",
        "Watering frequency can depend on the season, with more frequent watering in the growing season and less during dormancy.",
        "It is essential to use well-draining soil to prevent standing water, ensuring that the pot has drainage holes for excess water to escape.",
        "Humidity trays or room humidifiers can help maintain the high humidity levels that Monstera Acacoyaguensis prefers."
    ],
    "soil": [
        "The best soil is a loose and well-draining mix often containing ingredients like perlite and peat moss for aeration.",
        "A soil mixture with good organic matter is beneficial, promoting healthy root growth and retaining sufficient moisture without waterlogging.",
        "Avoid compact and heavy soils which can suffocate the roots, leading to poor plant health or root rot in excessive moisture conditions.",
        "Soil should allow for adequate drainage while providing enough support for the plant’s aerial roots to establish themselves effectively."
    ],
    "toxic": [
        "Monstera Acacoyaguensis is toxic to both cats and dogs. Ingestion can cause oral irritation, drooling, and difficulty swallowing.",
        "It contains calcium oxalate crystals which are also harmful to humans if ingested, causing irritation and swelling in the mouth and throat."
    ],
    "extra_care_tip": [
        "Regularly clean the plant's leaves with a damp cloth to remove dust and allow efficient photosynthesis.",
        "Provide support, such as a moss pole, for the climbing habit of this plant, allowing it to grow upright in indoor conditions."
    ]
}