{
    "name": "Monstera Albo",
    "climate": [
        "Monstera Albo thrives best in a tropical climate where temperatures are warm year-round.",
        "It is well-suited for climates with high humidity levels, typically above 60%.",
        "Avoid freezing temperatures as they can cause significant damage to the plant.",
        "Monstera Albo prefers consistent temperatures between 65°F to 85°F for optimal growth."
    ],
    "sunlight": [
        "This plant prefers bright, indirect sunlight to flourish and develop its unique variegation.",
        "Direct sunlight can scorch the leaves, making shade or filtered light ideal for growth.",
        "Monstera Albo can tolerate low light, but it may result in slower growth and less variegation.",
        "Position near an east or north-facing window is optimal for balanced sunlight exposure."
    ],
    "watering": [
        "Water consistently to keep the soil evenly moist but ensure good drainage to avoid root rot.",
        "Allow the top inch of soil to dry out between waterings to prevent overwatering.",
        "During the growing season, increase watering frequency to support active growth.",
        "Reduce watering in winter, as the plant's growth slows and it requires less moisture."
    ],
    "soil": [
        "Monstera Albo thrives in a rich, well-draining potting mix to support root health.",
        "A combination of peat moss, perlite, and orchid bark provides optimal soil structure.",
        "Ensure the soil has good aeration and drains excess water efficiently to prevent waterlogging.",
        "A slightly acidic to neutral pH level in the soil is ideal for this plant's growth requirements."
    ],
    "toxic": [
        "This plant is toxic to pets if ingested, causing irritation and swelling in the mouth and throat."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to remove dust and enhance photosynthesis.",
        "Rotate the plant periodically to ensure even growth and light exposure on all sides."
    ]
}