{
    "name": "Monstera Pinnatipartita",
    "climate": [
        "Monstera Pinnatipartita thrives in warm, humid tropical climates similar to Southeast Asia.",
        "It prefers temperatures between 65°F to 85°F and does not tolerate frost or cold environments.",
        "This plant is not suitable for arid or semi-arid climates, requiring more moisture in the air.",
        "Ideally suited for USDA zones 10-12, mimicking its natural habitat with consistent warmth."
    ],
    "sunlight": [
        "Monstera Pinnatipartita grows best in bright, indirect sunlight to avoid leaf scorching.",
        "Direct sunlight can damage the leaves, causing them to burn or turn yellow over time.",
        "If natural light is insufficient, artificial grow lights can maintain healthy growth.",
        "Low-light conditions may stunt growth, so balancing light exposure is essential."
    ],
    "watering": [
        "Water when the top inch of soil feels dry, ensuring thorough drainage to prevent root rot.",
        "Overwatering is a common mistake; allowing excess water to drain out of the pot is crucial.",
        "Humidity around the plant should be higher than average, regularly misting the leaves helps.",
        "During winter, reduce watering frequency as the plant's growth slows down considerably."
    ],
    "soil": [
        "A well-draining soil mix, such as peat-based potting soil with perlite, works well.",
        "Monstera Pinnatipartita benefits from an aerated mix to allow root breathing and prevent compaction.",
        "Avoid dense, heavy soils that retain too much moisture, risking root health and plant stability.",
        "Adding orchid bark or coconut coir can improve drainage and mimic its natural environment."
    ],
    "toxic": [
        "Monstera Pinnatipartita is toxic to pets and humans if ingested, causing oral irritation."
    ],
    "extra_care_tip": [
        "To promote leaf fenestration, ensure enough humidity and indirect light, and consider occasional fertilization."
    ]
}