{
    "name": "Monstera Dubia",
    "climate": [
        "Monstera Dubia thrives in a tropical climate with high humidity levels, imitating its native environment.",
        "Prefers a temperature range of 65 to 85 degrees Fahrenheit for optimal growth and health.",
        "Avoid temperatures below 55 degrees Fahrenheit as it affects the plant's growth and could lead to stress.",
        "Humidity should ideally be above 60% to mimic the natural forest conditions and promote healthy growth."
    ],
    "sunlight": [
        "Prefers bright, indirect light to ensure healthy and vibrant leaf growth without scorching.",
        "Avoid direct sunlight as it can burn the leaves, causing browning and damage to the plant.",
        "Thrives in a spot with filtered sunlight, similar to dappled light found under forest canopies.",
        "Can tolerate low light conditions but may result in slower growth and less variegation."
    ],
    "watering": [
        "Keep the soil consistently moist but not waterlogged to prevent root rot and ensure healthy growth.",
        "Water thoroughly when the top inch of soil feels dry, reducing frequency in cooler months.",
        "Use room-temperature water to avoid shocking the plant, ensuring even moisture distribution.",
        "Ensure good drainage to prevent root diseases by allowing excess water to escape the pot."
    ],
    "soil": [
        "Prefers a well-aerated soil mix with good drainage to accommodate its epiphytic nature.",
        "A mixture of potting soil, perlite, and orchid bark is ideal for providing root support.",
        "Soil should retain moisture without becoming waterlogged, resembling the natural forest floor.",
        "Adding sphagnum moss or coconut coir can help maintain moisture while providing aeration."
    ],
    "toxic": [
        "Monstera Dubia is considered toxic to pets and humans if ingested, causing irritation.",
        "Contains calcium oxalates that can cause mouth and throat irritation if consumed.",
        "Sap may also cause skin irritation and should be handled carefully to avoid contact.",
        "Keep out of reach of small children and pets to prevent accidental ingestion or contact."
    ],
    "extra_care_tip": [
        "Provide a climbing structure such as a trellis to support its natural growth pattern.",
        "Mist regularly to maintain high humidity levels, especially in dry indoor environments.",
        "Prune yellow or damaged leaves to encourage new growth and maintain plant health.",
        "Rotate the plant periodically to ensure even growth and exposure to light on all sides."
    ]
}