{
    "name": "Monstera Esqueleto",
    "climate": [
        "Monstera Esqueleto prefers a tropical climate with high humidity. It thrives best in conditions that mimic the rainforest, where warmth and moisture abound.",
        "This plant does well in temperatures ranging from 18°C to 27°C. It should be protected from cold drafts and temperatures below 12°C as it can cause stress to the plant.",
        "It is advisable to maintain consistent humidity levels of around 60% to 80%. Low humidity can lead to brown leaf tips and overall poor plant health.",
        "While the plant can adapt to medium humidity, it is optimal to simulate the tropical environment with periodic misting or the use of a humidifier."
    ],
    "sunlight": [
        "Monstera Esqueleto prefers bright, indirect sunlight to grow optimally. Direct sun can scorch its leaves, causing damage.",
        "It can tolerate lower light conditions but may exhibit slow growth. Still, it thrives better when given ample, diffused light.",
        "Avoid placing this plant in a spot with direct afternoon sun as it can lead to leaf burn due to the intensity of the sunlight.",
        "The plant can be placed near a window with sheer curtains to diffuse the sunlight or in filtered light emitted by blinds."
    ],
    "watering": [
        "Monstera Esqueleto should be watered when the top inch of soil feels dry. Overwatering can lead to root rot, which is devastating for the plant.",
        "During the growing season, water the plant more frequently while ensuring that the soil does not become waterlogged.",
        "In the winter months, reduce watering as the plant's growth slows, allowing the soil to dry out a little more between watering sessions.",
        "Always use room temperature water to avoid shocking the plant, and ensure that your pot has adequate drainage."
    ],
    "soil": [
        "A well-draining potting mix is crucial for Monstera Esqueleto. An ideal mix consists of peat, pine bark, and perlite or vermiculite.",
        "The soil needs to retain some moisture but should not remain soggy. This balance helps prevent root rot issues.",
        "Ensure the soil pH is slightly acidic to neutral, typically ranging from 5.5 to 7.0. This range supports optimal nutrient uptake.",
        "Repotting every couple of years helps refresh the soil's nutrients and keeps the plant's growth vigorous and healthy."
    ],
    "toxic": [
        "Monstera esqueleto is toxic to cats, dogs, and humans if ingested. The plant contains calcium oxalate crystals."
    ],
    "extra_care_tip": [
        "Use a moss pole to support the plant, allowing it to climb and encouraging larger leaf development."
    ]
}