{
    "name": "Moonshine",
    "climate": ["Moonshine sansevieria prefers warm climates typical of tropical regions.", "It thrives well in temperatures ranging from 65°F to 85°F, avoiding cold drafts.", "This plant enjoys a humid climate, making it ideal for indoor growing during colder months.", "The plant is not frost-hardy and should be kept indoors where temperatures can be controlled."],
    "sunlight": ["Moonshine sansevieria prefers bright, indirect sunlight for optimal growth.", "Though able to tolerate low light conditions, bright light keeps its leaves vibrant.", "Avoid direct sunlight as it may cause leaf burn or fading of its unique colors.", "Fluorescent lighting can substitute natural light in offices or dim spaces."],
    "watering": ["Allow the soil to dry completely between waterings to prevent root rot.", "This plant is drought-tolerant, requiring less frequent watering especially in winters.", "Water thoroughly and let excess water drain out to avoid waterlogged soil.", "Overwatering is the most common mistake; better to err on the side of under-watering."],
    "soil": ["Use a well-draining potting mix like cactus mix to prevent water retention.", "Adding perlite or coarse sand can enhance drainage in regular potting soil.", "Avoid heavy clay soils; they retain too much moisture for Moonshine sansevieria.", "Soil should be light and airy, providing sufficient root aeration for health."],
    "toxic": ["Leaves contain saponins that are toxic to pets if ingested, causing nausea.", "Keep plants out of reach of pets and children to avoid accidental ingestion.", "Symptoms of ingestion include drooling, vomiting, and lethargy in animals."],
    "extra_care_tip": ["Rotate the plant occasionally to ensure even growth and balanced shape.", "Wipe leaves periodically to remove dust and enhance efficiency of photosynthesis.", "Repotting every 2-3 years helps refresh soil nutrients and accommodate root growth.", "Monitor for pests like spider mites and treat promptly to prevent infestations."]
}