{
    "name": "Mulberry",
    "climate": [
        "Mulberry trees thrive in temperate climates with well-defined seasons, allowing them to grow robustly.",
        "They can also adapt to subtropical zones where the temperatures are relatively moderate year-round.",
        "Cold winters and warm summers create the perfect environment for the fruiting of mulberry trees.",
        "High humidity and occasional rainfall support their growth but they're somewhat drought-tolerant as well."
    ],
    "sunlight": [
        "Mulberry trees require full sun exposure for at least 6 hours a day to produce healthy fruits.",
        "They perform best in open locations where sunlight can reach the majority of the branches.",
        "Partially shaded sites may result in reduced fruit yield and slower growth of the mulberry tree.",
        "While some varieties can tolerate partial shade, full sun ensures the best possible fruit quality."
    ],
    "watering": [
        "Mulberry trees prefer consistent watering, especially during their first few years of establishment.",
        "Once established, they can tolerate some drought but will produce better with regular watering.",
        "It's essential to water deeply and ensure that the water reaches the root zone, especially in dry periods.",
        "Avoid waterlogging as it can lead to root rot; ensure the soil has good drainage for healthy growth."
    ],
    "soil": [
        "The mulberry tree grows best in well-draining soil, rich in organic matter to support root development.",
        "They can adapt to a range of soil types, including loam, clay, and sandy soils, as long as it drains well.",
        "A slightly acidic to neutral pH is ideal for the optimal growth and fruit production of mulberry trees.",
        "Adding compost or aged manure can enhance soil fertility and support the tree's vigorous growth."
    ],
    "toxic": [
        "Unripe mulberry fruits and the white sap from the branches and leaves can be mildly toxic if ingested."
    ],
    "extra_care_tip": [
        "Prune mulberry trees regularly to maintain shape, encourage fruiting, and remove any dead branches.",
        "Protect young trees from frost by covering them or planting in a sheltered spot to prevent frost damage."
    ]
}