{
    "name": "Munstead Lavender",
    "climate": ["Munstead Lavender thrives in Mediterranean climates that feature mild, wet winters and hot, dry summers.", "This plant grows best in temperate climates but is also quite tolerant of dry and arid conditions.", "Although it can tolerate some humidity, Munstead Lavender prefers climates that do not have high humidity levels.", "It is ideal for regions with a long growing season, which allows the lavender enough time to bloom properly."],
    "sunlight": ["Munstead Lavender requires full sun exposure to thrive; at least 6 to 8 hours of direct sunlight is ideal.", "This plant does well in environments where it receives ample sunlight without shade from buildings or trees.", "If grown indoors, place Munstead Lavender near a south-facing window that receives significant sunlight.", "Ensure that the plant is not in a shady area, as insufficient sunlight can hinder its growth and blooming."],
    "watering": ["Water Munstead Lavender sparingly, allowing the soil to dry out between waterings to prevent root rot.", "During dry periods, it is crucial to ensure that the lavender does not dry out completely, watering when the soil is dry to the touch.", "Be cautious not to overwater, as the plant prefers a drier environment rather than overly moist soil.", "In winter, reduce watering to prevent excess moisture since the plant is dormant and consumes less water."],
    "soil": ["Munstead Lavender requires well-drained, sandy or gritty soil, high in organic matter for optimal growth.", "The soil pH should be neutral to alkaline, as highly acidic soils can affect the plant's health negatively.", "It is essential to ensure that the soil mix allows for good air circulation to the roots to prevent any fungal disease.", "For container planting, use a specially formulated lavender soil or a general-purpose cactus mix for good drainage."],
    "toxic": [],
    "extra_care_tip": ["Prune Munstead Lavender annually after flowering to maintain its shape and promote healthy growth.", "Ensure good air circulation around the plant by spacing them out appropriately to avoid fungal diseases.", "Mulch around the base of the plant with gravel to improve drainage and keep the root zone dry.", "Avoid fertilizing the plant heavily as excessive nutrients can lead to poor blooms and leggy growth."]
}