{
    "name": "Naked Lady",
    "climate": [
        "The Naked Lady plant thrives in Mediterranean climates with mild, wet winters and hot, dry summers.",
        "It can also be grown in temperate regions where there is sufficient sunlight during its growing season.",
        "In areas with cold climates, it should be protected from severe frost and cold winds for optimal growth.",
        "This plant can adapt to climates with seasonal drought, particularly in its dormant period."
    ],
    "sunlight": [
        "Naked Lady plants require full sun exposure for at least six to eight hours a day to bloom well.",
        "They can tolerate light shade, but too much shade may result in fewer flowers and weaker growth.",
        "While they need good sunlight, extremely intense heat during summer midday should be avoided if possible.",
        "The plant will typically perform best when provided with undiluted sunshine in a warm environment."
    ],
    "watering": [
        "Water the Naked Lady plant regularly during its active growth period in spring and summer.",
        "It requires less watering during its dormant season when leaves and flowers have died back.",
        "Ensure that soil drainage is excellent to prevent waterlogging or root rot of the Naked Lady bulbs.",
        "Overwatering should be avoided especially during its dormancy as the bulbs can easily rot."
    ],
    "soil": [
        "Well-drained, sandy soil that mimics its natural habitat in rocky areas is ideal for the Naked Lady.",
        "The soil should be moderately fertile, allowing the roots to spread and anchor firmly for best growth.",
        "Heavy or clayey soil must be amended with sand or organic matter to enhance drainage and aeration.",
        "Ensure the soil pH is neutral to slightly acidic, which permits optimum nutrient uptake by the plant."
    ],
    "toxic": [],
    "extra_care_tip": [
        "It is important to divide the bulbs every few years to prevent overcrowding and to stimulate flowering.",
        "Bulbs should be planted with their neck just above the soil surface for best blooming results.",
        "In colder regions, applying a mulch in winter can help protect the bulbs from freezing conditions.",
        "Support the plant with stakes if the flowers appear to be too heavy for the stems, preventing breakage."
    ]
}