{
    "name": "Nanking Cherry",
    "climate": [
        "Nanking Cherry thrives in temperate climates with cold winters that help to break dormancy.",
        "The plant is well-suited to USDA hardiness zones 3 to 6, indicating a preference for cooler areas.",
        "Nanking Cherry can tolerate hot summers, but it requires cold periods to yield optimal fruit.",
        "This cherry variety is not well-suited for tropical climates due to its winter chilling requirement."
    ],
    "sunlight": [
        "Nanking Cherry requires full sunlight to ensure vigorous growth and fruit production.",
        "The plant should receive at least 6 to 8 hours of direct sunlight per day for best results.",
        "In shaded areas, Nanking Cherry may produce fewer blossoms and thus fewer fruits.",
        "It should be planted in a location that gets unobstructed sunlight for healthy development."
    ],
    "watering": [
        "Regular watering is essential during the first few years to establish a strong root system.",
        "Nanking Cherry prefers deep watering rather than frequent, shallow waterings to promote deep roots.",
        "During dry spells, ensuring consistent soil moisture helps to maintain fruit growth.",
        "Excessive watering should be avoided as it can lead to root rot and other fungal issues."
    ],
    "soil": [
        "Nanking Cherry grows best in well-draining soil that remains moist but not waterlogged.",
        "The ideal soil pH is slightly acidic to neutral, ranging from 6.0 to 7.0 in pH level.",
        "Sandy loam soils are perfect, as they provide good drainage while retaining necessary nutrients.",
        "Compacted or heavy clay soils should be amended with organic matter to improve aeration."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune Nanking Cherry in late winter to early spring to promote a healthy structure and remove dead wood.",
        "Mulching around the base of the plant helps retain soil moisture and regulate temperature.",
        "Protect the plant from pests like aphids with natural remedies or horticultural oils if needed.",
        "Nanking Cherry benefits from fertilization in early spring to support flowering and fruiting."
    ]
}