{
    "name": "Natal Plum",
    "climate": [
        "Natal Plums thrive in a Mediterranean climate where the winters are mild.",
        "They can tolerate some frost but prefer warm temperatures for optimal growth.",
        "These plants do well in coastal areas where humidity is moderate and manageable.",
        "Natal Plums are well-suited for subtropical regions with dry summers."
    ],
    "sunlight": [
        "Natal Plums require full sun exposure to produce the best fruit yield.",
        "They can tolerate partial shade but sunlight promotes abundant flowering.",
        "Direct sunlight for several hours daily ensures healthy plant growth.",
        "Filtered sunlight in extremely hot climates helps to prevent leaf burn."
    ],
    "watering": [
        "Natal Plums need moderate watering, allowing soil to dry out slightly between waterings.",
        "They are drought tolerant once established but perform better with regular moisture.",
        "Avoid overwatering to prevent root rot, which is detrimental to these shrubs.",
        "During prolonged dry spells, increase watering frequency to maintain vigor."
    ],
    "soil": [
        "Natal Plums prefer well-drained sandy loam soils rich in organic material.",
        "They can adapt to various soil types but drainage is key to avoid waterlogging.",
        "Soil pH should be slightly acidic to neutral for ideal nutrient availability.",
        "In coastal regions, ensure soil is not overly saline to avoid plant stress."
    ],
    "toxic": [
        "The fruit is edible when ripe, but all other parts of the plant can be toxic.",
        "Unripe fruit and plant exudates may cause gastrointestinal upset if ingested.",
        "It is important to keep animals and small children away from the plant.",
        "Symptoms of toxicity include nausea, vomiting, and diarrhea in humans."
    ],
    "extra_care_tip": [
        "Prune Natal Plums regularly to maintain shape and encourage bushier growth.",
        "During the growing season, use a balanced fertilizer for nutrient balance.",
        "Watch for pests such as scale insects and treat promptly to avoid damage.",
        "Mulching around the base helps retain soil moisture and suppress weeds."
    ]
}