{
    "name": "New Zealand Flax",
    "climate": [
        "New Zealand Flax thrives in temperate climates where winters are mild.",
        "It can adapt to subtropical conditions, making it versatile for many regions.",
        "This plant is quite hardy and can withstand coastal conditions with salty winds.",
        "It does best in areas with moderate rainfall and average humidity levels."
    ],
    "sunlight": [
        "New Zealand Flax prefers full sun but can tolerate partial shade.",
        "In sunny conditions, the leaves develop brighter and more vibrant colors.",
        "Partial shade is suitable, but it may lead to less vibrant foliage.",
        "A minimum of six hours of direct sunlight daily is ideal for optimal growth."
    ],
    "watering": [
        "Water New Zealand Flax regularly during the first growing season to establish roots.",
        "Once established, it is drought-tolerant and requires less frequent watering.",
        "Overwatering can lead to root rot, so allow the soil to dry between watering.",
        "In extremely dry periods, additional watering will help maintain healthy growth."
    ],
    "soil": [
        "New Zealand Flax prefers well-drained soil to prevent waterlogging.",
        "It can grow in a variety of soils, including sandy and loamy types.",
        "Soil should be enriched with organic matter for improved fertility.",
        "Avoid heavy clay soils unless amended with sand or compost for drainage."
    ],
    "toxic": [
        "New Zealand Flax is not considered toxic to humans, but all parts are fibrous.",
        "Pets such as cats and dogs may experience digestive discomfort if ingested."
    ],
    "extra_care_tip": [
        "Trim older leaves at the base to encourage new growth and aesthetics.",
        "Protect from frost by covering with mulch in colder climates or relocating indoors.",
        "Watch for pests like aphids, which can be managed with insecticidal soap.",
        "Regular division every few years will prevent overcrowding and promote vigor."
    ]
}