{
    "name": "Night-Blooming Jasmine",
    "climate": [
        "Night-blooming jasmine thrives in warm, tropical climates with high humidity levels.",
        "This plant prefers a moderate to warm climate, ideally found in USDA zones 9 through 11.",
        "It grows best in climates where temperatures do not drop below 50°F for extended periods.",
        "In colder regions, it is often grown indoors or in greenhouses to maintain proper conditions."
    ],
    "sunlight": [
        "Night-blooming jasmine needs full sun to partial shade for optimal blooming and growth.",
        "It prefers locations with direct morning sun followed by afternoon shade to protect its delicate flowers.",
        "Bright, indirect sunlight can also support healthy growth, especially indoors or in shaded gardens.",
        "If grown indoors, placing it near a south-facing window ensures adequate light exposure."
    ],
    "watering": [
        "Requires consistent watering, keeping the soil evenly moist but not waterlogged at any time.",
        "In warmer months, increase watering frequency to prevent dehydration and encourage blooming.",
        "During winter, reduce watering as growth will slow, ensuring soil remains slightly damp.",
        "Overwatering may lead to root rot, so ensure proper drainage and adjust watering as needed."
    ],
    "soil": [
        "Prefers well-drained, sandy loam soil enriched with organic matter for best results.",
        "A soil pH slightly acidic to neutral, ranging from 6.5 to 7.5, supports healthy growth.",
        "The plant benefits from periodically amending the soil with compost or peat to improve fertility.",
        "Good drainage is essential, so using a mixture designed for flowering shrubs is beneficial."
    ],
    "toxic": [
        "Night-blooming jasmine is considered toxic to pets, causing gastrointestinal distress if ingested.",
        "The plant contains alkaloids, which may cause symptoms such as vomiting and diarrhea in animals.",
        "Humans may experience mild irritation if its sap contacts the skin or is ingested in large amounts."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain shape and remove any dead or diseased branches for healthy growth.",
        "Use organic fertilizers sparingly in spring to encourage lush foliage and abundant blooms.",
        "Protect from strong winds as the plant's stems are relatively fragile and can easily break.",
        "Provide trellis support if growing in smaller spaces, as it can become quite vine-like over time."
    ]
}