{
    "name": "Nutmeg",
    "climate": [
        "Nutmeg thrives in tropical climates with humid conditions, typically found in areas close to the equator where temperatures are consistent.",
        "It requires warm temperatures between 77°F to 95°F, making it ideal for countries like Indonesia and Grenada.",
        "High humidity is essential for nutmeg growth, often best in environments with annual rainfall between 60 to 150 inches.",
        "The climate should be frost-free and without significant temperature variations, ensuring optimal growth and fruit production."
    ],
    "sunlight": [
        "Nutmeg trees need partial shade, especially when they are young, to prevent the scorching of leaves.",
        "As the trees mature, they can tolerate more direct sunlight but still benefit from filtered, indirect sun.",
        "Optimal sunlight conditions include morning sun exposure with protection against the harsh midday sun.",
        "Ensuring adequate sunlight will promote healthier growth and regular fruiting throughout the tree's life."
    ],
    "watering": [
        "Nutmeg trees require regular watering to maintain moist soil conditions, especially during dry spells.",
        "Over-watering should be avoided as it can lead to root rot, a common issue in poorly drained soils.",
        "Consistent watering schedules are crucial, with emphasis on supplying extra water in times of drought.",
        "Newly planted trees particularly need more frequent watering to establish a strong root system before dry conditions."
    ],
    "soil": [
        "Nutmeg prefers fertile, well-drained soils with high organic matter to support robust growth.",
        "Sandy loam soils are optimal, providing good drainage while retaining adequate moisture and nutrients.",
        "The soil pH should be slightly acidic to neutral, ideally ranging from 5.5 to 7.0 for best growth results.",
        "Regular soil amendments, such as compost, can improve soil fertility and support consistent nutmeg production."
    ],
    "toxic": [
        "Nutmeg contains myristicin, which can be toxic in large quantities, potentially causing symptoms like nausea and hallucinations.",
        "It is important to keep nutmeg and nutmeg products out of reach of pets and children due to its possible toxic effects when consumed in excess."
    ],
    "extra_care_tip": [
        "Mulching around the base of nutmeg trees helps retain soil moisture and regulate soil temperature.",
        "Pruning regularly promotes better air circulation within the canopy and helps maintain tree health.",
        "Protect young trees from strong winds, which can damage tender branches or uproot the plants.",
        "Incorporating organic fertilizers during the growing season can enhance fruit production and overall tree vigor."
    ]
}