{
    "name": "Ornamental Pepper",
    "climate": [
        "Ornamental Pepper thrives in warm temperatures and prefers a climate that does not fall below 50°F (10°C).",
        "This plant is best suited for USDA hardiness zones 9 through 11, where the climate is mild.",
        "Cold temperatures and frost can be detrimental to Ornamental Peppers, so they are often grown as annuals.",
        "In cooler climates, Ornamental Peppers can be grown indoors or in greenhouses for adequate warmth."
    ],
    "sunlight": [
        "Ornamental Pepper plants require full sun for optimal growth and to produce vibrant colors.",
        "These plants should receive at least 6-8 hours of direct sunlight per day for lush foliage.",
        "Providing too little sunlight can result in leggy plants with fewer blooms and fruits.",
        "If growing indoors, placing the plant near a south-facing window is ideal for sufficient sunlight."
    ],
    "watering": [
        "Water Ornamental Pepper plants regularly to keep the soil consistently moist but not waterlogged.",
        "During the hotter months, these plants may require more frequent watering to prevent wilting.",
        "Allow the top inch of soil to dry between waterings to prevent overwatering and root rot.",
        "In winter months, reduce watering frequency, as the plant has lower water needs in cooler weather."
    ],
    "soil": [
        "A well-draining soil mix, rich in organic matter, is ideal for Ornamental Peppers.",
        "Loamy or sandy soils with a slightly acidic to neutral pH range are most suitable.",
        "Adding compost or well-rotted manure can enhance soil fertility and provide nutrients.",
        "Ensure the soil does not retain excess water, as this can lead to root diseases and poor growth."
    ],
    "toxic": [
        "Ornamental Peppers are considered toxic to pets such as dogs and cats if ingested.",
        "The plant contains solanine and capsaicin, which can cause gastrointestinal upset."
    ],
    "extra_care_tip": [
        "Pinch off early flowers to encourage bushier growth and a more compact plant structure.",
        "Regularly fertilize with a balanced liquid fertilizer during the growing season for best results."
    ]
}