{
    "name": "Ornamental Onion",
    "climate": [
        "Ornamental Onion thrives best in temperate climates with cool winters.",
        "They can also tolerate mild frost, making them versatile in various regions.",
        "These plants prefer less extreme climates, avoiding very hot or humid conditions.",
        "Ornamental Onions grow well in climates resembling Mediterranean conditions."
    ],
    "sunlight": [
        "Ornamental Onion requires full sun to partially shaded conditions for optimal growth.",
        "They flourish in sites where they receive at least six hours of direct sunlight daily.",
        "Partial shade is acceptable, though it may result in fewer flowers developing.",
        "Ensure they have unobstructed access to sunlight, promoting better growth and blooming."
    ],
    "watering": [
        "Ornamental Onion prefers a well-draining soil to avoid waterlogging and rotting.",
        "Provide moderate watering when the top inch of soil has dried out during active growth.",
        "Reduce watering in dormant periods, allowing the soil to dry between watering.",
        "Avoid overwatering, especially in winter, as excessive moisture can harm the plant."
    ],
    "soil": [
        "These plants thrive in well-draining, sandy or loamy soil types for best results.",
        "Ornamental Onions prefer moderately fertile soil that ensures good drainage.",
        "They can adapt to a wide range of soil types but with a preference for neutral pH.",
        "Adding organic matter can improve soil quality and promote healthy growth."
    ],
    "toxic": [
        "Ornamental Onions can be toxic to cats and dogs if ingested in large quantities.",
        "The bulbs contain compounds that might cause gastrointestinal distress in pets.",
        "Symptoms of toxicity include vomiting, diarrhea, and excessive drooling.",
        "Pet owners should monitor their animals and seek veterinary help if ingestion occurs."
    ],
    "extra_care_tip": [
        "After flowering, allow the leaves to die back naturally to nourish the bulbs.",
        "Deadhead flowers to prevent self-seeding, especially in managed garden spaces.",
        "Plant in clusters for a visually appealing display and naturalized appearance.",
        "Considering labeling the planting area, as the bulbs can be mistaken for edible onions."
    ]
}