{
    "name": "Ornamental Cabbage",
    "climate": [
        "Ornamental cabbages thrive in cool climates, where temperatures do not rise too high.",
        "They are best grown in regions with cool nights and mild daytime temperatures.",
        "These plants perform well in areas that experience a moderate winter season.",
        "Avoid very hot and humid climates, as they can affect the plant's growth."
    ],
    "sunlight": [
        "Ornamental cabbages require full sun to bring out their best leaf colors.",
        "They can tolerate light shade, especially in warmer climates to prevent wilting.",
        "Ensure they receive at least 6 hours of direct sunlight for vibrant foliage.",
        "Too much shade will result in less vibrant and more elongated leaves."
    ],
    "watering": [
        "Water ornamental cabbage regularly, keeping the soil consistently moist but not soggy.",
        "Do not let the soil dry out completely, especially during warm spells.",
        "Watering should be more frequent in dry climates to maintain soil moisture.",
        "Overwatering can lead to root rot, so ensure proper drainage."
    ],
    "soil": [
        "Ornamental cabbages prefer fertile, well-draining soil enriched with organic matter.",
        "A neutral to slightly acidic soil pH, around 6.0 to 7.5, is ideal for growth.",
        "Poor soil can be improved by adding compost or other organic amendments.",
        "Ensure the soil retains some moisture while allowing excess water to drain away."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To maintain a compact shape and vibrant colors, remove any yellowing or damaged leaves.",
        "During warm spells, mulch around the plants to help retain soil moisture and control temperature.",
        "Keep an eye out for pests such as aphids and caterpillars, applying appropriate measures if needed.",
        "In areas with mild winter temperatures, ornamental cabbages can last well into the season." 
    ]
}