{
    "name": "Pacific Rhododendron",
    "climate": [
        "Prefers a temperate climate, often found in coastal areas with mild winters.",
        "Humidity is key; thrives in areas with consistent moisture in the air.",
        "Does not thrive in extreme cold or hot, dry climates.",
        "Favors environments with moderate rainfall and protection from harsh elements."
    ],
    "sunlight": [
        "Grows best in partial shade, avoiding harsh midday sun which can burn leaves.",
        "Can be placed in dappled sunlight conditions mimicking forest understory.",
        "Direct sunlight exposures are avoided to prevent leaf scorch and dehydration.",
        "Struggles with low light; a balance of light and shade is the ideal condition."
    ],
    "watering": [
        "Regular watering is crucial, but the plant should not sit in waterlogged soil.",
        "Requires moist but well-drained soil; overwatering can lead to root rot.",
        "Drought can damage the plant; ensure consistent moisture, especially in dry spells.",
        "Frequent watering during active growing seasons enhances foliage and flower health."
    ],
    "soil": [
        "Prefers acidic to slightly acidic soil with a good amount of organic material.",
        "Well-drained soil rich in humus is ideal for optimal growth and health.",
        "Heavy, compacted soil should be avoided as it impedes root development.",
        "Incorporating peat moss or pine needles can help maintain desired soil acidity."
    ],
    "toxic": [
        "All parts of the Pacific Rhododendron are toxic if ingested by humans or animals.",
        "Symptoms of ingestion include nausea, vomiting, and possibly gastrointestinal upset."
    ],
    "extra_care_tip": [
        "Mulching helps retain moisture and maintains the suitable temperature of the soil.",
        "Pruning after flowering keeps the plant neat and encourages vigorous growth.",
        "Protect from high winds; windbreak structures can be helpful in exposed areas.",
        "Avoid fertilizing too frequently; prefer slow-release, balanced fertilizers in spring."
    ]
}