{
    "name": "Painted Lady Philodendron",
    "climate": [
        "This plant thrives in a tropical climate with high humidity levels.",
        "It prefers a temperature range between 65°F and 80°F for optimal growth.",
        "The Painted Lady Philodendron does not tolerate cold temperatures well.",
        "It is best suited for indoor environments or humid greenhouse settings."
    ],
    "sunlight": [
        "It grows best in bright, indirect sunlight to maintain vibrant foliage.",
        "Direct sunlight can scorch the leaves, so avoid placing it in harsh light.",
        "Low light conditions can slow growth, but it can still survive in them.",
        "Rotating the plant weekly ensures even light exposure and balanced growth."
    ],
    "watering": [
        "Water the plant consistently, allowing the top inch of soil to dry between waterings.",
        "Overwatering can lead to root rot, so ensure the pot has good drainage.",
        "The watering frequency varies by season; reduce it during the cooler months.",
        "Use lukewarm, distilled water or rainwater to avoid mineral buildup in the soil."
    ],
    "soil": [
        "A well-draining potting mix with good aeration is ideal for this philodendron.",
        "The soil should retain some moisture without becoming waterlogged or soggy.",
        "Combining peat-based soil with perlite or orchid bark improves drainage.",
        "Repotting every two years helps refresh the soil and provide additional nutrients."
    ],
    "toxic": [
        "The Painted Lady Philodendron is toxic to both pets and humans if ingested.",
        "It contains calcium oxalate crystals that can cause oral irritation and discomfort.",
        "Symptoms of toxicity include drooling, vomiting, and difficulty swallowing.",
        "Keep the plant out of reach of pets and children to avoid accidental ingestion."
    ],
    "extra_care_tip": [
        "Occasionally wipe the leaves with a damp cloth to remove dust and enhance photosynthesis.",
        "Prune any yellow or damaged leaves to maintain the plant's health and appearance.",
        "Regularly check for pests like spider mites, as they can affect the plant.",
        "Consider using a humidity tray or misting the leaves to maintain moisture levels."
    ]
}