{
    "name": "Pampas Grass",
    "climate": [
        "Pampas Grass thrives in warm climates and can tolerate drought conditions.",
        "This plant does well in coastal climates where humidity levels are moderate.",
        "It can survive in temperate climates but may need shelter from harsh winters.",
        "Pampas Grass is adaptable to a variety of climates but prefers mild conditions."
    ],
    "sunlight": [
        "Pampas Grass requires full sun to flower and grow healthily.",
        "It does best in locations that receive at least six hours of direct sunlight daily.",
        "Shade may hinder its growth, resulting in weak stems and poor flowering.",
        "Ensure it is planted in an area with unobstructed access to sunlight for optimal growth."
    ],
    "watering": [
        "Pampas Grass is drought-tolerant once established and requires minimal watering.",
        "Overwatering can lead to root rot; ensure the soil drains well between waterings.",
        "During the first growing season, keep the soil moist but not soggy to help establish roots.",
        "In hotter months, occasional deep watering may be beneficial to support growth."
    ],
    "soil": [
        "Pampas Grass prefers well-drained soil, rich in organic matter for best results.",
        "It can grow in a wide range of soil types, including sandy and clay soils.",
        "Amending soil with compost at planting time can enhance growth and vitality.",
        "Ensure good drainage to prevent waterlogging as it can damage the plant."
    ],
    "toxic": [
        "Pampas Grass is not considered toxic to humans or pets, making it safe for most gardens."
    ],
    "extra_care_tip": [
        "Regularly prune dead or damaged foliage to maintain a neat appearance.",
        "Divide the clumps every 3-5 years to promote a healthy and vigorous growth.",
        "Wearing gloves when handling Pampas Grass is advised due to the sharp edges of the leaves.",
        "In late winter or early spring, cut back the old stems to about 30 cm above ground level."
    ]
}