{
    "name": "Paperwhite Narcissus",
    "climate": [
        "Paperwhite Narcissus thrives in Mediterranean climates with mild, wet winters and hot, dry summers.",
        "They are well-suited for USDA zones 8 to 11, where temperatures do not fall below freezing.",
        "While they may grow in cooler climates, bulbs may need to be lifted and stored over winter.",
        "These plants are often grown indoors, where temperatures can be controlled for optimal bloom."
    ],
    "sunlight": [
        "Paperwhite Narcissus requires plenty of bright sunlight to bloom and grow effectively indoors.",
        "To achieve the best bloom results, ensure the plant receives bright, indirect sunlight throughout the day.",
        "Avoid placing the bulbs in direct midday sun as it could scorch their delicate foliage.",
        "Winter-grown bulbs may need supplemental lighting to provide adequate light exposure."
    ],
    "watering": [
        "When first planting, water Paperwhite bulbs thoroughly and then water sparingly as needed to keep soil damp but not soggy.",
        "Ensure pots have good drainage; overwatering can lead to rotting of the bulbs and poor flowering.",
        "Once blooms appear, maintain consistent soil moisture, avoiding both dryness and waterlogging.",
        "After flowering, reduce watering gradually as the plant begins to enter dormancy for the season."
    ],
    "soil": [
        "Plant Paperwhite Narcissus in well-drained soil to prevent waterlogging and root rot issues.",
        "A high-quality potting mix or a blend of sand, loam, and peat makes an ideal growing medium.",
        "Ensure any container used has drainage holes to maintain proper moisture levels within the soil.",
        "For outdoor planting, choose a location with loose, fertile soil enriched with organic matter."
    ],
    "toxic": [
        "All parts of the Paperwhite Narcissus are toxic if ingested by pets or humans.",
        "Symptoms of ingestion may include nausea, vomiting, or diarrhea and require medical attention.",
        "The plant contains lycorine, causing irritation, moreso when handling bulbs and leaves.",
        "Care should be taken to use gloves when handling the bulbs to prevent skin irritation."
    ],
    "extra_care_tip": [
        "Bulbs can be forced indoors to bloom without needing a cold period when planted in pebbles and water.",
        "To prevent tall Paperwhite blooms from flopping over, grow in a low alcohol drink solution.",
        "After flowering, allow leaves to fade naturally as this helps ready bulbs for next season.",
        "Paperwhites are often grown for indoor winter interest when few other options bloom inside."
    ]
}