{
    "name": "Peacock Plant",
    "climate": [
        "The peacock plant thrives in warm and humid environments, making it well-suited for tropical climates.",
        "A consistent temperature between 65°F and 75°F is ideal for the peacock plant's growth and health.",
        "This plant prefers a climate with high humidity levels, which mimics its natural rainforest habitat.",
        "Avoid exposing the peacock plant to sudden temperature fluctuations or drafts, as they can cause stress."
    ],
    "sunlight": [
        "Indirect, filtered light is best for the peacock plant, as it can scorch in direct sunlight.",
        "A location with bright, indirect light will help maintain its vibrant leaf patterns and boost growth.",
        "Low light can be tolerated, but it may result in slower growth and less vivid leaf markings.",
        "Avoid placing the plant in complete shade or overly sunny spots to prevent leaf damage."
    ],
    "watering": [
        "Water the peacock plant regularly to keep the soil consistently moist but not waterlogged.",
        "During growing season, increase frequency of watering to support plant's active growth phase.",
        "In winter, reduce watering but ensure soil doesn't completely dry out between intervals.",
        "Use distilled or rainwater if possible, as the peacock plant is sensitive to chemicals in tap water."
    ],
    "soil": [
        "A well-draining potting mix with peat moss, perlite, and compost is ideal for peacock plant.",
        "The soil should retain some moisture without becoming saturated, preventing root rot.",
        "Providing a slightly acidic to neutral pH range in the soil is beneficial for the plant.",
        "Ensure proper aeration in the soil mix to facilitate healthy root development and growth."
    ],
    "toxic": [
        "The peacock plant is non-toxic to pets, making it a safe choice for households with animals."
    ],
    "extra_care_tip": [
        "To increase humidity, mist the leaves regularly or place a humidifier nearby for optimal conditions.",
        "Peacock plants can be prone to spider mites; inspect and clean leaves to prevent infestations."
    ]
}