{
    "name": "Peanut Butter Bush",
    "climate": [
        "The Peanut Butter Bush thrives in mild temperate climates with warm summers.",
        "It is native to regions with tropical and subtropical climates, preferring moderate humidity.",
        "Although adaptable, it does not tolerate cold and frost well, requiring protection.",
        "Zones 9 to 11 are ideal as they provide suitable warmth and humidity levels."
    ],
    "sunlight": [
        "This plant prefers full sun exposure for the entire day to maximize growth.",
        "Partial sun can be tolerated, but it may result in reduced blooming activity.",
        "In areas with intense sun, some afternoon shade can help prevent leaf scorch.",
        "Ensure the plant receives at least six to eight hours of sunlight daily."
    ],
    "watering": [
        "The Peanut Butter Bush requires regular watering to keep the soil consistently moist.",
        "During hot and dry periods, increase the frequency of watering to prevent wilting.",
        "Ensure good drainage to prevent waterlogging, as this plant does not like soggy roots.",
        "In cooler months, reduce watering as the plant's growth rate slows down considerably."
    ],
    "soil": [
        "It thrives in well-drained soil that is rich in organic matter and nutrients.",
        "Slightly acidic to neutral pH soil conditions are preferred for optimal growth.",
        "Amend dense or heavy soils with compost or sand to improve aeration and drainage.",
        "Insufficient soil drainage can lead to root rot, so proper aeration is crucial."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune regularly to maintain shape and encourage new growth, especially in early spring.",
        "A layer of mulch can help retain soil moisture and suppress weed growth around the base.",
        "Fertilize during the growing season with a balanced fertilizer to support vibrant blooms.",
        "Monitor for pests like aphids and mites; treat with insecticidal soap if necessary."
    ]
}