{
    "name": "Penny Mac Hydrangea",
    "climate": [
        "Penny Mac Hydrangeas thrive in temperate climates with mild winters.",
        "This plant prefers climates with adequate rainfall distribution throughout the year.",
        "Hydrangeas generally do well in zones 5-9, where temperatures are moderate.",
        "In very hot climates, hydrangeas may require additional shade and water."
    ],
    "sunlight": [
        "Penny Mac Hydrangeas do best in partial sun to partial shade conditions.",
        "They require morning sunlight but benefit from afternoon shade, especially in hot areas.",
        "Direct, harsh afternoon sunlight can damage the plant, causing wilting or scorched leaves.",
        "To optimize blooms, ensure they receive 3-5 hours of sunlight daily, preferably in the morning."
    ],
    "watering": [
        "Consistent watering is crucial for Penny Mac Hydrangeas to maintain their moisture.",
        "Ensure the soil remains consistently moist but not waterlogged to avoid root rot.",
        "During dry spells or high heat, increase watering frequency to support plant health.",
        "Mulching can help retain moisture and reduce watering needs during hot weather."
    ],
    "soil": [
        "Penny Mac Hydrangeas prefer rich, well-drained soil with a pH of 5.5 to 6.2.",
        "Soil should be amended with organic matter such as compost to retain moisture.",
        "Avoid heavy clay soils unless they are amended to improve drainage capabilities.",
        "In poor soils, fertilizing in spring and summer ensures robust growth and blooms."
    ],
    "toxic": [
        "Penny Mac Hydrangeas contain cyanogenic glycosides, which can be toxic if ingested.",
        "All parts of the plant, including leaves and flowers, pose a risk if consumed by pets or humans."
    ],
    "extra_care_tip": [
        "To change flower color, adjust soil pH: more acidic for blue, more alkaline for pink.",
        "Prune spent flowers after blooming to encourage new growth and blooms for the next year."
    ]
}