{
    "name": "Peperomia Pixie Lime",
    "climate": [
        "Peperomia Pixie Lime thrives in a warm, tropical climate. It prefers conditions similar to its native habitat in Central and South America.",
        "This plant enjoys temperature ranges between 65 to 75 degrees Fahrenheit. It should be protected from cold drafts and sudden temperature drops.",
        "Humidity is important for Peperomia Pixie Lime, ideally above 50 percent. Higher humidity can lead to faster growth and healthier foliage.",
        "While tolerant of indoor environments, extreme temperatures, especially above 85 degrees, can stress the plant."
    ],
    "sunlight": [
        "Peperomia Pixie Lime prefers bright, indirect sunlight, which helps it maintain its vibrant leaf color.",
        "Direct sunlight can scorch the leaves, so it's best to place it near, but not in, a sunny window.",
        "Indoor lighting conditions, such as fluorescent light, can support its growth if natural sunlight is insufficient.",
        "Low light conditions are tolerable but can lead to slower growth and less vibrant foliage colors over time."
    ],
    "watering": [
        "Allow the top few inches of soil to dry out between waterings to prevent overwatering. This mimics its natural habitat.",
        "Peperomia is susceptible to root rot; therefore, adequate drainage is crucial to avoid waterlogged soil.",
        "In winter months, reduce watering frequency as the plant's growth slows down and it requires less moisture.",
        "Use room temperature water and avoid using cold water, which can shock the plant roots."
    ],
    "soil": [
        "A well-draining potting mix is essential for Peperomia Pixie Lime. A mixture of peat moss and perlite works well.",
        "Avoid heavy soils that retain too much moisture, as they can increase the risk of root rot.",
        "The soil should be slightly acidic to neutral, with a pH range between 6.0 and 7.0 for optimal growth.",
        "Repotting every year or when roots become crowded helps ensure that the soil remains fresh and well-aerated."
    ],
    "toxic": [
        "Peperomia Pixie Lime is generally considered non-toxic to pets and humans. However, it's always best to discourage consumption."
    ],
    "extra_care_tip": [
        "To maintain its compact growth, gently pinch back the stems. This encourages bushier and healthier growth overall."
    ]
}