{
    "name": "Peruvian Lily",
    "climate": [
        "Peruvian lilies thrive in regions with mild temperatures and adequate rainfall, making them suitable for USDA hardiness zones 7 to 10.",
        "These plants prefer a temperate climate with cool, moist summers and mild winters for optimal growth and flowering.",
        "In their native habitat of the Andes mountains, they adapt to varying altitudes and moderate climates.",
        "Avoid extremely hot or frosty conditions, as Peruvian lilies are sensitive to temperature extremes."
    ],
    "sunlight": [
        "Peruvian lilies require full sun to partial shade to produce vibrant blooms and maintain healthy foliage.",
        "Full sun conditions yield the best flower production, but some afternoon shade is beneficial to prevent overheating.",
        "In hotter climates, providing shade during the peak afternoon hours can protect the plant from intense sunlight.",
        "Insufficient sunlight might result in fewer blooms and elongated stems as plants strive for more light exposure."
    ],
    "watering": [
        "Water Peruvian lilies consistently, ensuring the soil remains moist but not waterlogged to prevent root rot.",
        "During the growing season, water regularly, allowing the soil surface to dry slightly between waterings.",
        "Reduce watering in the dormant winter months to avoid overwatering, which the plant does not tolerate.",
        "Humidity helps, but soggy conditions harm; aim for a well-balanced watering regimen suitable for moderate climates."
    ],
    "soil": [
        "Peruvian lilies favor well-draining, fertile soil enriched with organic matter for healthy growth.",
        "A sandy loam soil structure works well, promoting adequate drainage and root development.",
        "Incorporate compost or aged manure to enhance soil fertility and structure, aiding plant vigor.",
        "Maintain a slightly acidic to neutral pH level in the soil to support optimal nutrient uptake and overall plant health."
    ],
    "toxic": [
        "Peruvian lilies can be toxic to pets, especially cats, causing symptoms like vomiting, lethargy, and kidney issues.",
        "The plant contains compounds that might lead to toxicity in pets when ingested, necessitating caution."
    ],
    "extra_care_tip": [
        "Remove dead flowers promptly to encourage continuous blooming and prevent energy wastage by the plant.",
        "Mulching around the plant base helps retain soil moisture and regulates ground temperature effectively."
    ]
}