{
    "name": "Philodendron Prince of Orange",
    "climate": [
        "Philodendron Prince of Orange thrives in a warm, humid environment that mimics its tropical origins.",
        "It is best suited for USDA hardiness zones 10 through 12 where temperatures are generally mild.",
        "Avoid exposure to temperatures below 55°F as cold can damage the plant seriously.",
        "A temperature range between 65°F and 80°F is ideal for optimal growth of the plant."
    ],
    "sunlight": [
        "Philodendron Prince of Orange prefers bright, indirect sunlight for optimal growth.",
        "Exposure to direct sunlight can scorch the leaves, causing discoloration and damage.",
        "If placed in low light conditions, the plant's growth may slow down significantly.",
        "Morning sun or filtered light is best, avoiding harsh afternoon sun exposure."
    ],
    "watering": [
        "Keep the soil consistently moist, allowing the top inch to dry out between waterings.",
        "Overwatering can lead to root rot, so it's essential to maintain proper drainage.",
        "Reduce watering frequency during the winter months when the plant's growth slows.",
        "Increase humidity by misting the leaves regularly or using a humidifier nearby."
    ],
    "soil": [
        "Philodendron Prince of Orange prefers well-draining, aerated soil rich in organic matter.",
        "A potting mix containing peat, perlite, and pine bark works well for this plant.",
        "Ensure the soil retains some moisture but never becomes waterlogged to prevent rot.",
        "Good aeration in the soil is crucial for healthy root development and overall plant health."
    ],
    "toxic": [
        "Philodendron Prince of Orange is toxic if ingested, containing calcium oxalate crystals.",
        "Ingestion can cause irritation, swelling, and discomfort in the mouth and throat.",
        "It is recommended to keep the plant away from pets and small children to ensure safety.",
        "Symptoms may require medical attention if significant quantities are ingested."
    ],
    "extra_care_tip": [
        "Rotate the plant periodically to ensure even growth and maintain its visual balance.",
        "Clean the leaves occasionally to remove dust and enhance the plant's photosynthesis.",
        "Regular feeding with a balanced liquid fertilizer during the growing season encourages healthy growth.",
        "Prune off dead or yellowing leaves to maintain the plant's health and appearance."
    ]
}