{
    "name": "Philodendron Pink Princess",
    "climate": [
        "Prefers a warm, humid environment similar to tropical rainforests.",
        "Temperature should ideally be kept between 65°F and 80°F.",
        "Avoid cold drafts and sudden temperature changes for optimal growth.",
        "Humidity levels should be above 50% for healthy leaf development."
    ],
    "sunlight": [
        "Prefers bright, indirect light to maintain its variegation and pink color.",
        "Direct sunlight should be avoided, as it can scorch the leaves easily.",
        "Tolerates low light conditions but may result in less variegation.",
        "A north or east-facing window provides the ideal lighting conditions."
    ],
    "watering": [
        "Water when the top inch of soil feels dry to the touch but do not overwater.",
        "Philodendrons prefer moist soil but are prone to root rot if waterlogged.",
        "Reduce watering frequency during the winter months when growth slows.",
        "Always use lukewarm water to avoid shocking the plant roots."
    ],
    "soil": [
        "Thrives best in a well-draining, aroid potting mix with organic matter.",
        "A mix containing peat moss, perlite, and orchid bark is recommended.",
        "Ensure proper drainage to prevent water accumulation at the roots.",
        "Avoid heavy clay soils as they retain too much moisture for healthy growth."
    ],
    "toxic": [
        "Toxic to pets and humans if ingested, causing oral irritation.",
        "Contains calcium oxalate crystals that can cause vomiting in pets.",
        "May lead to difficulty swallowing and discomfort if consumed.",
        "Keep out of reach of children and animals to ensure safety."
    ],
    "extra_care_tip": [
        "Rotate the plant occasionally to ensure even lighting and growth.",
        "Wipe leaves with a damp cloth regularly to keep them dust-free.",
        "Consider using a pebble tray to increase humidity around the plant.",
        "Prune leggy parts to maintain a compact and attractive appearance."
    ]
}