{
    "name": "Philodendron Bernardopazii",
    "climate": [
        "Philodendron Bernardopazii thrives in tropical climates with warm temperatures throughout the year.",
        "It requires high humidity conditions that mimic its natural rainforest habitat to flourish.",
        "This plant prefers temperatures between 65°F to 85°F, avoiding cold drafts.",
        "It does not tolerate frost and should be kept indoors or in greenhouses in cooler climates."
    ],
    "sunlight": [
        "It grows well in bright, indirect sunlight. Avoid placing it in direct sunlight to prevent leaf burn.",
        "Philodendron Bernardopazii can adapt to lower light conditions, though it may grow more slowly.",
        "Filtered sunlight, similar to what is found under tree canopies, suits this plant best.",
        "Rotating the plant occasionally ensures even growth and a balanced shape as it seeks light."
    ],
    "watering": [
        "Watering should be consistent, allowing the top inch of soil to dry out between waterings.",
        "Overwatering can lead to root rot, so ensure proper drainage and avoid waterlogging the soil.",
        "During warmer months, the plant may require more frequent watering to maintain soil moisture.",
        "In cooler months, reduce watering frequency, keeping the plant slightly drier to prevent issues."
    ],
    "soil": [
        "A well-draining potting mix rich in organic matter is best for Philodendron Bernardopazii.",
        "Consider using a soil mix that includes peat moss, perlite, and a bit of orchid bark for aeration.",
        "The soil should retain moisture but prevent excess water retention to protect the roots.",
        "Repotting every couple of years helps to refresh the soil and accommodate the plant's growth."
    ],
    "toxic": [
        "Philodendron Bernardopazii is toxic to pets and humans if ingested, causing irritation and upset."
    ],
    "extra_care_tip": [
        "Mist the leaves occasionally to support the humidity needs and maintain lush foliage."
    ]
}