{
    "name": "Philodendron Spiritus-Sancti",
    "climate": [
        "Philodendron Spiritus-Sancti thrives in a tropical climate. Conditions similar to its native rainforest habitat are ideal to ensure proper growth.",
        "High humidity levels are essential for the Philodendron Spiritus-Sancti. Environments with 70% humidity or more are recommended for its well-being.",
        "The temperature should ideally remain between 70°F and 85°F. This plant does not tolerate cold temperatures or frost conditions at all.",
        "Avoid exposure to too much temperature fluctuation. Stability in its growing environment is critical for healthy and sustained growth."
    ],
    "sunlight": [
        "Philodendron Spiritus-Sancti prefers bright, indirect sunlight. Direct exposure to intense sunlight can scorch its leaves, harming the plant.",
        "Artificial lighting can simulate natural sunlight for this plant. Position it in a room with fluorescent lights if natural light is scarce.",
        "A location with filtered sunlight, like near a window with sheer curtains, is ideal. This protects the plant from direct sun exposure.",
        "Regularly rotate the plant so all sides receive adequate light. This promotes balanced growth and prevents the plant from leaning to one side."
    ],
    "watering": [
        "Ensure the soil is consistently moist, but not waterlogged. Overwatering can lead to root rot, a common issue with this plant species.",
        "Watering frequency must be adjusted based on the season. During the growing season, water more frequently, and reduce during dormancy.",
        "Check the top inch of soil; if dry, it's time to water. This helps prevent both underwatering and overwatering of the plant.",
        "Utilize room temperature water to avoid shocking the roots. Cold water can stress the plant and affect its overall health negatively."
    ],
    "soil": [
        "Philodendron Spiritus-Sancti requires well-draining soil to thrive. Soil mixes designed for orchids work well for this species.",
        "A light, airy soil composition with organic matter is preferred. Soil should allow for good airflow and promote healthy root development.",
        "Incorporate materials like perlite or charcoal to enhance drainage. These components help prevent the soil from becoming compacted.",
        "Regularly refresh the soil to avoid nutrient depletion. Healthy soil is critical to maintaining the plant’s vibrant growth and development."
    ],
    "toxic": [
        "This plant is toxic if ingested by pets and humans. Keep out of reach from curious animals and ensure children do not chew on the leaves."
    ],
    "extra_care_tip": [
        "Enhance humidity around the plant using a pebble tray filled with water. Misting the plant occasionally can help to keep the leaves lush."
    ]
}