{
    "name": "Philodendron Rojo Congo",
    "climate": [
        "Philodendron Rojo Congo thrives well in a tropical climate where temperatures are warm all year round.",
        "They prefer environments where the humidity levels are consistently high to simulate their native habitat.",
        "Ideal indoor conditions mimic its natural rainforest habitat, with temperatures between 65°F and 80°F.",
        "Avoid cold climates as Philodendron Rojo Congo is not frost-tolerant and requires protection."
    ],
    "sunlight": [
        "This plant prefers bright, indirect sunlight but can also tolerate lower light conditions.",
        "Avoid exposing the Philodendron Rojo Congo to direct sunlight, as it may scorch its leaves.",
        "It can adapt to medium light conditions but will grow more slowly and produce smaller leaves.",
        "For optimal health, position near an east or north-facing window with filtered light."
    ],
    "watering": [
        "Water the Philodendron Rojo Congo thoroughly, allowing the top inch of soil to dry out between waterings.",
        "During the growing season, maintain a regular watering schedule to support its growth.",
        "Be cautious not to overwater as it can lead to root rot, which is detrimental to the plant.",
        "Reduce watering in winter when the plant enters a slower growth phase and requires less moisture."
    ],
    "soil": [
        "Philodendron Rojo Congo requires well-draining soil to prevent waterlogging and support root health.",
        "A mixture of potting soil, orchid bark, and perlite or sand will provide the best growing medium.",
        "Ensure the soil retains some moisture but also allows excess water to drain away freely.",
        "Using a container with drainage holes is essential to prevent standing water in the soil."
    ],
    "toxic": [
        "Philodendron Rojo Congo is toxic to pets and humans if ingested, causing irritation and swelling.",
        "Signs of toxicity include drooling, vomiting, and irritation of the mouth or throat in animals."
    ],
    "extra_care_tip": [
        "Regularly wipe the leaves with a damp cloth to remove dust and allow for efficient photosynthesis.",
        "Occasionally prune the plant to remove yellowing leaves and maintain a tidy appearance.",
        "Provide support with a moss pole or stake; it helps the plant grow upright and reduces stress on stems."
    ]
}