{
    "name": "Philodendron Silver Sword",
    "climate": [
        "Prefers a warm and humid climate similar to tropical rainforests where it is native.",
        "Grows best in temperatures ranging from 65°F to 80°F, avoiding any sudden temperature drops.",
        "Philodendron Silver Sword thrives in environments with high humidity, ideally above 60%.",
        "Not frost-tolerant and should be kept away from cold drafts or air conditioning."
    ],
    "sunlight": [
        "Prefers bright, indirect sunlight which mimics its natural understory habitat.",
        "Direct sunlight exposure should be avoided as it might scorch the leaves.",
        "Can tolerate lower light conditions but growth might slow down significantly.",
        "A bright room with filtered light or sheer curtains would be ideal for its growth."
    ],
    "watering": [
        "Water when the top inch of soil dries out to keep the plant healthy and thriving.",
        "Overwatering can lead to root rot, so ensure proper drainage with gentle watering.",
        "Use room temperature water to avoid shocking the plant's roots.",
        "During winter, reduce watering frequency as the plant's growth slows down."
    ],
    "soil": [
        "Requires well-draining soil with organic matter to ensure moisture retention yet prevent waterlogging.",
        "A mix of peat, perlite, and orchid bark can provide an ideal environment for root growth.",
        "Aerated and loose soil is preferred to allow efficient air circulation around the roots.",
        "Regular potting soil can be amended with sand or perlite to enhance drainage capability."
    ],
    "toxic": [
        "Philodendron Silver Sword is toxic to pets like cats and dogs if ingested, causing irritation and swelling.",
        "Contains calcium oxalate crystals, which can cause mouth and digestive tract discomfort in humans and animals.",
        "Caution should be exercised if small children are around due to potential toxic reactions.",
        "Symptoms of toxicity may include difficulty swallowing, vomiting, or oral discomfort upon ingestion."
    ],
    "extra_care_tip": [
        "Regular misting and using a pebble tray can help raise humidity levels around the plant.",
        "If leaves become dusty, gently wipe them with a damp cloth to maintain optimal photosynthesis.",
        "Pruning can help encourage bushier growth; trim yellowing leaves at the base.",
        "Rotating the plant occasionally helps promote even growth by exposing all sides to light."
    ]
}