{
    "name": "Philodendron White Princess",
    "climate": [
        "Thrives well in a warm and humid environment typical of tropical areas.",
        "Cannot withstand cold temperatures and prefers a consistent warm climate.",
        "Avoid exposes to cold drafts or temperature fluctuations which can stress it.",
        "Its natural habitat mimics a rainforest environment with high humidity."
    ],
    "sunlight": [
        "Prefers bright, indirect sunlight for optimal growth and vibrancy.",
        "Avoid direct sunlight as it can scorch the leaves causing damage.",
        "Can tolerate lower light conditions but may grow slower or become leggy.",
        "Ideal placement is near windows with filtered light to avoid leaf burn."
    ],
    "watering": [
        "Requires regular watering, allowing the topsoil to dry out between waterings.",
        "Overwatering can lead to root rot, so ensure proper drainage and aeration.",
        "In winter, reduce water frequency as the plant's growth slows down.",
        "Check soil moisture frequently and adjust watering as necessary to avoid dryness."
    ],
    "soil": [
        "Prefers well-draining soil that retains moisture but doesn't become waterlogged.",
        "A mix of peat moss, perlite, and pine bark works well for aeration and drainage.",
        "Avoid compacted soils as they can lead to poor root health and growth issues.",
        "Repotting annually with fresh soil helps maintain nutrient availability and structure."
    ],
    "toxic": [
        "The plant contains calcium oxalate crystals that are toxic if ingested.",
        "Can cause irritation and swelling of mouth and throat in humans and pets.",
        "It is advised to keep away from children and pets to avoid accidental ingestion."
    ],
    "extra_care_tip": [
        "Wiping the leaves occasionally with a damp cloth can help keep them dust-free.",
        "Prune lightly to shape and remove any damaged leaves for a healthier appearance."
    ]
}