{
    "name": "Philodendron Florida Beauty",
    "climate": [
        "Philodendron Florida Beauty thrives in warm and humid conditions, resembling tropical climates.",
        "Ideal temperature range for this plant is between 65°F to 80°F to mimic its native habitat.",
        "This plant does not tolerate cold drafts, so it's best kept in consistently warm environments.",
        "High humidity levels can help the plant grow healthily; avoid overly dry air."
    ],
    "sunlight": [
        "Bright, indirect sunlight is optimal for the growth of Philodendron Florida Beauty.",
        "Direct sunlight may scorch its leaves, so it should be protected from harsh rays.",
        "It can adapt to lower light conditions, although growth might slow down significantly.",
        "Rotating the plant periodically ensures even light distribution and balanced growth."
    ],
    "watering": [
        "Allow the top inch of soil to dry out between waterings to prevent overwatering.",
        "Watering frequency might vary with climate; maintain consistent but moderate moisture.",
        "During winter, the plant’s water needs decrease, so ensure not to overwater.",
        "Yellowing leaves could indicate either overwatering or underwatering; adjust accordingly."
    ],
    "soil": [
        "Philodendron Florida Beauty prefers well-draining soil, ideally aroid mixes.",
        "A mixture of peat, perlite, and orchid bark can promote proper aeration and drainage.",
        "Avoid compacted soils, as they may lead to waterlogging and root rot.",
        "Regularly check soil conditions to ensure it remains aerated and not overly dense."
    ],
    "toxic": [
        "Philodendron Florida Beauty is toxic to pets and humans if ingested; it contains calcium oxalate crystals.",
        "Ingestion can cause oral irritation, vomiting, and difficulty swallowing. Handle with care around children and animals."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain shape and remove any yellowing or damaged leaves.",
        "Wiping leaves with a damp cloth can remove dust and improve photosynthesis.",
        "Support structures or stakes might be necessary due to its climbing nature.",
        "Avoid room temperatures below 55°F, as the plant is sensitive to cold temperatures."
    ]
}