{
    "name": "Philodendron Melanochrysum",
    "climate": [
        "Philodendron Melanochrysum thrives in a tropical climate with high humidity levels, typically above 60%.",
        "This plant prefers consistent warm temperatures, ideally between 70°F to 85°F (21°C to 29°C).",
        "Avoid exposing Philodendron Melanochrysum to temperatures below 55°F (13°C), which can harm the plant.",
        "Rapid temperature changes or drafts should be avoided to ensure optimal growth conditions."
    ],
    "sunlight": [
        "Philodendron Melanochrysum prefers bright, indirect sunlight and should be kept away from direct sun.",
        "Direct sunlight can cause the leaves to burn, so filtered light is ideal for this plant.",
        "If you notice leggy growth, the plant may require more light; consider moving it closer to a window.",
        "Artificial grow lights can be used to supplement natural light during short winter days."
    ],
    "watering": [
        "This plant likes its soil to be consistently moist but not soggy, and should be watered when the top inch dries.",
        "Ensure the pot has good drainage to prevent the roots from sitting in water, which can cause root rot.",
        "Reduce watering during the winter months when the plant's growth slows down.",
        "Using lukewarm water is recommended to avoid shocking the plant's root system."
    ],
    "soil": [
        "Philodendron Melanochrysum benefits from a well-draining, airy soil mixture rich in organic matter.",
        "A mix of peat, perlite, and orchid bark provides the necessary drainage and aeration for healthy growth.",
        "Avoid heavy, clay-based soils that retain water and can lead to root rot in this species.",
        "Repotting every couple of years helps refresh the nutrients but use a pot with drainage holes."
    ],
    "toxic": [
        "Philodendron Melanochrysum is toxic to pets and humans if ingested, causing irritation and swelling."
    ],
    "extra_care_tip": [
        "To maintain high humidity, occasionally mist the plant or use a pebble tray filled with water beneath it."
    ]
}