{
    "name": "Philodendron Shangri-La",
    "climate": [
        "The Philodendron Shangri-La thrives best in tropical and humid conditions typically found in rainforests.",
        "This plant prefers a warm climate with temperatures ranging from 65°F to 80°F for optimal growth.",
        "Avoid exposing this philodendron to temperatures below 55°F as it can suffer from cold injury.",
        "High humidity levels support its growth, replicating its natural warm and moist environment."
    ],
    "sunlight": [
        "Philodendron Shangri-La requires bright, indirect sunlight for the best foliage development.",
        "Direct sunlight can scorch the leaves, so ensure it is placed away from harsh sun rays.",
        "If the plant doesn’t receive enough light, its growth might slow, and leaf size may reduce.",
        "Suitable for lower light conditions compared to many other houseplants, yet light is key."
    ],
    "watering": [
        "Allow the top inch of soil to dry out between waterings, preventing overwatering issues.",
        "Water thoroughly until excess water drains from the pot, ensuring no waterlogging occurs.",
        "Reduce watering frequency during the winter months when growth naturally slows down.",
        "Monitor moisture levels regularly; signs of drought include wilting or curling leaves."
    ],
    "soil": [
        "Use a well-draining potting mix, ideally one designed for aroids or similar tropical plants.",
        "The soil should retain moisture without becoming soggy; peat-based mixes are excellent.",
        "Add perlite or orchid bark to improve aeration and drainage within the soil mixture.",
        "A slightly acidic to neutral pH range of around 5.5 to 7.0 is ideal for optimal nutrient uptake."
    ],
    "toxic": [
        "Philodendron Shangri-La is toxic to pets such as cats and dogs, causing irritation if ingested.",
        "It contains calcium oxalate crystals which can lead to discomfort and swelling in the mouth.",
        "Animals may exhibit symptoms such as drooling, vomiting, and difficulty swallowing.",
        "Though not highly toxic, keeping the plant out of reach minimizes potential health risks."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to remove dust, enhancing photosynthesis.",
        "Rotate the plant periodically to ensure all sides receive equal sunlight and promote even growth.",
        "Watch for common pests like spider mites and treat immediately with appropriate measures.",
        "Consider repotting every couple of years with fresh soil to support healthy root development."
    ]
}