{
    "name": "Philodendron Billietiae",
    "climate": [
        "Philodendron Billietiae thrives in tropical climates where temperatures are consistently warm.",
        "This plant prefers high humidity environments, typical of rainforest understorey areas.",
        "It is crucial to maintain a stable temperature, avoiding any sudden cold drafts.",
        "A greenhouse setting can mimic its native climate by providing required warmth and humidity."
    ],
    "sunlight": [
        "Philodendron Billietiae prefers bright, indirect sunlight for optimal growth.",
        "Direct sunlight can scorch its leaves, hence a filtered light source is ideal.",
        "It can tolerate some lower light conditions but may grow more slowly.",
        "Positioning near a window with sheer curtains can provide the right amount of light."
    ],
    "watering": [
        "The soil should be kept consistently moist but not waterlogged to prevent root rot.",
        "Allow the top inch of soil to dry out before watering again for best results.",
        "Avoid letting the plant sit in water by ensuring proper drainage in its pot.",
        "In winter months, reduce watering frequency as the plant grows slower."
    ],
    "soil": [
        "A well-draining potting mix, such as one containing peat moss and perlite, is ideal.",
        "Philodendron Billietiae appreciates soil that retains some moisture but does not become soggy.",
        "The soil pH should be slightly acidic to neutral to support healthy growth.",
        "Regular repotting every couple of years helps refresh the nutrients in the soil."
    ],
    "toxic": [
        "Philodendron Billietiae contains calcium oxalate crystals, making it toxic if ingested.",
        "Symptoms of ingestion may include oral irritation, swelling, and digestive discomfort.",
        "Keep this plant out of reach of children and pets to avoid accidental ingestion.",
        "In case of ingestion, seek medical advice or contact a poison helpline promptly."
    ],
    "extra_care_tip": [
        "Regularly cleaning the leaves with a damp cloth helps remove dust and improves photosynthesis.",
        "Misting the plant can help increase humidity around it, especially in dry climates.",
        "Supporting its growth with a moss pole allows it to exhibit its natural climbing habit.",
        "Feeding with a balanced fertilizer during the growing season can boost its health and appearance."
    ]
}