{
    "name": "Philodendron Squamiferum",
    "climate": [
        "Philodendron Squamiferum thrives in warm and humid environments typical of tropical forests.",
        "This plant prefers a temperature range between 65°F (18°C) and 80°F (27°C).",
        "Consistent humidity levels above 60% mimic its native habitat and support growth.",
        "Avoid exposure to cold drafts or temperatures below 55°F (13°C) for optimal health."
    ],
    "sunlight": [
        "It grows best with bright, indirect sunlight, avoiding direct intense sunlight.",
        "Direct sunlight can scorch the leaves, leading to brown patches and stress.",
        "A location with filtered light, like a spot near an east or north-facing window, is ideal.",
        "If light is insufficient, consider using grow lights to supplement natural light."
    ],
    "watering": [
        "Water the plant when the top inch of soil feels dry, generally every one to two weeks.",
        "Ensure the pot has proper drainage to prevent water-logged soil and root rot.",
        "Increased watering may be necessary during active growth periods in spring and summer.",
        "Reduce watering frequency in winter as the plant's growth rate decreases significantly."
    ],
    "soil": [
        "Use a well-draining potting mix rich in organic matter for optimal root health.",
        "A mix of peat, perlite, and pine bark provides aeration and nutrient retention.",
        "Avoid heavy, compacted soils that retain excess moisture and hamper drainage.",
        "Repotting every few years helps refresh the soil and support healthy growth."
    ],
    "toxic": [
        "Philodendron Squamiferum is toxic to pets and humans if ingested, causing irritation and discomfort.",
        "Symptoms of ingestion include oral irritation, vomiting, and difficulty swallowing."
    ],
    "extra_care_tip": [
        "Wipe the leaves with a damp cloth periodically to remove dust and improve photosynthesis.",
        "Provide a climbing structure or moss pole to support its natural growth habit and larger leaves."
    ]
}