{
    "name": "Philodendron Green Princess",
    "climate": [
        "Philodendron Green Princess thrives in warm, tropical climates similar to rainforests.",
        "It prefers high humidity levels, typical of tropical environments, to grow well.",
        "Temperature ranges between 65-80°F (18-27°C) are ideal for this plant's growth.",
        "Avoid exposing the plant to cold drafts or temperatures below 55°F (13°C)."
    ],
    "sunlight": [
        "This plant prefers bright, indirect sunlight to maintain healthy growth.",
        "Direct sunlight can scorch the leaves; filtered light works best for it.",
        "It can tolerate lower light conditions but growth may slow down.",
        "A well-lit room with indirect light is ideal for this plant’s environment."
    ],
    "watering": [
        "Water the Philodendron Green Princess when the top inch of soil feels dry.",
        "Avoid over-watering as it can lead to root rot; ensure pots have drainage.",
        "Waterless in winter as the plant's growth slows and requires less moisture.",
        "Mist the leaves regularly if the indoor air is too dry to maintain humidity."
    ],
    "soil": [
        "Use well-draining potting soil to prevent waterlogging and promote aeration.",
        "A mixture of peat, perlite, and a bit of sand can create an ideal soil.",
        "Ensure the soil remains slightly moist but never soggy for optimal growth.",
        "Regularly check for compacted soil; loosen it to allow root expansion."
    ],
    "toxic": [
        "Philodendron Green Princess is toxic to pets and humans if ingested.",
        "Ingestion can cause irritation, nausea, and vomiting due to calcium oxalate.",
        "It is advised to keep the plant out of reach of children and pets.",
        "Seek medical attention if ingestion occurs to avoid serious complications."
    ],
    "extra_care_tip": [
        "Regularly prune the plant to encourage bushier growth and remove dead leaves.",
        "Provide a trellis or support if the plant grows taller to prevent flopping.",
        "Fertilize monthly during growing season with a balanced liquid fertilizer.",
        "Rotate the plant periodically for uniform light exposure and growth."
    ]
}