{
    "name": "Philodendron Brasil",
    "climate": [
        "Philodendron Brasil thrives best in a warm climate, preferring temperatures between 65°F and 80°F.",
        "Avoid placing Philodendron Brasil in areas where temperatures fall below 55°F to keep it healthy.",
        "This plant is quite adaptable and can tolerate humidity levels but thrives in humid environments.",
        "Protect Philodendron Brasil from drafts and sudden temperature changes for optimal growth."
    ],
    "sunlight": [
        "Philodendron Brasil prefers bright, indirect sunlight to maintain its vibrant leaf colors.",
        "Avoid direct sunlight as it can scorch the leaves and cause fading in Philodendron Brasil.",
        "It can adapt to lower light conditions, but growth may be slower, and variegation less pronounced.",
        "Rotate the plant occasionally to ensure all parts receive equal light exposure for balanced growth."
    ],
    "watering": [
        "Water Philodendron Brasil when the top inch of soil feels dry; do not let it dry out completely.",
        "Overwatering can lead to root rot, so ensure the pot has good drainage to prevent waterlogging.",
        "Use room temperature water for watering, as cold water can shock the plant’s roots.",
        "During winter, reduce watering frequency as the plant's growth slows, and it requires less moisture."
    ],
    "soil": [
        "Philodendron Brasil thrives in well-draining soil that allows air to reach the roots.",
        "A mix comprising peat, vermiculite, and perlite offers excellent drainage and aeration.",
        "Avoid heavy or compacted soils that retain too much moisture, causing root rot.",
        "The soil should retain some moisture between watering but should never be soggy or waterlogged."
    ],
    "toxic": [
        "Philodendron Brasil is toxic to pets and humans when ingested, causing irritation and swelling."
    ],
    "extra_care_tip": [
        "Consider misting the leaves occasionally to increase humidity and prevent leaf browning."
    ]
}