{
    "name": "Philodendron Mayoi",
    "climate": [
        "Philodendron Mayoi thrives in a tropical climate with warm temperatures year-round.",
        "It prefers high humidity conditions similar to its native rainforest environment.",
        "Avoid exposing it to cold drafts or sudden temperature fluctuations for best growth.",
        "Protect the plant from frosty and harsh weather conditions for optimal health."
    ],
    "sunlight": [
        "This plant prefers bright but indirect sunlight throughout the day.",
        "Direct sunlight can scorch the leaves, so filtered light is ideal.",
        "Low light conditions are tolerated but may slow down its growth rate.",
        "Place the plant near a window with sheer curtains for optimal lighting."
    ],
    "watering": [
        "Water the plant when the top inch of soil feels dry to the touch.",
        "Over-watering can lead to root rot, so ensure proper drainage.",
        "It's better to underwater than overwater; allow the soil to dry slightly.",
        "Reduce watering during the winter months when growth slows down."
    ],
    "soil": [
        "Use a well-draining potting mix with peat or coco coir and perlite.",
        "The soil should retain some moisture but not become waterlogged.",
        "A potting mix formulated for aroids can be beneficial for this plant.",
        "Ensure the pot has drainage holes to prevent water accumulation."
    ],
    "toxic": [
        "Philodendron Mayoi is toxic to pets and humans if ingested.",
        "Ingestion can cause symptoms like vomiting, irritation, and swelling.",
        "Keep the plant out of reach of children and pets to ensure safety.",
        "Wash hands thoroughly after handling the plant to avoid any irritation."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to prevent dust buildup.",
        "Consider using a humidifier to maintain adequate humidity levels.",
        "Repot the plant every couple of years to refresh the soil and encourage growth.",
        "Prune any dead or yellowing leaves to keep the plant looking healthy."
    ]
}