{
    "name": "Philodendron Oxapapense",
    "climate": [
        "The Philodendron Oxapapense thrives in tropical climates with high humidity, which closely mimics its natural rainforest habitat.",
        "A consistently warm environment ranging from 65°F to 85°F is ideal for optimal growth and vibrancy in its leaves.",
        "Sudden temperature changes or exposure to cold drafts can negatively affect plant health; keep it away from AC units.",
        "This plant does not tolerate frost at all, so it must be maintained indoors or in a greenhouse in colder climates."
    ],
    "sunlight": [
        "Philodendron Oxapapense prefers bright, indirect sunlight to maintain its lush foliage.",
        "Direct sunlight can cause leaf scorch or fading, so placing it near east or north-facing windows is best.",
        "It can adapt to lower light conditions, but its growth may slow down and leaf size may diminish.",
        "Using sheer curtains or placing the plant behind other objects can help diffuse harsh sunlight effectively."
    ],
    "watering": [
        "Water the Philodendron Oxapapense thoroughly, allowing the top inch of soil to dry out between waterings.",
        "Overwatering can lead to root rot; ensure good drainage and avoid letting the plant sit in water.",
        "Underwatering can cause leaves to wilt; adjust the frequency based on temperature and humidity changes.",
        "In the growing season, more frequent watering may be needed, while in winter, cut back as growth slows."
    ],
    "soil": [
        "Well-draining soil with good aeration is crucial; a mix of peat, perlite, and orchid bark works well.",
        "A slightly acidic to neutral pH soil is ideal for this plant, closely simulating its natural environment.",
        "Compacted or heavy soils can hinder water flow and must be amended with organic matter for better drainage.",
        "Repotting every couple of years will refresh the soil and assist in accommodating its growth."
    ],
    "toxic": [
        "Philodendron Oxapapense contains calcium oxalate crystals, which are toxic to pets and humans if ingested.",
        "Contact with the sap can cause skin irritation; wearing gloves while handling is recommended."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to remove dust and unblock light absorption sites.",
        "Rotating the plant occasionally ensures even growth and prevents leaning towards the light source."
    ]
}