{
    "name": "Pineapple Lily",
    "climate": [
        "Pineapple Lilies thrive in temperate climates where temperatures are mild throughout the year.",
        "They can also adapt to warm climates but offer protection from harsh midday sun during peak summer months.",
        "These plants perform best in regions without extreme weather conditions or frost during their growing season.",
        "While primarily grown in regions with defined seasons, they can be overwintered indoors in colder climates."
    ],
    "sunlight": [
        "Pineapple Lilies prefer full sun exposure to develop their vibrant flower stalks and healthy foliage.",
        "In regions with strong sun, they benefit from partial shading during the hottest part of the day.",
        "They can tolerate partial shade but require a minimum of six hours of sunlight for optimal growth.",
        "Insufficient sunlight may lead to leggy growth and a reduced number of flower spikes."
    ],
    "watering": [
        "During their active growth period in spring and summer, water them regularly to keep the soil moist.",
        "Ensure adequate drainage to prevent waterlogging, which can cause bulb rot and other issues.",
        "In fall and winter, reduce watering significantly as the plant goes into a dormant phase.",
        "Monitor rainfall to adjust watering schedules, as excessive rain might reduce the need for additional watering."
    ],
    "soil": [
        "Pineapple Lilies thrive in well-drained soil enriched with organic matter to provide nutrients.",
        "Sandy or loamy soil types are preferred to ensure adequate drainage while retaining necessary moisture.",
        "They can tolerate a range of soil pH levels but perform best in slightly acidic to neutral soils.",
        "Improved drainage by adding gravel or sand can help prevent root and bulb rot in wetter climates."
    ],
    "toxic": [
        "All parts of the Pineapple Lily plant are considered toxic if ingested by pets and humans."
    ],
    "extra_care_tip": [
        "Overwinter Pineapple Lilies indoors in colder regions to protect bulbs from frost damage."
    ]
}