{
    "name": "Pink Jasmine",
    "climate": [
        "Pink Jasmine thrives in subtropical to temperate climates and prefers regions with moderate temperatures.",
        "It can also grow in Mediterranean climates where the summers are warm and dry, and the winters are mild.",
        "This plant is suited for regions without extreme cold, avoiding areas where temperatures drop excessively.",
        "High humidity is not a necessity, but it appreciates regular moisture in the air for healthy growth."
    ],
    "sunlight": [
        "Pink Jasmine prefers full sun exposure for optimal growth and abundant flowering.",
        "It can also tolerate partial shade, but prolonged shade may reduce its flowering potential.",
        "Morning sunlight is ideal, but it should be shielded from harsh, direct afternoon sun in hot regions.",
        "A location with at least 4 to 6 hours of direct sunlight per day is recommended for thriving blooms."
    ],
    "watering": [
        "Water Pink Jasmine moderately, ensuring that the top 1-2 inches of soil dries out before watering again.",
        "During the active growing season in spring and summer, it appreciates consistent moisture.",
        "Reduce watering in the winter months, allowing the plant to rest when not actively growing.",
        "Avoid overwatering as it can lead to root rot; ensure drainage in containers or ground."
    ],
    "soil": [
        "Pink Jasmine grows best in well-draining soils that are rich in organic matter and nutrients.",
        "It can thrive in loamy or sandy soils. The texture should prevent water logging around roots.",
        "Soil pH should be slightly acidic to neutral, ideally ranging from 6.0 to 7.5 for optimal health.",
        "If planting in containers, use a high-quality potting mix to facilitate adequate drainage."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune Pink Jasmine after flowering to control its size and encourage bushier growth.",
        "Support climbing Jasmine by providing a trellis or similar structure for the vines to adhere.",
        "In colder climates, consider mulching its base to protect roots in winter months.",
        "Be cautious of spider mites and aphids, especially in indoor conditions or greenhouses."
    ]
}