{
    "name": "Pistachio Tree",
    "climate": [
        "Pistachio trees thrive in areas with a Mediterranean climate featuring hot, dry summers.",
        "They require a long, hot summer period with plenty of sunshine to produce fruit properly.",
        "Mild but wet winters are ideal as the pistachio trees need some chill hours for flowering.",
        "Regions with hot, arid climates and cool winters such as the Middle East are ideal."
    ],
    "sunlight": [
        "Pistachio trees need full sun exposure for most of the day to fruit well.",
        "They should be planted in an area that receives at least eight hours of direct sunlight daily.",
        "Insufficient sunlight can lead to poor growth and reduced nut production.",
        "South-facing spaces with unobstructed light are best for optimal sunlight exposure."
    ],
    "watering": [
        "Pistachio trees are drought-tolerant but require regular watering during dry periods.",
        "They benefit from deep watering once or twice a month during hot summers.",
        "Overwatering should be avoided as pistachio trees do not thrive in waterlogged soil.",
        "Irrigation systems that allow for consistent moisture without soaking are ideal."
    ],
    "soil": [
        "Well-drained soil is crucial for pistachio trees to prevent root rot and ensure productivity.",
        "They prefer sandy loam or loam soils that allow for adequate drainage and aeration.",
        "Heavy clay soils should be avoided as they retain too much water around the roots.",
        "Amendments like organic matter can enhance soil structure and fertility for pistachios."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Pruning during dormancy helps shape the tree and remove dead or diseased wood.",
        "Ensuring male and female trees for pollination is essential for nut production.",
        "Pistachios have high salt tolerance but should be monitored for any salt build-up.",
        "Regular checks for pests like psyllids and navel orangeworm protect tree health."
    ]
}