{
    "name": "Plantain Lily",
    "climate": [
        "Plantain lilies thrive in temperate climates with mild, moderate temperatures, ideally avoiding extreme heat.",
        "These plants are well-suited for regions with reliable seasonal rainfall, supporting their lush growth.",
        "While tolerant of cooler climates, severe frost should be avoided to prevent plant damage.",
        "High humidity levels common in coastal or forest areas can be beneficial for plantain lilies."
    ],
    "sunlight": [
        "Plantain lilies prefer partial to full shade, as direct sunlight can scorch their leaves.",
        "In areas with hot summers, it is crucial to ensure these plants receive ample afternoon shade.",
        "Morning sunlight can be beneficial, but protection from harsh midday sun is recommended.",
        "Hostas are ideally grown under trees, where dappled sunlight helps them flourish."
    ],
    "watering": [
        "Consistent moisture is vital, so water deeply and regularly, particularly during dry periods.",
        "Overwatering can lead to root rot, so ensure soil has adequate drainage to avoid waterlogging.",
        "Mulching helps retain moisture and maintain cool soil temperatures for hostas.",
        "Reduce watering frequency in fall as the plant starts preparing for dormancy during winter."
    ],
    "soil": [
        "Rich, well-draining soil with plenty of organic matter is ideal for plantain lilies.",
        "Slightly acidic to neutral soil pH ranges between 6.0 and 7.5 are optimal for growth.",
        "Loamy soil that retains moisture yet drains excess water efficiently is important.",
        "Ensure the soil remains consistently moist, as drying out can harm their health."
    ],
    "toxic": [
        "Plantain lilies are toxic to pets, especially cats and dogs, if ingested.",
        "Symptoms of ingestion in pets include vomiting, diarrhea, and lethargy."
    ],
    "extra_care_tip": [
        "Regularly inspect hostas for slug damage, and use barriers or natural predators to control them.",
        "Dividing clumps every few years in spring or fall can help rejuvenate older plants."
    ]
}