{
    "name": "Plectranthus",
    "climate": [
        "Plectranthus plants thrive in tropical and subtropical climates with warm temperatures all year long.",
        "They prefer conditions where the temperature remains above 10°C as they are not frost tolerant.",
        "Humidity is beneficial for Plectranthus, making them well-suited for humid environments.",
        "These plants struggle in cold climates and need to be protected from freezing temperatures."
    ],
    "sunlight": [
        "Plectranthus prefers bright indirect sunlight, as direct sun can scorch the leaves.",
        "They can also survive in partial shade, making them versatile for various indoor settings.",
        "In low light conditions, Plectranthus may experience stunted growth and less vibrant foliage.",
        "Ensure they receive enough filtered light to maintain healthy, lush growth."
    ],
    "watering": [
        "Water Plectranthus thoroughly but allow the topsoil to dry out between waterings to avoid root rot.",
        "They require consistent moisture during the growing season but should not be waterlogged.",
        "Overwatering or letting them sit in water can lead to fungal issues and root decay.",
        "Reduce watering in the dormant season, ensuring the soil is only slightly moist."
    ],
    "soil": [
        "Plectranthus plants prefer a well-draining potting mix to prevent water retention.",
        "A soil mix that contains peat, perlite, and a bit of sand works well for these plants.",
        "They do well in fertile soil with good organic content to support healthy growth.",
        "Avoid heavy clay soils that retain moisture as these can lead to root problems."
    ],
    "toxic": [
        "Plectranthus is generally non-toxic to humans and pets, making it a safe choice for homes with animals.",
        "Despite being non-toxic, it is advised to keep plants out of reach from pets who might play with them."
    ],
    "extra_care_tip": [
        "Pinching back the tips of Plectranthus can encourage bushier growth and prevent legginess.",
        "Regular fertilization during the growing season can improve growth and leaf vibrancy."
    ]
}