{
    "name": "Polka Dot Plant",
    "climate": [
        "Polka Dot Plants thrive in warm climates; they are best in temperatures above 60°F, ensuring consistent warmth.",
        "They require a humid environment, similar to their native tropical habitats, to maintain leaf health.",
        "Avoid cold drafts and sudden temperature changes; they are sensitive to cold environments.",
        "They can be grown outdoors in USDA hardiness zones 10 and 11, enjoying warm, tropical climates."
    ],
    "sunlight": [
        "Provide bright, indirect sunlight to the Polka Dot Plant for optimal growth and vibrant foliage.",
        "Avoid direct sunlight, which can scorch the leaves and fade the plant's distinctive colors.",
        "They can tolerate some shade but will develop better coloring with sufficient light exposure.",
        "Supplement light using grow lights during shorter days, especially in northern regions, to benefit plant growth."
    ],
    "watering": [
        "Water the Polka Dot Plant consistently, ensuring the soil remains moist but not waterlogged.",
        "Allow the top inch of soil to dry between waterings to prevent root rot and overwatering issues.",
        "Reduce watering frequency during the winter months as the plant's growth rate slows.",
        "Mist regularly or place near a humidifier in dry environments to support healthy foliage and growth."
    ],
    "soil": [
        "Use a well-draining potting mix, preferably with a high content of organic matter for the Polka Dot Plant.",
        "A soil mix containing peat moss, perlite, and compost will ensure adequate drainage and aeration.",
        "Ensure the pot has drainage holes to prevent water accumulation which can lead to root rot problems.",
        "A slightly acidic to neutral pH range is ideal for the Polka Dot Plant, promoting optimal nutrient uptake."
    ],
    "toxic": [
        "Polka Dot Plant is generally non-toxic to pets and humans, but ingestion can cause mild discomfort."
    ],
    "extra_care_tip": [
        "Pinch back the stems regularly to encourage bushy growth and prevent the plant from becoming leggy."
    ]
}