{
    "name": "Protea",
    "climate": [
        "Proteas are used to a Mediterranean climate where winters are mild, and summers are warm.",
        "They thrive in regions where the climate is mostly dry, with low humidity levels.",
        "They prefer areas with a distinct dry season rather than year-round rainfall.",
        "Frosts should be minimal as Proteas do not tolerate very cold conditions well."
    ],
    "sunlight": [
        "Proteas require full sunlight to thrive, needing direct sunlight for most of the day.",
        "They flourish in environments where they can receive at least six to eight hours of sunlight daily.",
        "Partial shade can hinder their blooming process and overall growth ability.",
        "They are not suited for indoor growing unless ample direct sunlight is provided."
    ],
    "watering": [
        "Proteas prefer well-drained conditions, thus they should not be overwatered as it can lead to root rot.",
        "It is crucial to allow the soil to dry out between watering times for best health.",
        "In drier periods, they still don't benefit from frequent watering; cautious monitoring is advisable.",
        "Rainwater is preferable as it is more acidic than tap water, which they naturally prefer."
    ],
    "soil": [
        "Acidic, sandy soil is most suitable as it mimics the natural habitat of Proteas.",
        "They thrive in poor soils, as too much fertility can promote growth that isn't sustainable.",
        "Good drainage is essential, as waterlogged conditions can quickly kill Proteas.",
        "Avoid heavy or clay soils unless significant amendments are made for drainage."
    ],
    "toxic": [
        "Proteas are not generally known to be toxic to pets or humans. However, consuming plants is always not recommended."
    ],
    "extra_care_tip": [
        "Protea plants benefit from seasonal pruning to encourage more vigorous blooming.",
        "Avoid fertilizing heavily; if necessary, use a low-phosphorus fertilizer sparingly.",
        "Pests rarely attack Proteas, but regularly check for aphids and caterpillars.",
        "Ensure that the planting site offers enough wind protection as strong winds can damage blooms."
    ]
}