{
    "name": "Pyrethrum",
    "climate": [
        "Pyrethrum thrives in temperate climates where summers are mild. It requires cool nights and warm days to grow well.",
        "This plant can also be grown in regions with moderate seasonal changes. It tolerates cooler temperatures but not extreme cold.",
        "In climates with mild winters and cool summers, Pyrethrum grows optimally. It does not tolerate hot and humid conditions.",
        "Avoid tropical or subtropical climates as Pyrethrum does not thrive in excessive heat and humidity."
    ],
    "sunlight": [
        "Pyrethrum requires full sun to partial shade for best growth. It needs at least 6 hours of direct sunlight each day.",
        "Although it can tolerate some shade, maximizing sun exposure yields healthier plants and better flowering.",
        "The plant prefers locations where it receives morning sun and a bit of afternoon shade to prevent overheating.",
        "Avoid planting Pyrethrum in deep shade, as too little sunlight will lead to leggy growth and poor flowering."
    ],
    "watering": [
        "Consistent watering is crucial, but ensure the soil is well-drained to prevent root rot in Pyrethrum.",
        "The plant prefers moderately moist soil, so water regularly but do not allow the soil to become soggy.",
        "Reduce watering during winter as the plant's growth slows; ensure the soil is just slightly damp.",
        "Avoid letting the soil dry out completely between waterings, especially during the growing season."
    ],
    "soil": [
        "Pyrethrum thrives in well-drained, sandy or loamy soil with good organic content to support its growth.",
        "The soil should be rich in organic matter; incorporate compost or well-rotted manure before planting.",
        "A slightly acidic to neutral pH level is ideal; ensure soil pH is between 6.0 and 7.0 for optimal growth.",
        "Avoid heavy clay soils that retain water, as they can cause root rot and other issues in Pyrethrum plants."
    ],
    "toxic": [
        "Pyrethrum contains natural compounds that are toxic to insects, which can also be toxic to pets and humans.",
        "Contact can cause skin irritation and allergic reactions in sensitive individuals. Ingestion can be harmful."
    ],
    "extra_care_tip": [
        "Deadhead spent flowers to promote further blooming and maintain plant health and appearance.",
        "Consider applying mulch around the base to retain moisture and suppress weeds in hot climates."
    ]
}