{
    "name": "Rain Lily",
    "climate": [
        "Rain lilies thrive in warm climates, particularly in zones where temperatures are mild throughout the year.",
        "They are native to tropical and subtropical regions, making them well-suited to similar environments.",
        "These plants can tolerate a range of climates but flourish in areas with high humidity levels.",
        "Rain lilies can endure cooler temperatures for short periods but prefer consistently warm conditions."
    ],
    "sunlight": [
        "Rain lilies grow best in full sunlight, which promotes vigorous blooming and healthy growth.",
        "They can tolerate partial shade but may produce fewer flowers compared to being in full sun.",
        "A spot with at least six hours of direct sunlight each day is ideal for rain lilies.",
        "During extremely hot weather, some afternoon shade can help prevent scorching of the leaves."
    ],
    "watering": [
        "Rain lilies require moderate watering, ensuring that the soil remains consistently moist but not waterlogged.",
        "Water these plants thoroughly during dry spells, particularly when they are actively growing and blooming.",
        "During the dormant period, reduce watering to allow the soil to dry out somewhat between waterings.",
        "Rain lilies thrive in well-draining soil conditions to prevent root rot from stagnant water."
    ],
    "soil": [
        "Rain lilies prefer well-draining soil, rich in organic matter, to support healthy growth and flowering.",
        "A soil mix that includes sand, loam, and compost is ideal for providing necessary nutrients and drainage.",
        "These plants can adapt to a range of soil types, but compacted or clay-heavy soil should be avoided.",
        "Enhancing the soil with organic matter improves its ability to retain just enough moisture for rain lilies."
    ],
    "toxic": [
        "Rain lilies are considered toxic if ingested, particularly for pets such as cats and dogs.",
        "The plant contains alkaloids that can cause vomiting, diarrhea, and other symptoms if consumed.",
        "Handling rain lilies with care is advised, especially around children and curious animals.",
        "Seek veterinary assistance promptly if any part of the plant is ingested by pets."
    ],
    "extra_care_tip": [
        "After the flowering season, allow the foliage to die back naturally to store energy for future blooms.",
        "Bulb division can help to control overcrowding and promote a healthier stand of rain lilies.",
        "Applying a balanced fertilizer during the growing season can enhance flowering performance.",
        "Protect rain lilies from freezing temperatures by mulching or moving containers indoors where necessary."
    ]
}