{
    "name": "Red Currant",
    "climate": [
        "Red currants thrive in temperate climates where winters are cold enough to induce dormancy.",
        "They require a distinct seasonal change with cold winters and cool summers for the best fruit production.",
        "These plants are well-suited to climates with a moderate amount of precipitation, avoiding extreme dryness.",
        "Regions with a prolonged growing season and minimal frost during blossom time are ideal for red currants."
    ],
    "sunlight": [
        "Red currants prefer partial to full sun, needing at least 4-6 hours of sunlight daily.",
        "They can tolerate shade, but fruit production may decrease significantly in low light conditions.",
        "In hotter climates, partial shade can protect the plant from excessive heat stress.",
        "In regions with intense sun, protection from the afternoon sun can prevent leaf scorching."
    ],
    "watering": [
        "Consistent watering is crucial; soil should be kept evenly moist, especially during fruiting.",
        "Avoid waterlogging as excessive moisture can lead to root rot and other fungal diseases.",
        "Irrigate deeply at the base rather than overhead to minimize foliage diseases.",
        "Regular mulching can help retain soil moisture and reduce the need for frequent watering."
    ],
    "soil": [
        "Red currants grow best in well-draining, loamy soil enriched with organic matter.",
        "They require slightly acidic to neutral pH levels, ideally between 6.0 and 6.5.",
        "Soil should be rich in nutrients to support vigorous growth and abundant fruiting.",
        "Compacted or clay-heavy soils must be amended to enhance drainage and root growth."
    ],
    "toxic": [
        "The unripe fruit contains hydrogen cyanide which can be toxic if consumed in large quantities."
    ],
    "extra_care_tip": [
        "Prune annually during dormancy to help improve air circulation and sunlight penetration."
    ]
}