{
    "name": "Red Spider Lily",
    "climate": [
        "Red Spider Lilies thrive in warm temperate climates, flourishing in zones with mild winters.",
        "They do not tolerate extreme cold well, requiring protection in regions with harsh winter temperatures.",
        "In areas with distinct seasons, they benefit from hot summers and dry conditions.",
        "These plants are well-suited for sub-tropical conditions with moderate humidity levels."
    ],
    "sunlight": [
        "Red Spider Lilies prefer full sun to partial shade, ideally receiving at least 6 hours of direct sunlight.",
        "Too much shade can reduce flowering, so it is important to ensure ample sunlight exposure.",
        "They can adapt to a range of light conditions but flourish with adequate sunlight.",
        "Partial shade in the hottest part of the day can prevent the wilting of leaves."
    ],
    "watering": [
        "During the growing season, keep the soil consistently moist but not waterlogged to support healthy growth.",
        "They require less water during dormancy, which typically occurs after flowering and before the next growth cycle.",
        "Ensure good drainage to prevent bulb rot, particularly essential in regions prone to heavy rainfall.",
        "Regular watering is particularly crucial during dry spells to maintain soil moisture levels."
    ],
    "soil": [
        "Red Spider Lilies prefer well-draining, fertile soil with a slightly acidic to neutral pH balance.",
        "Amending the soil with organic matter can enhance fertility and drainage, promoting healthy growth.",
        "They can tolerate poor soil but thrive in rich, loamy conditions that retain adequate moisture.",
        "Avoid heavy clay soil that retains water, as this can lead to bulb rot and poor plant health."
    ],
    "toxic": [
        "The Red Spider Lily is toxic to humans and animals if ingested, containing lycorine which can cause nausea and vomiting.",
        "All parts of the plant are considered toxic, with the bulbs being particularly harmful when consumed."
    ],
    "extra_care_tip": [
        "To encourage blooming, a period of dryness during the summer months can stimulate flower production.",
        "Remove spent flowers and stems after blooming to encourage growth and prevent disease."
    ]
}