{
    "name": "Rhododendron",
    "climate": [
        "Rhododendrons thrive in cool, moist climates similar to their native habitats.",
        "They require protection from extremely hot or dry conditions for best growth.",
        "Climate with high humidity levels supports vital health and flowering of the plant.",
        "Temperature extremes, whether too hot or too cold, can harm rhododendrons."
    ],
    "sunlight": [
        "Rhododendrons prefer partial shade to protect them from the harsh midday sun.",
        "Morning sunlight with afternoon shade is ideal for their growth and flowering.",
        "Excessive shade can reduce flowering and make the plant leggy and less attractive.",
        "Direct and intense sunlight can scorch leaves and affect overall plant health."
    ],
    "watering": [
        "Consistent, ample watering is essential, maintaining moist but well-drained soil.",
        "Water deeply and regularly, especially during dry spells or hot weather periods.",
        "Avoid letting the soil dry out completely, which can stress the plant and reduce blooms.",
        "Inadequate or inconsistent watering may lead to wilting and poor plant vigor."
    ],
    "soil": [
        "Rhododendrons prefer acidic soil with a pH level of 4.5 to 6.0 for optimal growth.",
        "The ideal soil mix is rich in organic matter, providing good drainage and aeration.",
        "Avoid heavy clay soils that retain water; they can lead to root rot in rhododendrons.",
        "Mulching around the base helps retain moisture and maintain an even soil temperature."
    ],
    "toxic": [
        "All parts of rhododendrons, including leaves and flowers, are toxic if ingested.",
        "The plant contains grayanotoxins that can cause symptoms like nausea and vomiting.",
        "Ingestion of rhododendrons can lead to serious illness in pets, including dogs and cats.",
        "Handling the plant may provoke skin irritation or allergic reactions in sensitive individuals."
    ],
    "extra_care_tip": [
        "Regular deadheading of spent flowers can encourage more blooms.",
        "Prune the plant after flowering to shape and remove dead or diseased wood.",
        "Fertilize in early spring with a specialized rhododendron or acid-loving plant fertilizer.",
        "Protect roots with mulch, especially during winter, to prevent freezing and damage."
    ]
}