{
    "name": "Rockrose",
    "climate": [
        "Rockroses thrive in Mediterranean-type climates, which are characterized by mild, wet winters and dry, hot summers.",
        "These plants can also adapt to oceanic climates, where temperatures are generally mild and there's no extreme heat or cold, but they prefer drier conditions.",
        "Rockroses can survive in dry climates, where low rainfall and high temperatures are common, thanks to their drought-resistant nature.",
        "They are less favorable in tropical climates due to excessive humidity, which can lead to root rot and other issues."
    ],
    "sunlight": [
        "Rockroses require full sun to thrive; they need at least six hours of direct sunlight each day to bloom and grow healthy.",
        "In partial shade, rockroses may grow but will likely produce fewer flowers and may become leggy, losing their compact shape.",
        "These plants are not suited for deep shade environments, as insufficient sunlight can hinder their growth and flowering potential.",
        "Sunlight intensity varies with the seasons, but rockroses handle varying sun intensities well if they are acclimatized gradually."
    ],
    "watering": [
        "Rockroses require minimal watering once established; overwatering can lead to root rot and diminished plant health.",
        "During the initial planting phase, water regularly to ensure the roots establish firmly in the soil and the plant acclimates.",
        "In dry spells or drought conditions, occasional deep watering can help ensure the plant receives adequate moisture requirements.",
        "Rainfall generally suffices in climates with seasonal rain; additional watering is not often necessary except during extreme heat."
    ],
    "soil": [
        "Rockroses prefer well-drained soils; sandy or gravelly soils are ideal to prevent water retention and root rot.",
        "These plants are adaptable to poor soil conditions and can thrive in nutrient-depleted soils, requiring minimal fertilization.",
        "Rockroses can tolerate slightly alkaline soils but generally thrive best in neutral pH conditions for optimal growth.",
        "To improve drainage in heavier clay soils, consider amending with sand or perlite to mimic their natural habitat conditions."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To enhance blooming, consider pruning rockroses lightly after flowering to maintain their shape and encourage new growth.",
        "Preventive pest control is recommended, as rockroses can occasionally be affected by common garden pests such as aphids."
    ]
}