{
    "name": "Sago Palm",
    "climate": [
        "Sago Palm thrives in tropical and subtropical climates with warm temperatures.",
        "It can tolerate mild frosts but prefers temperatures above 50°F year-round.",
        "Humidity is also important; they do best in moist air conditions typical of tropics.",
        "While they are adaptable, extremely dry or too wet areas may not be ideal."
    ],
    "sunlight": [
        "Sago Palms prefer bright, indirect sunlight and can tolerate some direct sun.",
        "They can adapt to lower light conditions but growth may slow significantly.",
        "Too much direct sunlight can lead to scorching of the leaves and fronds.",
        "In very low light, they may become leggy and not develop full, healthy foliage."
    ],
    "watering": [
        "Sago Palms require moderate watering; soil should be kept consistently moist.",
        "Allow the top inch of soil to dry out between waterings to prevent overwatering.",
        "It's essential to avoid having the plant sit in water as this promotes root rot.",
        "During winter, reduce watering frequency as the growth rate naturally decreases."
    ],
    "soil": [
        "Well-drained, sandy soil with good organic content suits Sago Palm best.",
        "Soil should retain some moisture but drain excess water efficiently to prevent rot.",
        "A pH level slightly acidic to neutral, around 6.0 to 7.0, is ideal for growth.",
        "Consider mixing in some perlite or sand to improve drainage and aeration."
    ],
    "toxic": [
        "All parts of the Sago Palm are highly toxic if ingested by humans and animals.",
        "The seeds or nuts are particularly poisonous and can cause severe liver failure.",
        "Symptoms of poisoning include vomiting, diarrhea, and neurological signs.",
        "Keep pets and children away from this plant to ensure their safety."
    ],
    "extra_care_tip": [
        "Prune by removing yellow or dead fronds to encourage healthy growth and appearance.",
        "Apply a balanced, slow-release fertilizer in the growing season for best results.",
        "Refrain from heavy pruning as this can stress the plant and stunt its growth.",
        "Watch for pests such as scale insects and treat promptly with appropriate methods."
    ]
}