{
    "name": "Satin Pothos",
    "climate": [
        "Thrives in tropical climates with high humidity levels which can be found in rainforests.",
        "Does well in a warm climate where temperatures are consistently in the range of 65-85°F.",
        "Not tolerant to cold climates, requiring protection from temperatures below 60°F.",
        "Needs a climate that replicates jungle environments, including shady, damp areas."
    ],
    "sunlight": [
        "Prefers indirect light; direct sun can scorch its leaves after prolonged exposure.",
        "Grows well in bright, filtered sunlight, which replicates the natural habitat under tree canopies.",
        "Low-light tolerant, but growth may slow and leaves may not be as vibrant in lesser light.",
        "Exposure to a north-facing window or similar indirect light source works ideally."
    ],
    "watering": [
        "Requires consistent moisture; soil should be kept slightly damp but not soggy.",
        "In its growing period, regular watering is important, but allow topsoil to dry out slightly.",
        "Decreases in watering frequency during winter, when plant growth naturally slows.",
        "Over-watering can lead to root rot, and the plant benefits from good drainage."
    ],
    "soil": [
        "Best grown in well-draining potting mix that retains some moisture yet allows air flow.",
        "Prefers soil that is rich in organic matter to provide necessary nutrients and support growth.",
        "Can thrive in a peat-based potting mix, which maintains the necessary moisture balance.",
        "Avoid heavy or clay soil types; a potting mix formulated for tropical plants is ideal."
    ],
    "toxic": [
        "It contains calcium oxalate crystals, which can irritate the mouth and digestive tract if ingested by pets or humans.",
        "The leaves are toxic and can cause significant pain and discomfort when chewed or swallowed."
    ],
    "extra_care_tip": [
        "Wipe leaves occasionally with a damp cloth to remove dust and keep them breathing well.",
        "If it becomes leggy or loses leaves at the base, trim back to encourage bushy new growth.",
        "Repot annually in spring with fresh soil to provide nutrients and encourage robust development.",
        "Periodically rotating the plant helps ensure even growth towards light, promoting balance."
    ]
}