{
    "name": "Scallion",
    "climate": [
        "Scallions thrive best in cool to mild climates with temperatures ranging from 50°F to 75°F.",
        "They can tolerate light frosts, making them suitable for early spring or late fall planting.",
        "Areas with warm days and cool nights provide ideal growing conditions for scallions.",
        "High humidity levels are not essential, but ensure good air circulation to prevent diseases."
    ],
    "sunlight": [
        "Scallions require full sun exposure to grow optimally and produce healthy bulbs.",
        "They can also tolerate partial shade, especially in regions with intense sunlight.",
        "For robust growth, ensure scallions receive at least 6 hours of sunlight daily.",
        "Avoid planting in dense shade as it can result in elongated and weak plants."
    ],
    "watering": [
        "Maintain consistent moisture in soil for scallions, especially during dry spells.",
        "Deep watering once a week helps in developing strong and tasty scallions.",
        "Avoid waterlogging as it may cause root rot and adversely affect growth.",
        "Mulching can help retain soil moisture and reduce the frequency of watering."
    ],
    "soil": [
        "Well-draining loamy soil with a pH level between 6.0 and 7.0 is ideal for scallions.",
        "Rich in organic matter, the soil should be fertile and have good drainage.",
        "Avoid heavy clay soils as they retain water, potentially harming plant roots.",
        "Soil preparation with compost ensures nutrient availability for scallion growth."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regularly remove weeds around scallions to prevent competition for nutrients.",
        "Use organic mulch to maintain soil moisture and suppress weed growth.",
        "Periodically thin seedlings to allow adequate space for healthy plant development.",
        "Protect young plants from pests like onion maggots and aphids with appropriate measures."
    ]
}