{
    "name": "Scented-Leaved Geraniums",
    "climate": [
        "Scented-leaved geraniums thrive in temperate climates where frost is rare.",
        "They can do well in Mediterranean regions with dry summers and wet winters.",
        "These plants prefer a climate with good air circulation and moderate humidity.",
        "They are generally not frost-hardy and require protection from cold winds."
    ],
    "sunlight": [
        "Scented-leaved geraniums need full sun to partial shade to grow well.",
        "They perform best in bright light but can tolerate some afternoon shade.",
        "Avoid placing them in spots with full day direct harsh sunlight.",
        "Insufficient sunlight results in leggy growth and fewer flowers or leaves."
    ],
    "watering": [
        "Allow the top inch of soil to dry out before watering these geraniums again.",
        "They prefer moderate watering, ensuring the soil is not constantly soggy.",
        "Overwatering may lead to root rot and should be avoided at all times.",
        "In summer, they require slightly more water than in the cooler months."
    ],
    "soil": [
        "Well-draining soil is crucial; sandy or loamy soil is highly recommended.",
        "A mix of compost with perlite or sand can improve drainage and aeration.",
        "Avoid heavy clay soils which prevent proper drainage and risk root health.",
        "Soil pH should be slightly acidic to neutral, ideally balanced around 6-7."
    ],
    "toxic": [
        "Scented-leaved geraniums are mildly toxic to pets such as cats and dogs.",
        "Ingestion by pets can cause dermatitis, vomiting, and lethargy in them."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain a bushy form and remove any leggy growth.",
        "Pinching back growing tips encourages branching and denser foliage.",
        "Bring indoors or provide shelter before frost to prevent damage.",
        "Monitor closely for pests like spider mites and aphids for healthy growth."
    ]
}