{
    "name": "Schefflera",
    "climate": [
        "Schefflera thrives in a tropical climate with high humidity and warm temperatures.",
        "It is best suited for USDA hardiness zones 10 to 12 where temperatures are mild.",
        "Avoid placing Schefflera in areas where temperatures drop below 50 degrees Fahrenheit.",
        "In cooler climates, it is often grown as a houseplant to mimic its tropical origins."
    ],
    "sunlight": [
        "Schefflera prefers bright, indirect light to maintain its lush, vibrant foliage.",
        "Avoid direct sunlight, as it can scorch the leaves and cause leaf drop.",
        "In low light conditions, Schefflera may grow slower and become leggy.",
        "A north or east-facing window is ideal for providing gentle morning sunlight."
    ],
    "watering": [
        "Water Schefflera when the top 2 inches of soil feel dry to prevent overwatering.",
        "Ensure the pot has drainage holes to avoid waterlogging, which can lead to root rot.",
        "In winter, reduce watering frequency as the plant's growth slows down.",
        "Mist the leaves regularly to increase humidity and prevent leaf browning."
    ],
    "soil": [
        "A well-draining potting mix, rich in organic matter, is ideal for Schefflera.",
        "Combine regular potting soil with perlite or sand for improved soil aeration.",
        "A slightly acidic to neutral pH range, about 6.0 to 7.0, is preferred.",
        "Re-pot every couple of years to refresh the soil and accommodate growth."
    ],
    "toxic": [
        "Schefflera contains calcium oxalate crystals which are toxic if ingested.",
        "The plant can cause irritation and swelling in the mouth, tongue, and throat.",
        "Symptoms of toxicity may include drooling, vomiting, and difficulty swallowing.",
        "Keep Schefflera out of reach of pets and children to ensure safety."
    ],
    "extra_care_tip": [
        "Rotate the plant occasionally for even growth and to prevent leaning.",
        "Prune regularly to maintain shape and promote bushier growth of the plant.",
        "Keep away from drafts; sudden temperature changes can stress the plant.",
        "Use a water-soluble fertilizer during the growing season for best results."
    ]
}