{
    "name": "Showy Lady's Slipper Orchid",
    "climate": [
        "Prefers temperate climates with cold winters for proper dormancy.",
        "Thrives in regions with high humidity and moderate rainfall conditions.",
        "Requires seasonal temperature variations for optimal growth and blooming.",
        "Found naturally in cool to cold climates with deciduous forests."
    ],
    "sunlight": [
        "Requires partial sun to dappled shade for best growth conditions.",
        "Too much direct sunlight can cause leaf burn and injury to the plant.",
        "Filtered sunlight that mimics forest understories is optimal for them.",
        "Avoid full sun exposure, especially in the hottest parts of the day."
    ],
    "watering": [
        "Needs consistently moist soil conditions without being waterlogged.",
        "During the growing season, regular watering is essential to thrive.",
        "Soil should never be allowed to dry out completely between waterings.",
        "In dry periods, increase watering frequency to maintain soil moisture."
    ],
    "soil": [
        "Prefers well-drained soils rich in organic matter for root health.",
        "Moist, loamy soils that retain moisture but drain excess water are ideal.",
        "Acidic to neutral pH levels in soil ensure optimal nutrient uptake.",
        "Avoid heavy clay or overly sandy soils that can hinder growth."
    ],
    "toxic": [
        "The plant is not considered toxic to humans or pets. However, some related species may cause skin irritation upon contact.",
        "Handling the plant's leaves or flowers may cause mild irritation, so it is advisable to wear gloves.",
        "Ingestion is not recommended and may cause gastrointestinal discomfort if consumed in large quantities."
    ],
    "extra_care_tip": [
        "Mulching around the base of the plant helps retain moisture and keeps roots cool.",
        "Regularly check for pests such as slugs that can damage the plant's foliage.",
        "Consider adding a layer of pine needles to mimic its natural habitat and improve acidity.",
        "Repotting may be necessary every few years to refresh the soil and improve growth."
    ]
}