{
    "name": "Siberian Iris",
    "climate": [
        "The Siberian Iris thrives in climates with cold winters as it requires a period of dormancy.",
        "It is well suited for temperate regions where summer temperatures do not get excessively high.",
        "This plant can tolerate some humidity but prefers environments that are not overly damp.",
        "The Siberian Iris can adapt to climates with varying levels of rainfall throughout the year."
    ],
    "sunlight": [
        "Siberian Iris prefers full sun to partial shade, needing at least six hours of sunlight.",
        "Though it can grow in partial shade, full sun exposure promotes better flowering.",
        "It can endure some degree of shade, but blooming may be less abundant without ample light.",
        "Ensure the plant gets the morning sun if grown in warmer regions to avoid midday heat."
    ],
    "watering": [
        "Siberian Iris requires consistent watering, especially during the growing season.",
        "The soil should be kept moist, particularly when blooms are forming in spring.",
        "In drought conditions, more frequent watering is necessary to maintain soil moisture.",
        "Avoid overwatering to prevent root rot; ensure drainage is adequate in the planting area."
    ],
    "soil": [
        "Siberian Iris thrives in fertile, well-drained soils that retain some moisture.",
        "It prefers slightly acidic to neutral pH levels in soil compositions.",
        "The plant can grow in average garden soil but benefits from organic matter additions.",
        "Heavy clay soils should be amended with organic material to improve drainage and aeration."
    ],
    "toxic": [
        "Siberian Iris is considered toxic if ingested, particularly to pets such as cats and dogs."
    ],
    "extra_care_tip": [
        "Divide the plant every few years to ensure healthy growth and prevent overcrowding.",
        "After flowering, allow the foliage to remain as it stores energy for the next blooming season."
    ]
}