{
    "name": "Snap Peas",
    "climate": [
        "Snap peas thrive in cool climates where temperatures range between 55°F and 70°F.",
        "They prefer growing in climates that have cool springs and mild summers for best yield.",
        "These plants can tolerate light frosts, which makes them suitable for early spring planting.",
        "Snap peas struggle in hot climates with daytime temperatures consistently above 85°F."
    ],
    "sunlight": [
        "Snap peas require full sun, which means at least six to eight hours of direct sunlight daily.",
        "In partial shade, snap peas might grow taller but will produce fewer pods.",
        "Ensuring the plants receive consistent sunlight helps them develop strong vines and more blooms.",
        "Too much shade can result in weak growth and a reduced pea harvest, impacting yield."
    ],
    "watering": [
        "Consistent moisture is crucial, so water snap peas regularly, especially during dry periods.",
        "Avoid waterlogging the soil; provide adequate drainage to prevent root rot.",
        "These plants generally need about an inch of water per week, adjusting for rainfall.",
        "Checking soil moisture frequently will help ensure it remains evenly moist, not soggy."
    ],
    "soil": [
        "Snap peas prefer well-drained soil rich in organic matter, like compost.",
        "A slightly acidic to neutral soil pH, approximately 6.0 to 7.5, is optimal for growth.",
        "Loamy soils that retain some moisture but drain well are best for these legumes.",
        "Preparing the soil with plenty of organic matter enhances nutrient availability and growth."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Support snap peas with trellises or poles to prevent them from sprawling on the ground.",
        "Regularly rotate planting areas to avoid soil-borne diseases affecting future crops.",
        "Mulching helps conserve soil moisture, suppress weeds, and maintain cooler root environments.",
        "Interplanting with herbs like mint or basil can deter pests that affect pea plants."
    ]
}