{
    "name": "Snowdrop",
    "climate": [
        "Snowdrops thrive in temperate climates where winters are cold, allowing the bulbs to chill properly.",
        "They prefer regions with a distinct change in seasons, which helps the bulb develop in the soil.",
        "They are well-suited to locations with moderate summers that do not have extreme heat conditions.",
        "Snowdrops can tolerate mild winters, but they require some chilling period to bloom effectively."
    ],
    "sunlight": [
        "Snowdrops grow best in partial to dappled sunlight, providing them a balance of light and shade.",
        "They can tolerate full sun conditions if located in areas with cooler climates to avoid overheating.",
        "Snowdrops benefit from being planted under deciduous trees, getting sun before leaves grow.",
        "In gardens, planting them in the morning sun can prevent wilting from afternoon heat exposure."
    ],
    "watering": [
        "Snowdrops need regular watering during the growing season to keep the soil moist but not waterlogged.",
        "They are susceptible to drought stress, so consistent soil moisture is crucial until they die back.",
        "Once established, snowdrops can tolerate short dry periods, reflecting their woodland origins.",
        "Overwatering can cause bulb rot, so ensure good drainage to prevent water from pooling around bulbs."
    ],
    "soil": [
        "They thrive in well-draining soil enriched with organic matter to mimic their natural habitat.",
        "Snowdrops prefer soil that is neutral to slightly alkaline, with good fertility levels for nourishment.",
        "It's important the soil retains moisture but also provides adequate drainage to prevent bulb rot.",
        "Adding compost or leaf mold can improve soil structure, promoting healthy root and bulb growth."
    ],
    "toxic": [
        "Snowdrops contain alkaloids like galantamine, which are toxic if ingested in large quantities.",
        "The plant can cause skin irritation and allergic reactions in sensitive individuals when handled."
    ],
    "extra_care_tip": [
        "To encourage naturalizing, leave snowdrop foliage to die back naturally without cutting it early.",
        "Dividing clumps right after flowering helps maintain vigor and promotes spreading in the garden."
    ]
}