{
    "name": "Snow Queen Pothos",
    "climate": [
        "This plant thrives in a warm, humid climate typical to tropical regions.",
        "Snow Queen Pothos can adapt to a wide range of indoor climates quite well.",
        "For optimal growth, maintain a temperature range between 65°F and 85°F.",
        "Avoid exposing this plant to cold drafts or temperatures below 50°F."
    ],
    "sunlight": [
        "Prefers bright, indirect sunlight for several hours a day to thrive.",
        "Can tolerate low light conditions but may grow more slowly in them.",
        "Avoid exposing the leaves to direct sunlight as it can cause damage.",
        "Under artificial lights, using fluorescent or LED lights can be beneficial."
    ],
    "watering": [
        "Water the plant when the top 2 inches of soil feel dry to the touch.",
        "Overwatering can lead to root rot, so ensure proper drainage is provided.",
        "Reduce watering frequency during the winter months to prevent excess moisture.",
        "Using room-temperature, chlorine-free water is ideal for healthy growth."
    ],
    "soil": [
        "A well-draining soil mix containing peat and perlite works well for this plant.",
        "Avoid heavy soils that retain too much moisture and could suffocate the roots.",
        "Adding coconut coir can help retain necessary moisture without waterlogging.",
        "A balanced potting mix designed for houseplants will support robust growth."
    ],
    "toxic": [
        "Snow Queen Pothos is toxic to pets and humans if ingested in large quantities.",
        "Ingestion can cause oral irritation, vomiting, and difficulty swallowing."
    ],
    "extra_care_tip": [
        "Regularly wiping the leaves with a damp cloth improves appearance and health.",
        "Pinching back stems can encourage bushier growth and prevent legginess.",
        "Fertilize every 6-8 weeks with a balanced liquid fertilizer during active growth seasons.",
        "Repot once every couple of years or when the plant becomes root-bound."
    ]
}