{
    "name": "Snow-In-Summer",
    "climate": [
        "Snow-In-Summer prefers temperate and cool climates where summers are not excessively hot.",
        "This plant thrives well in climates that offer cool nights, helping it to perform optimal photosynthesis.",
        "Warm but not overly humid environments allow Snow-In-Summer to flourish without succumbing to mold.",
        "It can tolerate harsh climates to some extent but prefers moderate conditions to thrive."
    ],
    "sunlight": [
        "Snow-In-Summer flourishes in full sun, requiring at least six hours each day of bright sunlight.",
        "To maintain its lush silver foliage, this plant needs constant exposure to direct sunlight.",
        "Partial shade can be tolerated, but the plant performs best with abundant direct sunlight.",
        "Sunlight is crucial for blooming; inadequate light results in leggy growth and fewer blooms."
    ],
    "watering": [
        "Snow-In-Summer requires well-drained soil to prevent waterlogging, so water sparingly.",
        "The plant is drought-tolerant and needs less frequent watering once established.",
        "Overwatering can cause root rot; ensure the soil dries out between waterings.",
        "Adjust watering based on climate: more frequent in dry conditions, less in humid."
    ],
    "soil": [
        "The plant thrives in sandy or gritty soils with excellent drainage to prevent water retention.",
        "Soil should be moderately fertile; overly rich soil can encourage excessive leaf growth at the expense of flowers.",
        "For optimal growth, a soil pH range from neutral to slightly alkaline is preferred.",
        "Improving heavy clay soils with organic matter can enhance drainage and root health."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune regularly to prevent the plant from becoming woody and to encourage lush new growth.",
        "Snow-In-Summer can become invasive; regular maintenance helps manage its spread.",
        "After flowering, trim back hard to promote a second flush of blooms and compact growth.",
        "Rake up fallen leaves and debris to prevent disease and maintain a neat appearance."
    ]
}