{
    "name": "Spanish Lavender",
    "climate": [
        "Spanish Lavender thrives in Mediterranean climates which are typically mild and wet winters with hot, dry summers.",
        "This plant is well-suited to coastal climates where the temperatures are moderate, and it can tolerate salty conditions.",
        "It requires a climate with minimal frost as it cannot withstand prolonged freezing temperatures.",
        "Spanish Lavender can also adapt to semi-arid climates as long as there is enough drainage to prevent root rot."
    ],
    "sunlight": [
        "It requires full sunlight for optimal growth, needing at least six to eight hours of direct sunlight daily.",
        "Partial shade can be tolerated, but the plant may not bloom as profusely without sufficient sunlight exposure.",
        "Position the plant in the sunniest spot available to maximize the intensity of the blooms and plant vitality.",
        "Insufficient sunlight can lead to spindly growth and less vibrant flowers, so avoid overly shaded areas."
    ],
    "watering": [
        "Water Spanish Lavender infrequently but deeply, allowing the soil to dry out completely between waterings.",
        "Overwatering can lead to root rot, so it's essential to ensure good drainage and water sparingly.",
        "During peak growth periods in spring and summer, the frequency of watering can be slightly increased.",
        "Reduce watering in the winter months, especially in cooler climates to prevent moisture-related issues."
    ],
    "soil": [
        "Spanish Lavender prefers well-draining soil, such as sandy or rocky types, to thrive without root rot issues.",
        "Soil pH should be neutral to slightly alkaline; amend with lime if the soil is too acidic.",
        "Heavy clay soils should be amended with sand or grit to improve drainage and prevent water retention.",
        "It can tolerate poor soil conditions but flourishes in loamy, well-aerated soils for optimal health."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune Spanish Lavender after blooming to maintain its shape and encourage denser growth.",
        "Remove spent flowers to prolong the blooming season and enhance the plant's appearance."
    ]
}