{
    "name": "Spider Lily",
    "climate": [
        "The Spider Lily thrives in tropical and subtropical climates, enjoying high humidity levels.",
        "It prefers climates with warm temperatures, typically thriving in regions without frost.",
        "Temperatures above 60°F (15°C) are ideal for optimal growth and blooming.",
        "In cooler climates, it is often grown indoors to replicate its warm habitat."
    ],
    "sunlight": [
        "Spider Lilies prefer partial to full sun exposure for healthy growth and blooming.",
        "They can tolerate some shade but need at least six hours of sunlight per day.",
        "Too much direct sun in hot climates may lead to leaf scorching; some shade can help.",
        "In colder regions, placing them indoors near a southern window can provide sufficient light."
    ],
    "watering": [
        "Keep the soil consistently moist, especially during the growing and blooming periods.",
        "Avoid waterlogging, as excessive water can lead to root rot and other health issues.",
        "During dormancy in winter, water the plant less frequently but don't let soil dry out completely.",
        "If grown in containers, ensure good drainage to prevent standing water."
    ],
    "soil": [
        "Spider Lilies thrive in well-draining, organically rich soil with good aeration.",
        "A mix of loam and sand, enriched with compost, can provide necessary nutrition.",
        "The soil pH should ideally be neutral to slightly acidic for optimal growth.",
        "Avoid heavy clay soils as they can impede drainage and hinder root development."
    ],
    "toxic": [
        "Spider Lilies contain lycorine, which is toxic if ingested and can cause nausea or vomiting.",
        "Care should be taken to keep the plant away from pets and small children."
    ],
    "extra_care_tip": [
        "Removing spent flowers can help redirect energy back to the bulb for future blooms.",
        "In colder climates, mulch the bulbous planting area to protect from frost damage."
    ]
}