{
    "name": "Spiral Ginger",
    "climate": [
        "Spiral Ginger thrives in tropical climates where temperatures are warm year-round.",
        "This plant prefers humid conditions typical of rainforests and coastal regions.",
        "It can also grow in subtropical areas where there is no risk of frost.",
        "Avoid cold and overly dry environments as they can damage the plant."
    ],
    "sunlight": [
        "Spiral Ginger grows best in partial shade, protected from the scorching midday sun.",
        "It can tolerate some direct sunlight, especially in the morning or late afternoon.",
        "Full shade can be detrimental, causing the plant to be leggy and less vibrant.",
        "Ensure it gets dappled sunlight throughout the day for optimal health."
    ],
    "watering": [
        "Keep the soil consistently moist, but avoid waterlogging which can cause root rot.",
        "Water regularly, allowing the top inch of soil to dry out slightly between sessions.",
        "Increase watering frequency during hot, dry periods to maintain adequate moisture.",
        "Reduce watering in cooler months, allowing the plant to rest with less moisture."
    ],
    "soil": [
        "Use a well-draining soil that retains moisture but doesn't become waterlogged.",
        "Soil rich in organic matter is ideal, as it provides essential nutrients.",
        "A slightly acidic to neutral pH level is preferred for optimal growth.",
        "Ensure good aeration by incorporating perlite or coarse sand into the soil mix."
    ],
    "toxic": [
        "Spiral Ginger is mildly toxic to pets and humans if ingested in large quantities."
    ],
    "extra_care_tip": [
        "Protect Spiral Ginger from strong winds to prevent damage to the leaves.",
        "Fertilize during the growing season with a balanced, slow-release fertilizer.",
        "Remove faded flowers and dead leaves to encourage healthy growth and appearance.",
        "Consider dividing and repotting every few years to manage plant size and health."
    ]
}