{
    "name": "Squirting cucumber",
    "climate": [
        "Squirting cucumber thrives in hot, dry climates typical of its native Mediterranean region.",
        "Ideal temperatures for this plant are those found in warm temperate to subtropical areas.",
        "It can survive in regions that experience long periods of drought conditions.",
        "Most favorable in environments with minimal humidity and extensive sunlight."
    ],
    "sunlight": [
        "Squirting cucumber requires full sun exposure to grow and thrive optimally.",
        "It is best planted in a location where it can receive sunlight for the majority of the day.",
        "Partial shade may hinder its growth as it is adapted to full sunlight environments.",
        "Direct and intense sunlight is necessary for its proper development and fruiting."
    ],
    "watering": [
        "Watering should be infrequent due to the plant's drought-resistant nature.",
        "Over-watering can cause root rot; allow soil to dry between waterings.",
        "Water deeply but sparingly, mimicking naturally erratic Mediterranean rain.",
        "In rainfall-prone areas, additional watering might not be needed for this plant."
    ],
    "soil": [
        "Prefers well-draining soil, often sandy or rocky, to prevent waterlogging.",
        "The plant can tolerate poor soils, but must be well-drained for best growth.",
        "It thrives in soils with low fertility as excessive nutrients can impede growth.",
        "Soil should be able to lock minimal moisture while ensuring maximum drainage."
    ],
    "toxic": [
        "The plant's fruit and sap contain compounds that are toxic if ingested or handled.",
        "Handling the plant can cause skin irritation or more severe reactions if ingested.",
        "Toxic properties are considered dangerous to both humans and animals.",
        "Use caution when handling; protective gloves are recommended to avoid contact."
    ],
    "extra_care_tip": [
        "To control its spread and prevent unwanted propagation, remove any fruits promptly.",
        "Due to its invasive nature, monitor growth to manage its spread in garden settings."
    ]
}