{
    "name": "St. John's Wort",
    "climate": [
        "St. John's Wort thrives in temperate climates with seasonal variations.",
        "It can adapt to a Mediterranean climate with dry and wet seasons.",
        "This plant is suitable for climates with mild, wet winters and dry summers.",
        "Prefers regions where winters are not extremely harsh or frosty."
    ],
    "sunlight": [
        "St. John's Wort needs full sun for at least 6 to 8 hours daily.",
        "It can tolerate partial shade but performs best in direct sunlight.",
        "Provides abundant blooms when grown in sunny, open positions.",
        "Insufficient sunlight may lead to weak growth and fewer flowers."
    ],
    "watering": [
        "Prefers consistently moist soil, especially during the growing season.",
        "Requires less water in winter when its growth slows down significantly.",
        "Avoid overwatering as this can lead to root rot and plant demise.",
        "A deep watering every week or two is usually adequate in warmer months."
    ],
    "soil": [
        "Thrives in well-draining soil that can hold some moisture.",
        "Soil should be moderately fertile, with organic matter for best results.",
        "Prefers slightly acidic to neutral pH levels, generally 6.0 to 7.0.",
        "Avoid heavy clay or waterlogged soils as they hinder root development."
    ],
    "toxic": [
        "St. John's Wort can be toxic to animals such as livestock and pets.",
        "Ingestion may lead to photosensitivity, particularly in light-skinned animals.",
        "Contains hypericin, which can cause digestive issues and nervous disorders.",
        "Care should be taken to prevent animals from grazing on this plant."
    ],
    "extra_care_tip": [
        "Prune regularly to maintain shape and encourage bushy growth forms.",
        "Deadhead spent flowers to promote further blooming throughout the season.",
        "Watch out for signs of rust and treat promptly to prevent spread.",
        "Mulching around the base can help retain moisture and suppress weeds."
    ]
}