{
    "name": "Staghorn Fern",
    "climate": [
        "Staghorn ferns thrive in tropical and subtropical climates, where humidity is high.",
        "They are adapted to environments that have warm temperatures year-round.",
        "Avoid exposing them to cold climates, as they are not frost-tolerant.",
        "In their native habitats, they enjoy a consistently moist atmosphere."
    ],
    "sunlight": [
        "Staghorn ferns prefer bright, indirect sunlight for optimal growth.",
        "Direct sunlight can scorch the fronds, so it should be avoided.",
        "They can tolerate some shade, but too little light may stunt growth.",
        "Ideal locations mimic their natural understory forest lighting."
    ],
    "watering": [
        "Staghorn ferns need regular watering, allowing the roots to dry slightly in between.",
        "They appreciate humidity, so misting or a humid environment is beneficial.",
        "Over-watering can lead to root rot, so ensure good drainage.",
        "Water more frequently during warmer periods; less so in cooler seasons."
    ],
    "soil": [
        "These epiphytes prefer a loose, well-draining medium like orchid bark.",
        "Avoid traditional potting soil as it retains too much moisture.",
        "A mixture of sphagnum moss and bark mimics its natural habitat.",
        "Air circulation around the roots is crucial for their health."
    ],
    "toxic": [
        "There is no substantial evidence that Staghorn ferns are toxic to pets.",
        "Generally considered non-toxic, but ingestion is not recommended.",
        "Non-toxic does not mean edible, so keep out of reach of pets and children.",
        "If ingested in large amounts, seek veterinary advice as a precaution."
    ],
    "extra_care_tip": [
        "Mounting them on wood or hanging baskets simulates their natural growth.",
        "Regularly check for pests like scale insects and treat promptly.",
        "Remove dead fronds to encourage healthy new growth.",
        "Fertilize during the growing season with a balanced, water-soluble fertilizer."
    ]
}