{
    "name": "Stella",
    "climate": [
        "The Stella plant thrives in tropical climates where the temperatures are consistently warm and humid.",
        "It is best suited for subtropical regions, benefiting from high humidity and frequent rainfall throughout the year.",
        "This plant can also adapt to temperate climates where temperatures do not drop too low during winter months.",
        "Stella is not frost-tolerant and should be protected or brought indoors in cooler climates with freezing temperatures."
    ],
    "sunlight": [
        "Stella plants require bright, indirect sunlight to flourish without experiencing leaf burn.",
        "Direct sunlight during the hottest part of the day should be avoided as it can damage the leaves of the plant.",
        "In low-light conditions, the plant may survive but will exhibit slower growth and less vibrant foliage.",
        "Best growth is achieved when the plant is placed near eastern or northern windows for soft, morning or diffused light."
    ],
    "watering": [
        "Water Stella regularly, ensuring that the soil remains consistently moist but not waterlogged.",
        "The plant prefers higher humidity levels, so misting the leaves occasionally may be beneficial.",
        "Overwatering should be avoided as it can lead to root rot; allow the top inch of soil to dry out between waterings.",
        "During the winter months, the frequency of watering should be reduced as the plant enters a period of slower growth."
    ],
    "soil": [
        "Stella thrives in well-draining, rich organic soil that retains moisture while allowing excess water to escape.",
        "A mixture of potting soil, coconut coir, and perlite can provide the ideal balance for roots' aeration and water retention.",
        "Ensure the soil has a slightly acidic to neutral pH, which is favorable for the plant's nutrient absorption.",
        "Compost can be added periodically to enrich the soil with nutrients and improve its structure and water-holding capacity."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regular pruning is needed to maintain the shape and promote bushier growth, cutting back overgrown stems.",
        "Watch for pests like aphids or spider mites; treating infestations early with insecticidal soap is advisable."
    ]
}