{
    "name": "Stinging Nettle",
    "climate": [
        "Stinging Nettle thrives in temperate regions with mild climates, avoid extreme hot areas.",
        "It prefers a climate with high humidity and regular rainfall throughout the year.",
        "This plant can also grow in sub-polar climates provided the soil conditions are right.",
        "Adaptable to various climates but really flourishes in areas with cool temperatures."
    ],
    "sunlight": [
        "Stinging Nettle prefers partial shade as excessive sunlight can cause leaf damage.",
        "It can tolerate full sun, but ideal growth occurs in dappled shade conditions.",
        "Avoid planting in full shade as it requires some sunlight to photosynthesize effectively.",
        "Grows well under forest canopies where sunlight is filtered, mimicking natural habitat."
    ],
    "watering": [
        "Requires consistent moisture levels; do not allow the soil to dry out completely.",
        "Water regularly, especially during dry spells to maintain optimal growth conditions.",
        "While it likes moisture, ensure the ground does not remain waterlogged or soggy.",
        "In areas with adequate rainfall, minimal additional watering may be necessary."
    ],
    "soil": [
        "Thrives in nutrient-rich, well-drained soils that retain moisture effectively.",
        "Prefers loamy soils enriched with organic matter to boost fertility and drainage.",
        "Can adapt to various soil types but avoids overly sandy or rocky soils for the best growth.",
        "pH levels are not crucial; however, slightly acidic to neutral soils are preferred."
    ],
    "toxic": [
        "Stinging Nettle has tiny, hair-like structures that can sting and irritate skin on contact.",
        "Upon touching, the plant injects histamine and other chemicals causing itching and rash.",
        "Handling the plant with gloves and protective clothing is advisable to prevent irritation."
    ],
    "extra_care_tip": [
        "If stung, soothing the affected area with calamine lotion or antihistamines can relieve irritation.",
        "Regular pruning can help control its spread as it tends to grow invasively in some areas.",
        "Supports biodiversity by providing habitat and food for various wildlife species like butterflies."
    ]
}