{
    "name": "Strawberry Vanilla Hydrangea",
    "climate": [
        "Thrives in temperate climates with mild winters and cool summers; coastal areas are often ideal for this plant.",
        "Prefers regions where there is moderate rainfall distributed throughout the year, helping with consistent hydration.",
        "Avoids extreme heat, as it can cause the plant to wilt and require more frequent watering to thrive.",
        "Not suited for arid, desert climates as these conditions can lead to drying out and poor flower production."
    ],
    "sunlight": [
        "Best nurtured in full sun to partial shade environments, allowing it to bloom fully and develop rich colors.",
        "Avoid areas with extremely intense midday sun, which can scorch the foliage and cause stress to the plant.",
        "Thrives with morning sun exposure, as this will enhance flowering and provide the plant with ample energy.",
        "In deeply shaded areas, the plant may become leggy and produce fewer blooms due to insufficient sunlight."
    ],
    "watering": [
        "Requires regular watering, especially during dry spells, to ensure that the soil remains consistently moist.",
        "Must be watered at the base to prevent leaf spot disease caused by water sitting on the foliage for extended periods.",
        "Needs extra hydration during flowering to maintain the health and vitality of blooms, particularly in hotter weather.",
        "Inconsistent watering can lead to stress, which may manifest as browning leaf edges and reduced flowering."
    ],
    "soil": [
        "Requires well-draining, loamy soil rich in organic matter to support healthy root development and hydration.",
        "Incorporate compost or well-rotted manure into the soil to enhance fertility and provide necessary nutrients.",
        "Prefers slightly acidic to neutral pH levels, which help the plant absorb essential nutrients effectively.",
        "Avoid compacted or heavy clay soils, as these can hinder drainage and lead to root rot in the plant."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune annually after flowering to encourage healthy growth and abundant blooms for the following season."
    ]
}