{
    "name": "Strawberry",
    "climate": [
        "Strawberries thrive in temperate climates that provide warm days and cool nights.",
        "They require a climate with well-defined seasons, including a cold season to break dormancy.",
        "Strawberries can tolerate mild frost but require protection from extreme cold conditions.",
        "Regions with mild temperatures and moderate humidity levels are ideal for strawberry cultivation."
    ],
    "sunlight": [
        "Strawberries need full sunlight for at least six to eight hours a day to produce fruit.",
        "Inadequate sunlight can lead to weak plants and reduced fruit yield and quality.",
        "Direct sunlight is essential for strawberries to develop flavor and sweetness.",
        "Plant strawberries in a location where they won't be shaded by buildings or trees."
    ],
    "watering": [
        "Strawberries require consistent watering to keep the soil evenly moist but not waterlogged.",
        "Watering should be frequent enough to prevent the soil from completely drying out.",
        "During fruiting, strawberries may need more water to support fruit development.",
        "Drip irrigation is recommended to avoid wetting the foliage, which can lead to disease."
    ],
    "soil": [
        "Strawberries grow best in well-drained sandy or loamy soil with good organic content.",
        "The soil should be slightly acidic to neutral, with a pH range of 5.5 to 7.0.",
        "Prepare the soil by incorporating compost or aged manure for added nutrients.",
        "Avoid compacted soil to ensure roots have enough air and space for healthy growth."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Mulching around strawberry plants helps retain soil moisture and reduces weeds.",
        "Regular removal of runners can help concentrate plant energy on fruit production.",
        "Ensure adequate air circulation around plants to prevent fungal diseases.",
        "Rotate strawberry crops every few years to prevent soil-borne diseases."
    ]
}