{
    "name": "String Of Hearts",
    "climate": [
        "String of Hearts thrives in warm climates and should be kept indoors in cooler regions.",
        "This plant is native to Southern Africa, where it enjoys a subtropical climate.",
        "It prefers temperatures that range between 65°F to 85°F throughout the growing season.",
        "To protect it from extreme cold, avoid temperatures below 60°F at all times."
    ],
    "sunlight": [
        "String of Hearts needs bright, indirect sunlight for optimal growth and health.",
        "Direct sunlight can scorch its leaves, so filtered light is best.",
        "When kept indoors, a south or west-facing window with plenty of light is ideal.",
        "If outdoor, shield it from harsh midday sun to prevent leaf damage or burnout."
    ],
    "watering": [
        "Water the String of Hearts deeply but allow the soil to dry out between waterings.",
        "Overwatering can lead to root rot, so ensure the plant is not left in waterlogged soil.",
        "During the growing season, water more frequently, roughly once a week.",
        "In winter, reduce watering significantly as the plant enters dormancy and needs less moisture."
    ],
    "soil": [
        "The plant thrives best in a well-draining cactus or succulent soil mix.",
        "A mix that includes perlite or sand will enhance drainage and prevent root rot.",
        "Heavy or water-retentive soils should be avoided to protect the roots.",
        "Ensure the pot has good drainage holes to allow excess water to escape easily."
    ],
    "toxic": [
        "String of Hearts is generally considered non-toxic to pets and humans.",
        "Caution is advised as ingestion can cause slight gastrointestinal discomfort.",
        "While not highly toxic, it’s best to keep it out of reach from pets and children.",
        "Always consult with a vet if your pet ingests any part of the plant."
    ],
    "extra_care_tip": [
        "The string of Hearts benefits from pruning to encourage bushier growth.",
        "Support its vines with a trellis or let them drape over the edges of the pot.",
        "Regularly clean the leaves to remove dust which can hinder photosynthesis.",
        "Propagation is straightforward through cuttings; place in water until roots develop."
    ]
}