{
    "name": "Swamp Milkweed",
    "climate": [
        "Swamp Milkweed thrives in temperate climates where the winters are cold, which helps in seed germination.",
        "This plant is well suited for USDA hardiness zones 3 to 9, handling both cold and heat quite well.",
        "It prefers climates with high humidity levels, resembling wetland regions and areas near bodies of water.",
        "Swamp Milkweed requires a climate with distinct seasons, including a cold winter and a warm growing season."
    ],
    "sunlight": [
        "Swamp Milkweed requires full sun exposure for optimal growth, meaning it should receive at least six hours of direct sunlight per day.",
        "It can tolerate partial shade but will perform poorly with less than four hours of direct sunlight daily.",
        "This plant should be placed in an area where it is not overshadowed by trees or structures to ensure sufficient sunlight.",
        "In regions with extremely hot climates, some afternoon shade can protect it from excessive heat stress."
    ],
    "watering": [
        "Swamp Milkweed prefers consistently moist soil and thrives in areas with regular rainfall or supplemental irrigation.",
        "It can tolerate short periods of drought but should not be left dry for extended durations to avoid stress.",
        "Regular deep watering is essential, especially if planted in non-wetland areas, to mimic its natural habitat.",
        "Ensure good drainage to prevent root rot, but maintain adequate soil moisture throughout its growing season."
    ],
    "soil": [
        "Swamp Milkweed grows best in soil rich in organic matter, which provides essential nutrients and retains moisture.",
        "It prefers soil types such as loamy or clay soils that mimic wetland conditions while allowing root aeration.",
        "Although it is called swamp milkweed, it does not require a swamp; it will thrive in any wet or constantly moist soil.",
        "Amend garden soil with compost for improved fertility and moisture retention, ensuring conditions are optimal."
    ],
    "toxic": [
        "Swamp Milkweed can be toxic if ingested by humans and pets, causing symptoms like nausea and vomiting.",
        "The plant contains cardiac glycosides, which can be harmful if consumed in large quantities, affecting heart function."
    ],
    "extra_care_tip": [
        "Swamp Milkweed is a highly attractive plant to caterpillars of the Monarch butterfly, playing a vital role in their lifecycle."
    ]
}