{
    "name": "Sweetbay Magnolia",
    "climate": [
        "The Sweetbay Magnolia thrives in warm, humid climates where temperatures are moderate.",
        "It is native to the southeastern United States, and grows well in USDA zones 5 through 9.",
        "This plant can withstand short periods of cold, but extreme cold can damage it.",
        "It performs best in areas that mimic its native swampy and moist habitats."
    ],
    "sunlight": [
        "Sweetbay Magnolias prefer full sun to partial shade for optimal growth.",
        "In hot climates, providing some afternoon shade can protect the foliage from scorching.",
        "However, deep shade may inhibit flowering and cause leggy growth in the plant.",
        "Morning sunlight is particularly beneficial, aiding in floral development and health."
    ],
    "watering": [
        "The Sweetbay Magnolia requires consistently moist soil to flourish, especially in dry climates.",
        "It is important to maintain moisture, particularly during dry periods of the growing season.",
        "Standing water should be avoided, as it can lead to root rot in Sweetbay Magnolias.",
        "Mulching around the base can help retain soil moisture and prevent weeds."
    ],
    "soil": [
        "This magnolia thrives in acidic to slightly acidic soil with good drainage properties.",
        "Rich, humus-laden soils with a high organic matter content support healthy growth.",
        "Compacted or heavy clay soil should be amended to enhance aeration and drainage.",
        "Raised beds or mounds can be utilized in poorly draining areas to assist in growth."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune after flowering to shape the tree and remove any dead or damaged wood.",
        "Applying a balanced, slow-release fertilizer in early spring boosts vitality.",
        "Watch for pests like scale and treat with horticultural oil if necessary.",
        "Ensure root flare is visible above ground to avoid common root & trunk problems."
    ]
}