{
    "name": "Sweet Pea Shrub",
    "climate": ["Sweet Pea Shrubs thrive best in a Mediterranean climate, characterized by mild, wet winters and hot, dry summers.", "They can be grown in USDA hardiness zones 8-10, where temperatures don't often drop below freezing.", "In cooler climates, Sweet Pea Shrubs can be grown in containers and moved indoors during winter.", "Avoid regions with extremely cold winters as the plant is not frost-tolerant and can suffer damage."],
    "sunlight": ["Sweet Pea Shrubs require full sunlight to partial shade for optimal growth and flowering.", "When grown in full sun, the Sweet Pea Shrub produces more vibrant and abundant blooms.", "Partial shade can be accommodated, but it may lead to reduced flowering intensity.", "Ensure the plant receives at least 6 hours of direct sunlight per day for healthy development."],
    "watering": ["Sweet Pea Shrubs require regular watering, particularly during dry spells, to keep the soil consistently moist.", "It's important to avoid overwatering as the plant does not like soggy conditions, which can lead to root rot.", "During the growing season, ensure that the soil does not completely dry out between waterings.", "In winter, reduce watering frequency to prevent over-saturation of the soil, which can harm the plant."],
    "soil": ["Well-drained soil is essential for the health of the Sweet Pea Shrub, preventing waterlogged roots.", "A sandy loam or slightly acidic soil enriched with organic matter is ideal for its growth.", "The plant prefers a balanced soil pH but can tolerate slightly acidic conditions around 6.0 to 6.5.", "In densely compacted soils, improve drainage with organic amendments before planting."],
    "toxic": [],
    "extra_care_tip": ["Pruning in late winter or early spring helps to maintain the shape and encourage bushy growth.", "Mulching around the base assists in retaining moisture and suppressing weeds.", "Protect the shrub from strong winds, which can cause damage to its branches and growth.", "Regular deadheading of spent flowers encourages continuous blooming and vibrant displays."]
}