{
    "name": "Sweet Potato Vine",
    "climate": [
        "Sweet potato vines thrive in warm climates with temperatures above 70°F.",
        "These plants prefer a tropical or subtropical climate for optimal growth.",
        "In cooler areas, they should be grown as annuals or brought indoors in winter.",
        "High humidity levels are also beneficial for the health of sweet potato vine."
    ],
    "sunlight": [
        "Sweet potato vines need full sun exposure for at least six hours a day.",
        "They can tolerate partial shade but may not produce vibrant foliage.",
        "If grown indoors, place them near a south-facing window for the best results.",
        "Direct sunlight helps to promote healthy growth and leaf development."
    ],
    "watering": [
        "Consistent watering is essential for sweet potato vines to thrive well.",
        "They prefer moist but well-draining soil to prevent root rot and issues.",
        "During hot weather, increase the watering frequency to keep them hydrated.",
        "Allow the top inch of soil to dry out slightly between waterings for balance."
    ],
    "soil": [
        "Sweet potato vines grow best in well-draining, nutrient-rich soil.",
        "A sandy loam texture is preferred to avoid waterlogging and root issues.",
        "They can benefit from soil that is slightly acidic to neutral in pH balance.",
        "Adding organic matter or compost can enhance soil fertility and structure."
    ],
    "toxic": [
        "Sweet potato vine contains toxic compounds that are harmful if ingested.",
        "Both the leaves and tubers can be toxic to pets such as dogs and cats.",
        "Pets may experience vomiting, diarrhea, or other symptoms after ingestion.",
        "It is important to keep these plants out of reach of curious animals."
    ],
    "extra_care_tip": [
        "Pruning regularly can help control the shape and spread of the vines.",
        "Pinch off the tips to encourage bushier growth and fuller appearance.",
        "Fertilize monthly during the growing season with a balanced fertilizer.",
        "Overwinter indoors if grown in cooler climates to protect from frost."
    ]
}