{
    "name": "Texas Mountain Laurel",
    "climate": [
        "The Texas Mountain Laurel thrives in hot, arid regions with low humidity and infrequent rainfall.",
        "It prefers environments that mimic its native habitat, which includes dry and warm conditions.",
        "The plant is tolerant of drought once established, making it ideal for desert-like climate areas.",
        "It should be in a location that receives a substantial amount of sunlight and little temperature variation."
    ],
    "sunlight": [
        "Texas Mountain Laurel requires full sun for the best growth and flowering potential.",
        "Ensure at least six to eight hours of direct sunlight each day for optimal health.",
        "If grown in shaded areas, the plant may become leggy and produce fewer flowers.",
        "It is highly adaptable but shines brightest in areas with unobstructed sunlight."
    ],
    "watering": [
        "Newly planted Texas Mountain Laurels need consistent watering until established.",
        "Once mature, the plant is drought-tolerant and can survive on minimal water.",
        "Water deeply but infrequently, ensuring the soil dries out between watering sessions.",
        "Avoid over-watering as they prefer well-drained soil and can suffer from root rot."
    ],
    "soil": [
        "Prefers well-drained alkaline to neutral soils, avoiding heavy clay or poorly draining soil.",
        "For optimal growth, sandy soils that allow proper drainage are ideal for this species.",
        "Amend the planting site with organic matter to improve drainage and nutrient availability.",
        "While adaptable to different soils, avoid areas where water tends to accumulate post-rain."
    ],
    "toxic": [
        "Texas Mountain Laurel is considered toxic if ingested by humans or animals.",
        "The seeds are particularly toxic due to the presence of alkaloids and should not be eaten."
    ],
    "extra_care_tip": [
        "Prune lightly after flowering to maintain the desired shape but avoid heavy pruning.",
        "Protect young plants from severe cold using coverings if unexpected frost occurs.",
        "Watch for signs of pests such as caterpillars and apply insecticidal soap if needed.",
        "Regular mulching can help retain soil moisture and suppress weed growth around the base."
    ]
}