{
    "name": "Thai Basil",
    "climate": [
        "Thai Basil thrives in a warm, tropical climate with plenty of humidity and consistently warm temperatures.",
        "It is not frost-tolerant and prefers a climate where temperatures do not drop below 50째F (10째C).",
        "For optimal growth, a climate with high humidity and temperatures between 70째F and 95째F is preferred.",
        "It can also adapt to a subtropical climate but should be protected from cold drafts and severe weather."
    ],
    "sunlight": [
        "Thai Basil requires full sun exposure for optimal growth, ideally 6 to 8 hours of direct sunlight daily.",
        "If full sun is not available, make sure it receives at least strong partial sunlight during daylight hours.",
        "A sunny windowsill or a spot in the garden that captures full sun is perfect for this plant.",
        "In exceedingly hot climates, some afternoon shade can prevent the leaves from scorching."
    ],
    "watering": [
        "Thai Basil prefers consistently moist soil, achieved by regular watering but ensuring good drainage.",
        "Do not allow the soil to dry out completely between watering to prevent stress on the plant.",
        "Over-watering should be avoided as it can lead to root rot; soil should be damp but not soggy.",
        "Watering frequency may vary with climate; increase watering in hot weather and reduce in cooler months."
    ],
    "soil": [
        "Thai Basil grows well in rich, fertile soil with good organic matter and proper drainage.",
        "A well-draining potting mix or garden soil augmented with compost is ideal for its cultivation.",
        "The soil pH should be neutral to slightly alkaline, around 6.0 to 7.5 for the best results.",
        "Avoid heavy clay soils that retain water, opting for a more loamy soil blend instead."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Regularly harvest leaves to encourage bushier growth while pinching off flower buds to extend leaf production.",
        "If growing indoors, an occasional misting can help provide the needed humidity Thai Basil enjoys.",
        "Ensure the plant is protected from strong winds, which can damage its tender stems and leaves.",
        "Rotate the plant occasionally to ensure even growth and prevent it from leaning towards the light source."
    ]
}