{
    "name": "Thanksgiving Cactus",
    "climate": [
        "Thanksgiving Cactus prefers a cool to moderate climate, thriving best in temperatures between 60°F and 70°F during the day.",
        "During the night, optimal temperatures are slightly cooler, typically ranging from 50°F to 60°F to encourage blooming.",
        "This plant is not frost tolerant; it should be brought indoors if temperatures drop below 50°F.",
        "A high-humidity environment aids in healthy growth, with levels ideally around 50% or higher."
    ],
    "sunlight": [
        "Thanksgiving Cactus thrives in bright, indirect sunlight for best blooms and healthy foliage.",
        "Direct sunlight should be avoided as it can scorch the leaves; filtered sunlight is ideal.",
        "During the short days of autumn, natural light conditions help trigger blooming.",
        "If indoors, placing the cactus near a north or east-facing window will provide suitable lighting conditions."
    ],
    "watering": [
        "Water the Thanksgiving Cactus thoroughly but infrequently, allowing the top inch of soil to dry out between waterings.",
        "Overwatering can lead to root rot, so ensure pots have proper drainage and avoid letting plants sit in water.",
        "During the active growing period, keep the soil consistently moist but not soggy.",
        "In the dormant phase after blooming, water sparingly, only enough to prevent the soil from completely drying out."
    ],
    "soil": [
        "Thanksgiving Cactus prefers a well-aerated, fast-draining potting mix to prevent waterlogged conditions.",
        "A suitable mix is two parts peat moss or organic matter and one part perlite or sand for enhanced drainage.",
        "The soil pH should be slightly acidic to neutral, ranging from 5.5 to 6.5 for optimal growth.",
        "Repotting is typically needed every 1-2 years to refresh the soil and accommodate root growth."
    ],
    "toxic": [],
    "extra_care_tip": [
        "To encourage blooms, ensure at least 12-14 hours of darkness per day for about six weeks before flowering.",
        "Fertilize monthly with a balanced, water-soluble fertilizer during the growing season from spring to early fall.",
        "Pinching back stems after blooming can promote bushier growth and more flowers in the following season.",
        "Beware of sudden temperature changes and drafts, as these can lead to bud drop or inhibit flowering."
    ]
}