{
    "name": "Tree Philodendron",
    "climate": ["The Tree Philodendron thrives in tropical and subtropical climates where humidity is high.", "It can be grown outdoors in warm, frost-free climates with consistent rainfall.", "This plant thrives in temperatures between 65°F to 80°F and cannot tolerate cold weather.", "It is sensitive to dramatic temperature fluctuations and prefers stable conditions."],
    "sunlight": ["Tree Philodendron prefers bright, indirect sunlight for optimal growth.", "Direct sunlight can cause the leaves to scorch or lose their vibrant color.", "While it can tolerate lower light conditions, growth may be slower.", "Consistent medium light enhances its large, lush leaf production."],
    "watering": ["Water the Tree Philodendron regularly, allowing the soil to dry slightly between waterings.", "Overwatering can lead to root rot, so it's important to ensure proper drainage.", "In winter, reduce watering frequency as the plant's growth slows down.", "To maintain humidity, mist its leaves occasionally, especially in dry climates."],
    "soil": ["The Tree Philodendron flourishes in well-draining, fertile soil enriched with organic matter.", "A peat-based potting mix with added perlite ensures good aeration and drainage.", "It is beneficial to repot in fresh soil every two years to support growth.", "Avoid compacted soils that retain too much moisture, leading to root issues."],
    "toxic": ["Tree Philodendron contains calcium oxalate crystals, which are toxic if ingested.", "Symptoms of poisoning include oral irritation, swelling, and difficulty swallowing.", "Pets such as cats and dogs are at risk if they chew on the plant's leaves.", "Always keep the plant out of reach of children and animals to prevent accidents."],
    "extra_care_tip": ["Prune the Tree Philodendron regularly to maintain its shape and remove dead leaves.", "Rotate the plant periodically to ensure even growth and light exposure on all sides.", "Support its large stems with stakes to prevent them from falling under their own weight.", "Wipe its leaves with a damp cloth to remove dust and improve photosynthesis."]
}