{
    "name": "Tree Peony",
    "climate": [
        "Tree peonies thrive in temperate climates with mild summers and winters.",
        "They require a period of cold dormancy, making them suitable for hardiness zones 4 to 9.",
        "Avoid extremely hot and humid climates, as they can stress the plants.",
        "Protection from harsh winter elements is beneficial in cooler climates."
    ],
    "sunlight": [
        "Tree peonies prefer full sun to partial shade, ideally six hours of sunlight.",
        "Morning sun with afternoon shade is optimal to prevent flower wilt.",
        "Too much direct midday sun can be detrimental to tree peony blooms.",
        "They can tolerate some shade, but flower production might be reduced."
    ],
    "watering": [
        "Water tree peonies deeply, ensuring water reaches the roots without waterlogging.",
        "In dry seasons, provide consistent moisture; do not let the soil completely dry out.",
        "Ensure good drainage to prevent root rot, especially during wet seasons.",
        "Mulching can help retain moisture and regulate soil temperature effectively."
    ],
    "soil": [
        "Tree peonies prefer well-drained, loamy soil enriched with organic matter.",
        "Soil with a neutral to slightly acidic pH, around 6.5 to 7.0, is ideal for growth.",
        "Heavy clay soils should be amended to improve drainage and root development.",
        "Regularly add organic compost to maintain soil fertility and structure."
    ],
    "toxic": [
        "Tree peonies can be mildly toxic if ingested, potentially causing discomfort.",
        "The seeds and roots contain toxins which may cause digestive issues if eaten."
    ],
    "extra_care_tip": [
        "Prune dead wood and spent flowers after blooming to encourage new growth.",
        "Protect from strong winds and stake young plants to prevent breakage.",
        "Avoid transplanting frequently; tree peonies establish roots slowly.",
        "Fertilize in early spring with a balanced, slow-release fertilizer for best results."
    ]
}