{
    "name": "Vanilla",
    "climate": [
        "Vanilla prefers a tropical climate with high humidity levels and warm temperatures.",
        "Ideal temperatures for growing vanilla range between 20°C to 30°C throughout the year.",
        "Rainfall should be evenly distributed, and the plant thrives with about 2000 mm annually.",
        "Avoid climates with strong winds or frost, which can be detrimental to vanilla plants."
    ],
    "sunlight": [
        "Vanilla requires partial to full shade as direct sunlight can scorch the plants.",
        "Dappled sunlight, like that under a forest canopy, is ideal for vanilla growth.",
        "Too much direct sunlight can cause leaves to turn yellow or brown and reduce yield.",
        "Using shade nets or growing under taller plants can help regulate sunlight exposure."
    ],
    "watering": [
        "Vanilla needs consistent moisture but should not be overwatered as it can lead to root rot.",
        "Watering should mimic tropical rainfall patterns - regular but not excessive.",
        "During dry periods, make sure to increase the watering frequency to maintain soil moisture.",
        "Always ensure good drainage to prevent waterlogging, which can harm the plant’s roots."
    ],
    "soil": [
        "Vanilla benefits from rich, well-draining soil with plenty of organic matter.",
        "Slightly acidic to neutral pH levels ranging from 6 to 7 are preferred for optimal growth.",
        "Loamy soil mixed with compost or well-rotted manure can help retain moisture and nutrients.",
        "A supportive trellis or structure in the soil is necessary for the vanilla vine to climb."
    ],
    "toxic": [
        "Vanilla is non-toxic to humans and most pets when used in appropriate amounts.",
        "However, some pets might have allergies to vanilla; monitor if ingested in large amounts."
    ],
    "extra_care_tip": [
        "Hand pollination may be required for vanilla plants to develop pods when grown outside natural habitats.",
        "Providing a small amount of fertilizer during the growing season can enhance growth and yield.",
        "Pruning is necessary to keep the vine healthy and encourage more flowers and pods.",
        "Regularly inspect plants for pests and diseases, treating them early to prevent spread."
    ]
}