{
    "name": "Variegated Fiddle Leaf Fig",
    "climate": [
        "Prefers a warm and humid environment similar to its native rainforests.",
        "Does not tolerate extremely cold temperatures; keep above 60°F (15°C).",
        "Thrives in conditions where the relative humidity is above 50%.",
        "Avoid placing it in drafty areas or near heating vents."
    ],
    "sunlight": [
        "Requires bright, indirect light to maintain variegation and growth.",
        "Protect from harsh, direct midday sun which can scorch the leaves.",
        "Can tolerate some direct morning sunlight but not intense afternoon sun.",
        "If the leaves start to lose variegation, it might need more light."
    ],
    "watering": [
        "Water when the top inch of soil feels dry; avoid waterlogging the roots.",
        "Use room temperature water and ensure consistent watering schedules.",
        "Dry air can lead to brown edges; increase humidity if necessary.",
        "Overwatering can cause root rot; ensure proper drainage in the pot."
    ],
    "soil": [
        "Prefers a well-draining potting mix that retains some moisture.",
        "Consider a mix of peat, pine bark, and coarse sand for aeration.",
        "Ensure the pot has drainage holes to prevent water accumulation.",
        "Avoid heavy clay soils that can trap water and suffocate roots."
    ],
    "toxic": [
        "The plant is toxic to pets, including cats and dogs.",
        "Symptoms of ingestion can include oral irritation and vomiting.",
        "Keep away from curious pets and small children to avoid ingestion.",
        "Wash hands after handling as the sap can cause skin irritation."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves to remove dust and allow efficient photosynthesis.",
        "Rotate the plant occasionally to ensure even growth and light exposure.",
        "Fertilize during the growing season to maintain vibrant foliage.",
        "Repot every couple of years to refresh soil and provide room for growth."
    ]
}