{
    "name": "Vitex",
    "climate": [
        "Vitex thrives best in subtropical and tropical climates, where temperatures remain warm year-round.",
        "This plant can also adapt to temperate regions that experience mild winters and warm summers.",
        "It is intolerant to extremely cold conditions and should be protected from frost during winter months.",
        "Vitex can also be grown in Mediterranean climates characterized by wet winters and dry summers."
    ],
    "sunlight": [
        "Vitex prefers full sun exposure for optimum growth and will produce the most flowers under these conditions.",
        "It is adaptable to partial shade conditions; however, flowering may be reduced in lower light levels.",
        "When planted in full sun, ensure that the plant is slowly acclimated to prevent leaf scorch.",
        "Consistent, bright sunlight helps maintain its compact shape and healthy foliage throughout the year."
    ],
    "watering": [
        "Water Vitex regularly during the first growing season to establish a deep, extensive root system.",
        "Once established, it is drought-tolerant, requiring minimal additional watering in most climates.",
        "Over-watering or poorly draining soil can lead to root rot, so proper drainage is essential.",
        "During hot, dry periods, extra water may be needed to support healthy foliage and flower production."
    ],
    "soil": [
        "Vitex prefers well-drained soil that can include loam, sand, or gravel and is slightly alkaline.",
        "It can tolerate a range of soil types, including poor, rocky soils, making it versatile in gardens.",
        "For best results, ensure the soil contains organic matter, improving moisture retention and nutrients.",
        "Avoid heavy clay soils which can retain water and increase the risk of root rot in Vitex plants."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Prune Vitex in late winter or early spring to maintain a compact shape and encourage new growth.",
        "Remove any dead or crossing branches to improve airflow within the plant, reducing disease risk."
    ]
}