{
    "name": "Wasabi",
    "climate": [
        "Wasabi grows best in cool, temperate climates with high humidity conditions.",
        "Fluctuating temperatures can be detrimental to wasabi plants' health and productivity.",
        "Ideal temperatures for growing wasabi range from 8°C to 20°C throughout the year.",
        "Plants are sensitive to extreme cold and excessive heat, which can stunt growth and reduce yield."
    ],
    "sunlight": [
        "Wasabi requires partial to full shade as direct sunlight can damage the plant.",
        "Filtered sunlight or dappled shade is ideal to prevent leaves from burning.",
        "Too much sun exposure can lead to stress in the wasabi plants and slow their growth.",
        "Natural shade under trees or artificial shade with cloth can help in optimizing sunlight."
    ],
    "watering": [
        "Consistent and abundant watering is crucial as wasabi loves moist environments.",
        "It is important to provide ample water, avoiding dryness at all costs for optimal growth.",
        "Using running water systems, similar to stream beds, can replicate natural conditions.",
        "Water stagnation must be avoided to prevent root rot and maintain plant vitality."
    ],
    "soil": [
        "Wasabi thrives in rich, organic soil that is well-draining to mimic its natural habitat.",
        "The soil should retain moisture while being loose enough to allow for root expansion.",
        "High organic content, such as compost or leaf mold, enriches soil fertility and structure.",
        "A slightly acidic to neutral pH level is required, ranging from 6.0 to 7.0 for best results."
    ],
    "toxic": [
        "While the rhizome of wasabi is not toxic, ingestion of the leaves in large quantities can cause digestive discomfort.",
        "Wasabi plants are generally safe but may cause allergic reactions in sensitive individuals."
    ],
    "extra_care_tip": [
        "Wasabi requires a humid environment, so misting can help maintain humidity.",
        "Controlling pests naturally is essential as wasabi is sensitive to chemical insecticides."
    ]
}