{
    "name": "Watermelon Peperomia",
    "climate": [
        "Watermelon Peperomia thrives in a warm climate with temperatures preferably between 65°F and 80°F.",
        "It is best suited to an indoor environment where it can be shielded from extreme temperatures and drafts.",
        "Humidity levels should be moderate to high, mimicking its native tropical and subtropical habitats.",
        "Avoid placing the plant in cold, drafty areas or environments where temperatures drop below 50°F."
    ],
    "sunlight": [
        "Watermelon Peperomia prefers bright, indirect light to maintain its vibrant leaf patterns.",
        "While it can tolerate low light, this may lead to slower growth or elongated stems.",
        "Direct sunlight can scorch the leaves, so it should be avoided, especially during peak hours.",
        "An east or north-facing window is ideal to ensure sufficient natural light without direct sun exposure."
    ],
    "watering": [
        "Watermelon Peperomia prefers to be kept lightly moist but never soggy or waterlogged.",
        "Allow the top inch of the soil to dry out between watering to prevent root rot.",
        "In winter, watering frequency should be reduced as the plant's growth slows down.",
        "Always water with room temperature water, and avoid letting the plant sit in standing water."
    ],
    "soil": [
        "Use a well-draining potting mix rich in organic matter to support healthy root growth.",
        "A mix including peat, perlite, or sand is ideal to ensure proper aeration and drainage.",
        "Soil should be light and fluffy, as compact or dense soil can lead to root rot issues.",
        "Repot every couple of years to refresh the soil and provide necessary nutrients to the plant."
    ],
    "toxic": [
        "Watermelon Peperomia is generally non-toxic and considered safe around pets and children."
    ],
    "extra_care_tip": [
        "Regularly wipe the leaves with a damp cloth to remove dust and help the plant breathe.",
        "Turn the pot occasionally for even growth, preventing the plant from leaning toward the light.",
        "Avoid over-fertilizing; a balanced, diluted fertilizer once a month during growing seasons suffices.",
        "Prune occasionally to remove any dead or damaged leaves and encourage bushier growth."
    ]
}