{
    "name": "Weeping Crabapple",
    "climate": [
        "Weeping Crabapple trees thrive in temperate climates with cold winters.",
        "They prefer regions with well-defined seasonal changes for optimal growth.",
        "These trees are well-suited to hardiness zones 4 through 8 in the USA.",
        "Avoid planting in areas prone to extreme temperatures or high humidity."
    ],
    "sunlight": [
        "Weeping Crabapples require full sunlight for at least six hours a day.",
        "Insufficient sunlight can lead to poor flowering and reduced fruit yield.",
        "The trees should be planted in areas where they are not shaded by buildings.",
        "Consistent sunlight exposure is crucial for their overall health and vigor."
    ],
    "watering": [
        "Weeping Crabapple trees need consistent watering, particularly in dry periods.",
        "Ensure the soil remains moist but not waterlogged to prevent root rot.",
        "Avoid letting the soil completely dry out, especially during blooming season.",
        "Water deeply but infrequently, allowing the soil to partially dry between sessions."
    ],
    "soil": [
        "These trees prefer well-drained, loamy soil with a slightly acidic pH.",
        "Soil that retains moisture is beneficial, but avoid heavy clay soils.",
        "They can tolerate a range of soils but thrive best in rich, fertile ground.",
        "Incorporating organic matter into the soil can enhance growth and health."
    ],
    "toxic": [
        "The seeds of the crabapple fruit contain cyanogenic compounds making them toxic.",
        "Consumption of large quantities of seeds can be harmful to pets and humans.",
        "Fruits are generally safe if seeds are not ingested; always supervise pets.",
        "Symptoms of poisoning can include vomiting and diarrhea in affected animals."
    ],
    "extra_care_tip": [
        "Prune the tree in late winter to encourage optimal shape and flower production.",
        "Monitor the tree for signs of fire blight, a common disease in crabapples.",
        "Using fungicidal sprays during damp seasons can prevent fungal diseases.",
        "Regularly remove fallen leaves and debris to minimize pest and disease risks."
    ]
}