{
    "name": "Weeping Fig",
    "climate": [
        "The weeping fig prefers warm, tropical climates similar to its native habitat in Asia and Australia. It thrives in conditions where the temperature is consistently between 18 to 24 degrees Celsius.",
        "Humidity is an important factor for the healthy growth of the weeping fig. High humidity levels are preferred, though it can tolerate moderate indoor humidity if necessary.",
        "The plant does not tolerate cold drafts or sudden changes in temperature, which can cause leaf drop. Keeping them away from air conditioners and heaters is beneficial.",
        "While weeping figs can adjust to a range of indoor conditions, they do best in environments that mimic their natural warm and humid forest habitats."
    ],
    "sunlight": [
        "Weeping figs require a good amount of indirect sunlight to flourish. Direct sunlight should be avoided as it can cause leaf burn.",
        "They adapt well to bright, filtered light but can tolerate partial shade. However, too little light can lead to sparse, leggy growth.",
        "Moving a weeping fig from low light to direct sunlight suddenly can cause shock, so gradual acclimation is advised.",
        "A consistent lighting condition helps prevent leaf drop. It is important to keep them away from direct drafts though near windows."
    ],
    "watering": [
        "Moderate watering practices are crucial; the soil should be kept consistently moist but not waterlogged.",
        "Allowing the top few inches of soil to dry out between waterings is ideal. Overwatering can lead to root rot.",
        "In the dormant winter months, the watering needs may decrease, requiring adjustments to the watering schedule.",
        "Using tepid water can prevent shock to the plant, and it is important to ensure adequate drainage in the pot or container."
    ],
    "soil": [
        "A rich, well-draining potting soil is suitable for weeping figs. A mix with peat and perlite can enhance drainage and aeration.",
        "The soil should be able to retain enough moisture while still allowing excess water to drain away freely.",
        "Refrain from using garden soil which can be too heavy and may not provide adequate aeration or drainage.",
        "Periodic repotting to refresh the soil and provide additional nutrients may be necessary every couple of years."
    ],
    "toxic": [
        "Weeping figs are toxic to pets, such as cats and dogs, and can cause irritation upon ingestion or skin contact.",
        "The sap contains compounds that can cause gastrointestinal distress and allergic reactions in humans and animals."
    ],
    "extra_care_tip": [
        "Regularly rotating the plant can help achieve balanced growth by ensuring all sides receive sufficient light.",
        "Pruning can help maintain the shape and size of the plant. It's best done in the spring when the plant is actively growing."
    ]
}