{
    "name": "White Wizard Philodendron",
    "climate": [
        "The White Wizard Philodendron thrives in tropical climates where humidity is high.",
        "It can also be grown successfully indoors if the climate is kept consistently warm.",
        "Avoid exposing the plant to cold drafts as it can damage the leaves and overall health.",
        "A stable indoor climate with temperatures ranging from 65°F to 80°F is ideal."
    ],
    "sunlight": [
        "Prefers bright, indirect sunlight; direct sun can scorch its leaves.",
        "Can adapt to low light conditions but may grow more slowly if light is insufficient.",
        "Rotate the plant occasionally to ensure even growth across all sides.",
        "To maintain vibrant leaf colors, ensure it receives adequate natural light."
    ],
    "watering": [
        "Water the plant when the top inch of the soil feels dry; overwatering can cause root rot.",
        "Ensure the pot has good drainage to prevent water logging, which can harm the plant.",
        "Increase watering frequency during the growing season when the plant is more active.",
        "Reduce watering in the winter months as the plant's growth and water needs decrease."
    ],
    "soil": [
        "Prefers a well-draining soil mix rich in organic matter for optimal growth.",
        "A mix of potting soil, perlite, and orchid bark provides good aeration and drainage.",
        "Ensure the soil remains slightly acidic to neutral, ideally around a pH of 6 to 7.",
        "Repotting every two years with fresh soil is beneficial for healthy root development."
    ],
    "toxic": [
        "The White Wizard Philodendron is toxic to pets and humans if ingested.",
        "Keep the plant out of reach of pets and children to prevent accidental ingestion."
    ],
    "extra_care_tip": [
        "Regularly clean the leaves with a damp cloth to remove dust and improve photosynthesis.",
        "Consider using a humidifier in dry climates to maintain high humidity levels around the plant."
    ]
}