{
    "name": "White Frangipani",
    "climate": [
        "White Frangipani thrives in tropical and subtropical climates, where temperatures are warm most of the year.",
        "This plant can tolerate dry periods but prefers climates with some humidity for optimal growth.",
        "Frangipanis can also adapt to coastal climates, as they tolerate salty air environments.",
        "While it prefers hot climates, White Frangipani can withstand short periods of cold if not freezing."
    ],
    "sunlight": [
        "White Frangipani requires full sun exposure; ideally, it should receive at least six hours of sunlight per day.",
        "Partial shade can be tolerated, but full sun is necessary for abundant blooms and healthy growth.",
        "When grown indoors, placing it by a south or west-facing window ensures adequate sunlight exposure.",
        "Without sufficient sunlight, the plant may not bloom well and might have leggy growth."
    ],
    "watering": [
        "Water White Frangipani thoroughly during the active growing season, ensuring even moisture.",
        "Reduce watering significantly during the dormant phase, typically in the colder months.",
        "Ensure the soil has good drainage to prevent root rot, which can occur in overly saturated soil.",
        "Allow the top inch of soil to dry out between watering sessions, keying to the plant's drought tolerance."
    ],
    "soil": [
        "Sandy or gritty soil with excellent drainage is ideal for White Frangipani, mimicking its native environments.",
        "A mix of cactus soil with some organic matter can provide the right balance of drainage and nutrients.",
        "It's crucial that the soil remains well-draining to prevent disease and promote healthy root systems.",
        "If planting in a pot, use a container with drainage holes to further encourage messy, airy conditions."
    ],
    "toxic": [
        "White Frangipani is considered toxic to pets and humans if ingested, causing digestive discomfort."
    ],
    "extra_care_tip": [
        "Prune in late winter or early spring to shape the plant, removing any dead branches for recent growth.",
        "In colder areas, consider bringing potted plants indoors or covering outdoor ones during frosty weather.",
        "To encourage blooming, avoid excessive fertilization as it could promote leaf growth over flowers.",
        "Watch for pests like spider mites and aphids; treat infestations with appropriate insecticidal soap."
    ]
}