{
    "name": "Yarrow",
    "climate": [
        "Yarrow thrives in temperate climates with moderate temperatures.",
        "It can also grow in continental climates with warm summers and cold winters.",
        "The plant is adaptable to a semi-arid climate with occasional rainfall.",
        "Best suited to Mediterranean climates with dry, hot summers and wet winters."
    ],
    "sunlight": [
        "Yarrow requires full sun to thrive, ideally with six or more hours of sunlight per day.",
        "While it can tolerate partial shade, full sun encourages better flowering and growth.",
        "Direct sunlight ensures that yarrow can produce vibrant blooms and strong stems.",
        "Avoid planting in areas with heavy shade as the plant may become weak and leggy."
    ],
    "watering": [
        "Yarrow is quite drought-tolerant and requires infrequent watering once established.",
        "During prolonged dry periods, water deeply once every two weeks to maintain health.",
        "Avoid overwatering as yarrow prefers drier conditions and well-drained soil.",
        "Ensure that the soil dries out between waterings to prevent root rot and other issues."
    ],
    "soil": [
        "Yarrow grows well in poor to average soil, provided it has good drainage qualities.",
        "Sandy or rocky soil types are ideal as they prevent waterlogging and promote health.",
        "While it tolerates clay soil, adding organic matter improves drainage and fertility.",
        "The plant is adaptable to various soil pH levels but prefers slightly acidic to neutral."
    ],
    "toxic": [],
    "extra_care_tip": [
        "Deadhead spent blooms to encourage more flowers and maintain a tidy appearance.",
        "Divide yarrow clumps every 2 to 3 years to prevent overcrowding and reinvigorate growth.",
        "Stake taller varieties to prevent flopping, especially in windy conditions.",
        "Regular pruning can help control its spread and promote lush, healthy foliage."
    ]
}