{
    "name": "Yellow Iris",
    "climate": [
        "Yellow Irises prefer temperate climates where the winters are not too harsh.",
        "They can adapt to various climates but thrive best in moist, cool environments.",
        "In warmer regions, Yellow Irises need some protection from the midday sun.",
        "They grow well in areas with mild winters and moderate summer temperatures."
    ],
    "sunlight": [
        "Yellow Irises require full sun to partial shade for optimal growth.",
        "They need at least six hours of sunlight daily to bloom properly.",
        "Partial shade can be beneficial in extremely hot climates to prevent wilting.",
        "Direct sunlight ensures vibrant blooms and healthy foliage for these flowers."
    ],
    "watering": [
        "Yellow Irises prefer soil that is consistently moist but not waterlogged.",
        "Regular watering is necessary, especially during dry spells and growing seasons.",
        "Ensure good drainage to prevent root rot, a common issue with overwatering.",
        "Mulching can help retain moisture and reduce the need for frequent watering."
    ],
    "soil": [
        "Yellow Irises grow best in soil that is rich in organic matter for nutrients.",
        "Well-drained soil is crucial to prevent problems caused by standing water.",
        "Slightly acidic to neutral soil pH is ideal for the growth of Yellow Irises.",
        "Amend the soil with compost or aged manure to improve fertility and structure."
    ],
    "toxic": [
        "Yellow Irises contain compounds that can be toxic if ingested by pets or humans.",
        "All parts of the plant, especially rhizomes, can cause irritation or illness.",
        "Symptoms of toxicity may include stomach pain, nausea, or vomiting.",
        "Handle with care and keep away from pets and children to avoid accidental ingestion."
    ],
    "extra_care_tip": [
        "Divide clumps every three to five years to ensure healthy growth and blooming.",
        "Remove spent blooms to encourage more flowering and maintain plant vigor.",
        "In colder climates, winter mulch can protect rhizomes from freezing temperatures.",
        "Watch for pests like iris borers, which can damage the rhizomes significantly."
    ]
}