{
    "name": "Yellow Bells",
    "climate": [
        "Yellow Bells thrive in warm climates, particularly in regions with minimal frost.",
        "This plant is suitable for tropical to subtropical climates with moderate humidity levels.",
        "It can tolerate some variations in climate, favoring locations with mild winters.",
        "The ideal environment involves temperatures that don't frequently dip below freezing."
    ],
    "sunlight": [
        "Yellow Bells prefer full sunlight exposure for optimal growth and flowering.",
        "They can tolerate partial shade, but flowering is significantly improved in direct sunlight.",
        "These plants require at least 6 to 8 hours of sunlight daily for healthy development.",
        "A sunny position is crucial, but protection from harsh afternoon sun is sometimes beneficial."
    ],
    "watering": [
        "Water the Yellow Bells regularly, allowing the soil to dry slightly between waterings.",
        "Ensure good drainage to prevent root rot, especially during colder seasons.",
        "During the flowering season, maintain consistent moisture to encourage bloom production.",
        "In winter, water sparingly as the plant enters dormancy and reduces its water needs."
    ],
    "soil": [
        "Yellow Bells thrive in well-draining soil enriched with organic matter for best results.",
        "A slightly sandy or loamy soil mixture helps prevent waterlogging and supports root aeration.",
        "The plant benefits from a soil pH range of 6.6 to 7.5, accommodating mild acidity to neutral.",
        "Enrich the soil with compost or mulch to retain moisture and improve nutrient availability."
    ],
    "toxic": [
        "Yellow Bells contain compounds that can be toxic if ingested, particularly affecting pets.",
        "All parts of the plant are potentially toxic, with ingestion causing vomiting or diarrhea in animals."
    ],
    "extra_care_tip": [
        "Pruning Yellow Bells after flowering promotes bushiness and encourages more blooms next season.",
        "Mulching helps conserve soil moisture and suppresses weed growth, particularly in hot climates."
    ]
}