{
    "name": "Yew Tree",
    "climate": [
        "Yew trees thrive in temperate climates where there are distinct seasons.",
        "They are well-suited to climates with mild, wet winters and warm summers.",
        "Yew trees can tolerate a range of climates but prefer environments without extremes.",
        "Regions with moderate humidity and consistent rainfall are ideal for yew growth."
    ],
    "sunlight": [
        "Yew trees grow well in partial to full shade but can tolerate some sunlight.",
        "They are versatile and can thrive in low light, making them suitable for shaded areas.",
        "Direct sunlight should be limited, as too much can scorch the foliage of yews.",
        "Filtered or dappled sunlight throughout the day is optimal for their growth."
    ],
    "watering": [
        "Yew trees need well-drained soil, so avoid overwatering to prevent root rot.",
        "They prefer moderately moist soil, but established trees are fairly drought-tolerant.",
        "Regular watering is essential during the first few years after planting.",
        "Once established, yews can survive with minimal watering except during droughts."
    ],
    "soil": [
        "Yew trees thrive in well-draining soils rich in organic matter for best growth.",
        "They can adapt to various soil types, including sandy, clay, and loamy soils.",
        "The ideal pH for yew trees is between 6.0 and 7.5, which ensures nutrient availability.",
        "Compacted or poorly-draining soils should be amended to support root development."
    ],
    "toxic": [
        "All parts of the yew tree, particularly the seeds and leaves, are highly toxic.",
        "Ingestion of yew tree parts can be fatal to humans and animals due to taxine alkaloids.",
        "Extreme caution is advised with pets and children around yew trees.",
        "Consult a medical professional immediately if ingestion is suspected."
    ],
    "extra_care_tip": [
        "Pruning should be done in early spring to maintain shape and encourage new growth.",
        "Mulching around the base can help retain moisture and suppress weeds effectively.",
        "Monitor for yew scale insects and treat infestations promptly for healthy growth.",
        "Regular inspection for root rot and fungal issues is recommended in wet climates."
    ]
}