{
    "name": "Zebra Plant",
    "climate": [
        "Zebra plants thrive in warm climates, preferring temperatures between 65°F and 80°F.",
        "They are native to tropical regions and need consistent humidity to grow well.",
        "It's important to keep them away from cold drafts and sudden temperature changes.",
        "Avoid temperatures dropping below 55°F, as they are not frost-tolerant."
    ],
    "sunlight": [
        "Zebra plants require bright, indirect sunlight to flourish effectively.",
        "Direct sunlight can scorch the leaves and should be avoided during peak hours.",
        "If indoors, place the plant near a north or east-facing window for optimal light.",
        "Artificial grow lights can supplement their light needs in darker environments."
    ],
    "watering": [
        "Keep the soil consistently moist but not waterlogged throughout the growing season.",
        "Allow the top inch of soil to dry out before the next watering during cooler months.",
        "Use lukewarm water to prevent shocking the plant's root system during watering.",
        "Humidity trays can help maintain moisture levels in drier indoor environments."
    ],
    "soil": [
        "Zebra plants prefer a rich, well-draining potting soil to prevent root rot.",
        "A mixture of peat, perlite, and vermiculite works well for these plants.",
        "Make sure the pot has drainage holes to allow excess water to escape.",
        "Refresh the top layer of soil annually to provide nutrients and aeration."
    ],
    "toxic": [
        "Zebra plants are considered non-toxic to both pets and humans."
    ],
    "extra_care_tip": [
        "Regularly wipe the leaves with a damp cloth to remove dust and allow better light absorption.",
        "In low humidity environments, mist the plant or use a humidifier to maintain suitable conditions.",
        "Fertilize every two weeks during the growing season with a balanced liquid fertilizer.",
        "Prune any dead or dying leaves to encourage healthy new growth and improve appearance."
    ]
}