{
    "name": "Zygopetalum Orchid",
    "climate": [
        "Zygopetalum orchids thrive in a climate that provides high humidity and moderate temperatures, similar to tropical environments.",
        "They prefer temperatures between 60-75°F during the day and cooler temperatures at night to simulate their natural habitat.",
        "These orchids can be sensitive to extreme temperature fluctuations, requiring stable conditions for optimal growth.",
        "Maintaining humidity levels around 60% is ideal, providing a humid yet airy environment for these orchids."
    ],
    "sunlight": [
        "Zygopetalum orchids require bright, indirect sunlight to flourish and avoid direct harsh rays.",
        "Situating these orchids near east or west-facing windows provides ample light without scorching them.",
        "They can suffer from leaf burn if exposed directly to intense midday sun, needing protection during hot periods.",
        "Artificial grow lights can supplement natural light during winter months or in shaded spots."
    ],
    "watering": [
        "These orchids benefit from being watered consistently but never left sitting in stagnant water.",
        "Their potting medium should be allowed to dry slightly between waterings to prevent root rot.",
        "Depending on temperature and light levels, watering frequency may vary from weekly to bi-weekly.",
        "Use room temperature water and avoid getting water on leaves or the crown to reduce the risk of disease."
    ],
    "soil": [
        "Zygopetalum orchids thrive in well-draining bark-based orchid mixes that provide aeration.",
        "Their potting mix should allow moisture retention while preventing waterlogging of roots.",
        "Orchid potting mix containing perlite or charcoal can enhance drainage and air circulation.",
        "Re-potting every 1-2 years with fresh orchid mix ensures nutrient availability and root health."
    ],
    "toxic": [
        "Zygopetalum orchids are generally non-toxic to pets, making them safe for households with animals."
    ],
    "extra_care_tip": [
        "Avoid cold drafts or sudden temperature changes to prevent stress or damage to the plant.",
        "Provide air circulation without placing the plant directly in the path of cooling or heating vents."
    ]
}